// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x44)]
public unsafe partial struct Achievement {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    /// <remarks>Item</remarks>
    [FieldOffset(0x08)] public uint Item;
    [FieldOffset(0x0C)] public int Key;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray8<int> _data;
    /// <remarks>Title</remarks>
    [FieldOffset(0x30)] public ushort Title;
    [FieldOffset(0x32)] public ushort Icon;
    [FieldOffset(0x34)] public ushort Order;
    /// <remarks>AchievementCategory</remarks>
    [FieldOffset(0x36)] public byte AchievementCategory;
    /// <remarks>AchievementTarget</remarks>
    [FieldOffset(0x37)] public byte AchievementTarget;
    [FieldOffset(0x38)] public byte Unknown0;
    [FieldOffset(0x39)] public byte Points;
    [FieldOffset(0x3A)] public byte Unknown1;
    [FieldOffset(0x3B)] public byte Unknown2;
    [FieldOffset(0x3C)] public byte Unknown3;
    [FieldOffset(0x3D)] public byte Unknown4;
    [FieldOffset(0x3E)] public byte Type;
    [FieldOffset(0x3F)] public byte Unknown5;
    /// <remarks>AchievementHideCondition</remarks>
    [FieldOffset(0x40)] public byte AchievementHideCondition;
}
