// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct AkatsukiNote {
    [FieldOffset(0x00)] public int Unknown0;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public int Unknown2;
    [FieldOffset(0x0C)] public int Unknown3;
    [FieldOffset(0x10)] public int Unknown4;
    [FieldOffset(0x14)] public int Unknown5;
    [FieldOffset(0x18)] public int Unknown6;
    [FieldOffset(0x1C)] public int Unknown7;
    [FieldOffset(0x20)] public int Unknown8;
}
