// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct AozActionTransient {
    [FieldOffset(0x00)] public int Stats_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    [FieldOffset(0x08)] public uint Icon;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x0C)] public uint RequiredForQuest;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x10)] public uint PreviousQuest;
    [FieldOffset(0x14)] public ushort Location;
    [FieldOffset(0x16)] public byte Number;
    [FieldOffset(0x17)] public byte LocationKey;
    [FieldOffset(0x18)] public BitField18Flags BitField18;
    public bool TargetsEnemy => BitField18.HasFlag(BitField18Flags.TargetsEnemy);
    public bool TargetsSelfOrAlly => BitField18.HasFlag(BitField18Flags.TargetsSelfOrAlly);
    public bool CauseSlow => BitField18.HasFlag(BitField18Flags.CauseSlow);
    public bool CausePetrify => BitField18.HasFlag(BitField18Flags.CausePetrify);
    public bool CauseParalysis => BitField18.HasFlag(BitField18Flags.CauseParalysis);
    public bool CauseInterrupt => BitField18.HasFlag(BitField18Flags.CauseInterrupt);
    public bool CauseBlind => BitField18.HasFlag(BitField18Flags.CauseBlind);
    public bool CauseStun => BitField18.HasFlag(BitField18Flags.CauseStun);
    [FieldOffset(0x19)] public BitField19Flags BitField19;
    public bool CauseSleep => BitField19.HasFlag(BitField19Flags.CauseSleep);
    public bool CauseBind => BitField19.HasFlag(BitField19Flags.CauseBind);
    public bool CauseHeavy => BitField19.HasFlag(BitField19Flags.CauseHeavy);
    public bool CauseDeath => BitField19.HasFlag(BitField19Flags.CauseDeath);

    [Flags]
    public enum BitField18Flags : byte {
    	TargetsEnemy = 1 << 0,
    	TargetsSelfOrAlly = 1 << 1,
    	CauseSlow = 1 << 2,
    	CausePetrify = 1 << 3,
    	CauseParalysis = 1 << 4,
    	CauseInterrupt = 1 << 5,
    	CauseBlind = 1 << 6,
    	CauseStun = 1 << 7,
    }
    [Flags]
    public enum BitField19Flags : byte {
    	CauseSleep = 1 << 0,
    	CauseBind = 1 << 1,
    	CauseHeavy = 1 << 2,
    	CauseDeath = 1 << 3,
    }
}
