// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct AOZContent {
    [FieldOffset(0x00)] public ushort GilReward;
    [FieldOffset(0x02)] public ushort AlliedSealsReward;
    [FieldOffset(0x04)] public ushort TomestonesReward;
    /// <remarks>ContentEntry</remarks>
    [FieldOffset(0x08)] public uint ContentEntry;
    [FieldOffset(0x0C)] public ushort StandardFinishTime;
    [FieldOffset(0x0E)] public ushort IdealFinishTime;
    [FieldOffset(0x10)] public ushort Act1;
    [FieldOffset(0x12)] public ushort Act2;
    [FieldOffset(0x14)] public ushort Act3;
    [FieldOffset(0x16)] public ushort Unknown0;
    [FieldOffset(0x18)] public ushort Unknown1;
    [FieldOffset(0x1A)] public ushort Unknown2;
    [FieldOffset(0x1C)] public byte Act1FightType;
    [FieldOffset(0x1D)] public byte Act2FightType;
    [FieldOffset(0x1E)] public byte Act3FightType;
    [FieldOffset(0x1F)] public byte ArenaType1;
    [FieldOffset(0x20)] public byte ArenaType2;
    [FieldOffset(0x21)] public byte ArenaType3;
    [FieldOffset(0x22)] public byte Order;
}
