// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0xA4)]
public unsafe partial struct Attributive {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1_Offset;
    [FieldOffset(0x08)] public int Unknown2_Offset;
    [FieldOffset(0x0C)] public int Unknown3_Offset;
    [FieldOffset(0x10)] public int Unknown4_Offset;
    [FieldOffset(0x14)] public int Unknown5_Offset;
    [FieldOffset(0x18)] public int Unknown6_Offset;
    [FieldOffset(0x1C)] public int Unknown7_Offset;
    [FieldOffset(0x20)] public int Unknown8_Offset;
    [FieldOffset(0x24)] public int Unknown9_Offset;
    [FieldOffset(0x28)] public int Unknown10_Offset;
    [FieldOffset(0x2C)] public int Unknown11_Offset;
    [FieldOffset(0x30)] public int Unknown12_Offset;
    [FieldOffset(0x34)] public int Unknown13_Offset;
    [FieldOffset(0x38)] public int Unknown14_Offset;
    [FieldOffset(0x3C)] public int Unknown15_Offset;
    [FieldOffset(0x40)] public int Unknown16_Offset;
    [FieldOffset(0x44)] public int Unknown17_Offset;
    [FieldOffset(0x48)] public int Unknown18_Offset;
    [FieldOffset(0x4C)] public int Unknown19_Offset;
    [FieldOffset(0x50)] public int Unknown20_Offset;
    [FieldOffset(0x54)] public int Unknown21_Offset;
    [FieldOffset(0x58)] public int Unknown22_Offset;
    [FieldOffset(0x5C)] public int Unknown23_Offset;
    [FieldOffset(0x60)] public int Unknown24_Offset;
    [FieldOffset(0x64)] public int Unknown25_Offset;
    [FieldOffset(0x68)] public int Unknown26_Offset;
    [FieldOffset(0x6C)] public int Unknown27_Offset;
    [FieldOffset(0x70)] public int Unknown28_Offset;
    [FieldOffset(0x74)] public int Unknown29_Offset;
    [FieldOffset(0x78)] public int Unknown30_Offset;
    [FieldOffset(0x7C)] public int Unknown31_Offset;
    [FieldOffset(0x80)] public int Unknown32_Offset;
    [FieldOffset(0x84)] public int Unknown33_Offset;
    [FieldOffset(0x88)] public int Unknown34_Offset;
    [FieldOffset(0x8C)] public int Unknown35_Offset;
    [FieldOffset(0x90)] public int Unknown36_Offset;
    [FieldOffset(0x94)] public int Unknown37_Offset;
    [FieldOffset(0x98)] public int Unknown38_Offset;
    [FieldOffset(0x9C)] public int Unknown39_Offset;
    [FieldOffset(0xA0)] public int Unknown40_Offset;
}
