// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct Ballista {
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x00)] public ushort BNPC;
    [FieldOffset(0x02)] public ushort Angle;
    /// <remarks>Action</remarks>
    [FieldOffset(0x04)] public ushort Action0;
    /// <remarks>Action</remarks>
    [FieldOffset(0x06)] public ushort Action1;
    /// <remarks>Action</remarks>
    [FieldOffset(0x08)] public ushort Action2;
    /// <remarks>Action</remarks>
    [FieldOffset(0x0A)] public ushort Action3;
    [FieldOffset(0x0C)] public byte Bullet;
    [FieldOffset(0x0D)] public byte Unknown0;
    [FieldOffset(0x0E)] public byte Unknown1;
    [FieldOffset(0x0F)] public sbyte Near;
    [FieldOffset(0x10)] public sbyte Far;
}
