// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x50)]
public unsafe partial struct BankaCraftWorksSupply {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public ushort Unknown2;
    [FieldOffset(0x0A)] public ushort Unknown3;
    [FieldOffset(0x0C)] public byte Unknown4;
    [FieldOffset(0x0D)] public byte Unknown5;
    [FieldOffset(0x0E)] public byte Unknown6;
    [FieldOffset(0x0F)] public byte Unknown7;
    [FieldOffset(0x10)] public byte Unknown8;
    [FieldOffset(0x11)] public byte Unknown9;
    [FieldOffset(0x14)] public uint Unknown10;
    [FieldOffset(0x18)] public uint Unknown11;
    [FieldOffset(0x1C)] public ushort Unknown12;
    [FieldOffset(0x1E)] public ushort Unknown13;
    [FieldOffset(0x20)] public byte Unknown14;
    [FieldOffset(0x21)] public byte Unknown15;
    [FieldOffset(0x22)] public byte Unknown16;
    [FieldOffset(0x23)] public byte Unknown17;
    [FieldOffset(0x24)] public byte Unknown18;
    [FieldOffset(0x25)] public byte Unknown19;
    [FieldOffset(0x28)] public uint Unknown20;
    [FieldOffset(0x2C)] public uint Unknown21;
    [FieldOffset(0x30)] public ushort Unknown22;
    [FieldOffset(0x32)] public ushort Unknown23;
    [FieldOffset(0x34)] public byte Unknown24;
    [FieldOffset(0x35)] public byte Unknown25;
    [FieldOffset(0x36)] public byte Unknown26;
    [FieldOffset(0x37)] public byte Unknown27;
    [FieldOffset(0x38)] public byte Unknown28;
    [FieldOffset(0x39)] public byte Unknown29;
    [FieldOffset(0x3C)] public uint Unknown30;
    [FieldOffset(0x40)] public uint Unknown31;
    [FieldOffset(0x44)] public ushort Unknown32;
    [FieldOffset(0x46)] public ushort Unknown33;
    [FieldOffset(0x48)] public byte Unknown34;
    [FieldOffset(0x49)] public byte Unknown35;
    [FieldOffset(0x4A)] public byte Unknown36;
    [FieldOffset(0x4B)] public byte Unknown37;
    [FieldOffset(0x4C)] public byte Unknown38;
    [FieldOffset(0x4D)] public byte Unknown39;
}
