// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x44)]
public unsafe partial struct BannerPreset {
    [FieldOffset(0x00)] public float Unknown0;
    [FieldOffset(0x04)] public float Unknown1;
    [FieldOffset(0x08)] public float Unknown2;
    [FieldOffset(0x0C)] public float Unknown3;
    [FieldOffset(0x10)] public float Unknown4;
    [FieldOffset(0x14)] public float Unknown5;
    [FieldOffset(0x18)] public float Unknown6;
    [FieldOffset(0x1C)] public float Unknown7;
    [FieldOffset(0x20)] public float Unknown8;
    [FieldOffset(0x24)] public float Unknown9;
    [FieldOffset(0x28)] public float Unknown10;
    [FieldOffset(0x2C)] public int Unknown11;
    [FieldOffset(0x30)] public ushort Unknown12;
    [FieldOffset(0x32)] public short Unknown13;
    [FieldOffset(0x34)] public short Unknown14;
    [FieldOffset(0x36)] public short Unknown15;
    [FieldOffset(0x38)] public byte Unknown16;
    [FieldOffset(0x39)] public byte Unknown17;
    [FieldOffset(0x3A)] public byte Unknown18;
    [FieldOffset(0x3B)] public byte Unknown19;
    [FieldOffset(0x3C)] public byte Unknown20;
    [FieldOffset(0x3D)] public byte Unknown21;
    [FieldOffset(0x3E)] public byte Unknown22;
    [FieldOffset(0x3F)] public byte Unknown23;
    [FieldOffset(0x40)] public byte Unknown24;
    [FieldOffset(0x41)] public byte Unknown25;
}
