// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct BannerCondition {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray6<uint> _unlockCriteria1;
    [FieldOffset(0x18)] public uint UnlockCriteria2;
    [FieldOffset(0x1C)] public uint UnlockCriteria3;
    [FieldOffset(0x20)] public uint UnlockCriteria4;
    [FieldOffset(0x24)] public uint Prerequisite;
    [FieldOffset(0x28)] public byte UnlockType1;
    [FieldOffset(0x29)] public byte UnlockType2;
    [FieldOffset(0x2A)] public byte PrerequisiteType;
    /// <remarks>BannerObtainHintType</remarks>
    [FieldOffset(0x2B)] public byte UnlockHint;
    [FieldOffset(0x2C)] public bool Unknown0;
}
