// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct BannerTimeline {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public uint AdditionalData;
    [FieldOffset(0x08)] public int Icon;
    /// <remarks>BannerCondition</remarks>
    [FieldOffset(0x0C)] public ushort UnlockCondition;
    [FieldOffset(0x0E)] public ushort Unknown_70_1;
    [FieldOffset(0x10)] public ushort Unknown_70_2;
    [FieldOffset(0x12)] public ushort SortKey;
    [FieldOffset(0x14)] public byte Type;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x15)] public byte AcceptClassJobCategory;
    [FieldOffset(0x16)] public byte Category;
}
