// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x44)]
public unsafe partial struct BaseParam {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    [FieldOffset(0x08)] public ushort OneHandWeaponPercent;
    [FieldOffset(0x0A)] public ushort OffHandPercent;
    [FieldOffset(0x0C)] public ushort HeadPercent;
    [FieldOffset(0x0E)] public ushort ChestPercent;
    [FieldOffset(0x10)] public ushort HandsPercent;
    [FieldOffset(0x12)] public ushort WaistPercent;
    [FieldOffset(0x14)] public ushort LegsPercent;
    [FieldOffset(0x16)] public ushort FeetPercent;
    [FieldOffset(0x18)] public ushort EarringPercent;
    [FieldOffset(0x1A)] public ushort NecklacePercent;
    [FieldOffset(0x1C)] public ushort BraceletPercent;
    [FieldOffset(0x1E)] public ushort RingPercent;
    [FieldOffset(0x20)] public ushort TwoHandWeaponPercent;
    [FieldOffset(0x22)] public ushort UnderArmorPercent;
    [FieldOffset(0x24)] public ushort ChestHeadPercent;
    [FieldOffset(0x26)] public ushort ChestHeadLegsFeetPercent;
    [FieldOffset(0x28)] public ushort Unknown0;
    [FieldOffset(0x2A)] public ushort LegsFeetPercent;
    [FieldOffset(0x2C)] public ushort HeadChestHandsLegsFeetPercent;
    [FieldOffset(0x2E)] public ushort ChestLegsGlovesPercent;
    [FieldOffset(0x30)] public ushort ChestLegsFeetPercent;
    [FieldOffset(0x32)] public ushort Unknown1;
    [FieldOffset(0x34)] public byte OrderPriority;
    [FieldOffset(0x35), FixedSizeArray] internal FixedSizeArray13<byte> _meldParam;
    [FieldOffset(0x42)] public sbyte PacketIndex;
    [FieldOffset(0x43)] public bool Unknown2;
}
