// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct Battalion {
    [FieldOffset(0x00)] public bool Unknown0;
    [FieldOffset(0x01)] public bool Unknown1;
    [FieldOffset(0x02)] public bool Unknown2;
    [FieldOffset(0x03)] public bool Unknown3;
    [FieldOffset(0x04)] public bool Unknown4;
    [FieldOffset(0x05)] public bool Unknown5;
    [FieldOffset(0x06)] public bool Unknown6;
    [FieldOffset(0x07)] public bool Unknown7;
    [FieldOffset(0x08)] public bool Unknown8;
    [FieldOffset(0x09)] public bool Unknown9;
    [FieldOffset(0x0A)] public bool Unknown10;
    [FieldOffset(0x0B)] public bool Unknown11;
    [FieldOffset(0x0C)] public bool Unknown12;
    [FieldOffset(0x0D)] public bool Unknown13;
    [FieldOffset(0x0E)] public bool Unknown14;
}
