// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x1A8)]
public unsafe partial struct BattleLeve {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray8<ushort> _time;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray8<LeveDataStruct> _leveData;
    [FieldOffset(0x190), FixedSizeArray] internal FixedSizeArray8<byte> _toDoSequence;
    /// <remarks>BattleLeveRule</remarks>
    [FieldOffset(0x198)] public int Rule;
    [FieldOffset(0x19C), FixedSizeArray] internal FixedSizeArray3<ushort> _objectives;
    [FieldOffset(0x1A2), FixedSizeArray] internal FixedSizeArray2<ushort> _help;
    [FieldOffset(0x1A6)] public byte Variant;

    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public partial struct LeveDataStruct {
        /// <remarks>BNpcName</remarks>
        [FieldOffset(0x00)] public uint BNpcName;
        [FieldOffset(0x04)] public uint ToDoNumberInvolved;
        [FieldOffset(0x08), FixedSizeArray] internal FixedSizeArray5<uint> _toDoParam;
        /// <remarks>EventItem, BNpcBase</remarks>
        [FieldOffset(0x1C)] public int BaseID;
        /// <remarks>EventItem</remarks>
        [FieldOffset(0x20)] public int ItemsInvolved;
        [FieldOffset(0x24)] public ushort EnemyLevel;
        [FieldOffset(0x26)] public byte ItemsInvolvedQty;
        [FieldOffset(0x27)] public byte ItemDropRate;
        [FieldOffset(0x28), FixedSizeArray] internal FixedSizeArray8<byte> _numOfAppearance;
    }
}
