// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct BeastRankBonus {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint Item;
    [FieldOffset(0x04)] public ushort Neutral;
    [FieldOffset(0x06)] public ushort Recognized;
    [FieldOffset(0x08)] public ushort Friendly;
    [FieldOffset(0x0A)] public ushort Trusted;
    [FieldOffset(0x0C)] public ushort Respected;
    [FieldOffset(0x0E)] public ushort Honored;
    [FieldOffset(0x10)] public ushort Sworn;
    [FieldOffset(0x12)] public ushort AlliedBloodsworn;
    [FieldOffset(0x14), FixedSizeArray] internal FixedSizeArray8<byte> _itemQuantity;
}
