// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct BeastTribe {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int NameRelation_Offset;
    [FieldOffset(0x0C)] public sbyte Adjective;
    [FieldOffset(0x0D)] public sbyte PossessivePronoun;
    [FieldOffset(0x0E)] public sbyte StartsWithVowel;
    [FieldOffset(0x0F)] public sbyte Pronoun;
    [FieldOffset(0x10)] public sbyte Article;
    [FieldOffset(0x11)] public sbyte DEF;
    [FieldOffset(0x14)] public uint IconReputation;
    [FieldOffset(0x18)] public uint Icon;
    [FieldOffset(0x1C)] public uint Unknown1;
    /// <remarks>Item</remarks>
    [FieldOffset(0x20)] public uint CurrencyItem;
    [FieldOffset(0x24)] public byte MinLevel;
    /// <remarks>BeastRankBonus</remarks>
    [FieldOffset(0x25)] public byte BeastRankBonus;
    [FieldOffset(0x26)] public byte MaxRank;
    /// <remarks>ExVersion</remarks>
    [FieldOffset(0x27)] public byte Expansion;
    [FieldOffset(0x28)] public byte DisplayOrder;
    [FieldOffset(0x29)] public bool Unknown0;
}
