// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct Behavior {
    [FieldOffset(0x00)] public uint ContentArgument0;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public int Unknown1;
    [FieldOffset(0x0C)] public int Unknown2;
    [FieldOffset(0x10)] public ushort Unknown3;
    /// <remarks>Balloon</remarks>
    [FieldOffset(0x12)] public ushort Balloon;
    [FieldOffset(0x14)] public ushort Unknown4;
    [FieldOffset(0x16)] public short Unknown5;
    [FieldOffset(0x18)] public byte Unknown6;
    [FieldOffset(0x19)] public byte Unknown7;
    [FieldOffset(0x1A)] public byte Condition0Target;
    [FieldOffset(0x1B)] public byte Condition0Type;
    [FieldOffset(0x1C)] public byte Condition1Target;
    [FieldOffset(0x1D)] public byte Condition1Type;
    [FieldOffset(0x1E)] public byte ContentArgument1;
    [FieldOffset(0x1F)] public byte Unknown8;
    [FieldOffset(0x20)] public byte Unknown9;
}
