// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x58)]
public unsafe partial struct BenchmarkOverrideEquipment {
    [FieldOffset(0x00)] public ulong ModelMainHand;
    [FieldOffset(0x08)] public ulong ModelOffHand;
    [FieldOffset(0x10)] public ulong Unknown0;
    [FieldOffset(0x18)] public uint Unknown1;
    [FieldOffset(0x1C)] public uint Unknown2;
    [FieldOffset(0x20)] public uint ModelHead;
    [FieldOffset(0x24)] public uint ModelBody;
    [FieldOffset(0x28)] public uint ModelHands;
    [FieldOffset(0x2C)] public uint ModelLegs;
    [FieldOffset(0x30)] public uint ModelFeet;
    [FieldOffset(0x34)] public uint ModelEars;
    [FieldOffset(0x38)] public uint ModelNeck;
    [FieldOffset(0x3C)] public uint ModelWrists;
    [FieldOffset(0x40)] public uint ModelLeftRing;
    [FieldOffset(0x44)] public uint ModelRightRing;
    [FieldOffset(0x48)] public byte Unknown3;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x49)] public byte DyeMainHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4A)] public byte DyeOffHand;
    [FieldOffset(0x4B)] public byte Unknown4;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4C)] public byte DyeHead;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4D)] public byte DyeBody;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4E)] public byte DyeHands;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4F)] public byte DyeLegs;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x50)] public byte DyeFeet;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x51)] public byte DyeEars;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x52)] public byte DyeNeck;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x53)] public byte DyeWrists;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x54)] public byte DyeLeftRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x55)] public byte DyeRightRing;
    [FieldOffset(0x56)] public sbyte Unknown5;
}
