// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct BNpcCustomize {
    /// <remarks>Race</remarks>
    [FieldOffset(0x00)] public byte Race;
    [FieldOffset(0x01)] public byte Gender;
    [FieldOffset(0x02)] public byte BodyType;
    [FieldOffset(0x03)] public byte Height;
    /// <remarks>Tribe</remarks>
    [FieldOffset(0x04)] public byte Tribe;
    [FieldOffset(0x05)] public byte Face;
    [FieldOffset(0x06)] public byte HairStyle;
    [FieldOffset(0x07)] public byte HairHighlight;
    [FieldOffset(0x08)] public byte SkinColor;
    [FieldOffset(0x09)] public byte EyeHeterochromia;
    [FieldOffset(0x0A)] public byte HairColor;
    [FieldOffset(0x0B)] public byte HairHighlightColor;
    [FieldOffset(0x0C)] public byte FacialFeature;
    [FieldOffset(0x0D)] public byte FacialFeatureColor;
    [FieldOffset(0x0E)] public byte Eyebrows;
    [FieldOffset(0x0F)] public byte EyeColor;
    [FieldOffset(0x10)] public byte EyeShape;
    [FieldOffset(0x11)] public byte Nose;
    [FieldOffset(0x12)] public byte Jaw;
    [FieldOffset(0x13)] public byte Mouth;
    [FieldOffset(0x14)] public byte LipColor;
    [FieldOffset(0x15)] public byte BustOrTone1;
    [FieldOffset(0x16)] public byte ExtraFeature1;
    [FieldOffset(0x17)] public byte ExtraFeature2OrBust;
    [FieldOffset(0x18)] public byte FacePaint;
    [FieldOffset(0x19)] public byte FacePaintColor;
}
