// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x98)]
public unsafe partial struct BNpcParts {
    [FieldOffset(0x00)] public float X1;
    [FieldOffset(0x04)] public float X2;
    [FieldOffset(0x08)] public float X3;
    [FieldOffset(0x0C)] public float X4;
    [FieldOffset(0x10)] public float X5;
    [FieldOffset(0x14)] public float Unknown0;
    [FieldOffset(0x18)] public float Y1;
    [FieldOffset(0x1C)] public float Y2;
    [FieldOffset(0x20)] public float Y3;
    [FieldOffset(0x24)] public float Y4;
    [FieldOffset(0x28)] public float Y5;
    [FieldOffset(0x2C)] public float Unknown1;
    [FieldOffset(0x30)] public float Z1;
    [FieldOffset(0x34)] public float Z2;
    [FieldOffset(0x38)] public float Z3;
    [FieldOffset(0x3C)] public float Z4;
    [FieldOffset(0x40)] public float Z5;
    [FieldOffset(0x44)] public float Unknown2;
    [FieldOffset(0x48)] public float Scale1;
    [FieldOffset(0x4C)] public float Scale2;
    [FieldOffset(0x50)] public float Unknown3;
    [FieldOffset(0x54)] public float Scale4;
    [FieldOffset(0x58)] public float Scale5;
    [FieldOffset(0x5C)] public float Unknown4;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x60)] public ushort BNpcBase1;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x62)] public ushort BNpcBase2;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x64)] public ushort BNpcBase3;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x66)] public ushort BNpcBase4;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x68)] public ushort BNpcBase5;
    [FieldOffset(0x6A)] public ushort Unknown5;
    [FieldOffset(0x6C)] public short Unknown6;
    [FieldOffset(0x6E)] public short Unknown7;
    [FieldOffset(0x70)] public short Scale3;
    [FieldOffset(0x72)] public short Unknown8;
    [FieldOffset(0x74)] public short Unknown9;
    [FieldOffset(0x76)] public short Unknown10;
    [FieldOffset(0x78)] public byte PartSlot1;
    [FieldOffset(0x79)] public byte PartSlot2;
    [FieldOffset(0x7A)] public byte PartSlot3;
    [FieldOffset(0x7B)] public byte PartSlot4;
    [FieldOffset(0x7C)] public byte PartSlot5;
    [FieldOffset(0x7D)] public byte Unknown11;
    [FieldOffset(0x7E)] public bool Unknown12;
    [FieldOffset(0x7F)] public bool Unknown13;
    [FieldOffset(0x80)] public bool Unknown14;
    [FieldOffset(0x81)] public bool Unknown15;
    [FieldOffset(0x82)] public bool Unknown16;
    [FieldOffset(0x83)] public bool Unknown17;
    [FieldOffset(0x84)] public bool Unknown18;
    [FieldOffset(0x85)] public bool Unknown19;
    [FieldOffset(0x86)] public bool Unknown20;
    [FieldOffset(0x87)] public bool Unknown21;
    [FieldOffset(0x88)] public bool Unknown22;
    [FieldOffset(0x89)] public bool Unknown23;
    [FieldOffset(0x8A)] public bool Unknown24;
    [FieldOffset(0x8B)] public bool Unknown25;
    [FieldOffset(0x8C)] public bool Unknown26;
    [FieldOffset(0x8D)] public bool Unknown27;
    [FieldOffset(0x8E)] public bool Unknown28;
    [FieldOffset(0x8F)] public bool Unknown29;
    [FieldOffset(0x90)] public bool Unknown30;
    [FieldOffset(0x91)] public bool Unknown31;
    [FieldOffset(0x92)] public bool Unknown32;
    [FieldOffset(0x93)] public bool Unknown33;
    [FieldOffset(0x94)] public bool Unknown34;
    [FieldOffset(0x95)] public bool Unknown35;
}
