// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct BNpcBase {
    [FieldOffset(0x00)] public float Scale;
    /// <remarks>ArrayEventHandler</remarks>
    [FieldOffset(0x04)] public int ArrayEventHandler;
    /// <remarks>Behavior</remarks>
    [FieldOffset(0x08)] public ushort Behavior;
    /// <remarks>ModelChara</remarks>
    [FieldOffset(0x0A)] public ushort ModelChara;
    /// <remarks>BNpcCustomize</remarks>
    [FieldOffset(0x0C)] public ushort BNpcCustomize;
    /// <remarks>NpcEquip</remarks>
    [FieldOffset(0x0E)] public ushort NpcEquip;
    [FieldOffset(0x10)] public ushort Special;
    /// <remarks>Battalion</remarks>
    [FieldOffset(0x12)] public byte Battalion;
    /// <remarks>LinkRace</remarks>
    [FieldOffset(0x13)] public byte LinkRace;
    [FieldOffset(0x14)] public byte Rank;
    [FieldOffset(0x15)] public byte SEPack;
    [FieldOffset(0x16)] public byte Unknown0;
    /// <remarks>BNpcParts</remarks>
    [FieldOffset(0x17)] public byte BNpcParts;
    [FieldOffset(0x18)] public byte Unknown1;
    [FieldOffset(0x19)] public byte Unknown2;
    [FieldOffset(0x1A)] public byte Unknown3;
    [FieldOffset(0x1B)] public byte Unknown4;
    [FieldOffset(0x1C)] public BitField1CFlags BitField1C;
    public bool IsOmnidirectional => BitField1C.HasFlag(BitField1CFlags.IsOmnidirectional);
    public bool Unknown6 => BitField1C.HasFlag(BitField1CFlags.Unknown6);
    public bool IsTargetLine => BitField1C.HasFlag(BitField1CFlags.IsTargetLine);
    public bool IsDisplayLevel => BitField1C.HasFlag(BitField1CFlags.IsDisplayLevel);
    public bool Unknown7 => BitField1C.HasFlag(BitField1CFlags.Unknown7);
    public bool Unknown_70 => BitField1C.HasFlag(BitField1CFlags.Unknown_70);

    [Flags]
    public enum BitField1CFlags : byte {
    	IsOmnidirectional = 1 << 0,
    	Unknown6 = 1 << 1,
    	IsTargetLine = 1 << 2,
    	IsDisplayLevel = 1 << 3,
    	Unknown7 = 1 << 4,
    	Unknown_70 = 1 << 5,
    }
}
