// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct BNpcState {
    [FieldOffset(0x00)] public float Scale;
    [FieldOffset(0x04)] public int LoopTimeline;
    [FieldOffset(0x08)] public ushort Idle;
    [FieldOffset(0x0A)] public byte Slot;
    [FieldOffset(0x0B)] public byte Unknown0;
    [FieldOffset(0x0C)] public byte Attribute0;
    [FieldOffset(0x0D)] public byte Attribute1;
    [FieldOffset(0x0E)] public byte Attribute2;
    [FieldOffset(0x0F)] public byte Unknown1;
    [FieldOffset(0x10)] public sbyte OverRay;
    [FieldOffset(0x11)] public sbyte Unknown2;
    [FieldOffset(0x12)] public bool AttributeFlag0;
    [FieldOffset(0x13)] public bool AttributeFlag1;
    [FieldOffset(0x14)] public bool AttributeFlag2;
    [FieldOffset(0x15)] public bool Unknown3;
}
