// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct BuddyEquip {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int Name_Offset;
    [FieldOffset(0x0C)] public sbyte Adjective;
    [FieldOffset(0x0D)] public sbyte PossessivePronoun;
    [FieldOffset(0x0E)] public sbyte StartsWithVowel;
    [FieldOffset(0x0F)] public sbyte Unknown0;
    [FieldOffset(0x10)] public sbyte Pronoun;
    [FieldOffset(0x11)] public sbyte Article;
    [FieldOffset(0x14)] public int ModelTop;
    [FieldOffset(0x18)] public int ModelBody;
    [FieldOffset(0x1C)] public int ModelLegs;
    [FieldOffset(0x20)] public ushort IconHead;
    [FieldOffset(0x22)] public ushort IconBody;
    [FieldOffset(0x24)] public ushort IconLegs;
    /// <remarks>GrandCompany</remarks>
    [FieldOffset(0x26)] public byte GrandCompany;
    [FieldOffset(0x27)] public byte Order;
}
