// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct CharaCardHeader {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int TopImage;
    [FieldOffset(0x08)] public int BottomImage;
    /// <remarks>BannerCondition</remarks>
    [FieldOffset(0x0C)] public ushort UnlockCondition;
    [FieldOffset(0x0E)] public ushort Unknown_70_1;
    [FieldOffset(0x10)] public ushort Unknown_70_2;
    [FieldOffset(0x12)] public byte FontColor;
    [FieldOffset(0x13)] public byte Unknown0;
    [FieldOffset(0x14)] public byte Unknown1;
    [FieldOffset(0x15)] public byte Unknown2;
    [FieldOffset(0x16)] public byte Unknown3;
    [FieldOffset(0x17)] public byte SortKey;
}
