// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct CharaCardDecoration {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Image;
    /// <remarks>BannerCondition</remarks>
    [FieldOffset(0x08)] public ushort UnlockCondition;
    [FieldOffset(0x0A)] public ushort Unknown_70_1;
    [FieldOffset(0x0C)] public ushort Unknown_70_2;
    [FieldOffset(0x0E)] public ushort SortKey;
    [FieldOffset(0x10)] public byte Category;
    [FieldOffset(0x11)] public byte Subtype;
    [FieldOffset(0x12)] public byte Unknown1;
    [FieldOffset(0x13)] public byte Unknown2;
}
