// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct CharaCardDesignPreset {
    [FieldOffset(0x00)] public int Name_Offset;
    /// <remarks>CharaCardBase</remarks>
    [FieldOffset(0x04)] public ushort BasePlate;
    /// <remarks>CharaCardDecoration</remarks>
    [FieldOffset(0x06)] public ushort Backing;
    /// <remarks>CharaCardDecoration</remarks>
    [FieldOffset(0x08)] public ushort PatternOverlay;
    /// <remarks>CharaCardDecoration</remarks>
    [FieldOffset(0x0A)] public ushort PortraitFrame;
    /// <remarks>CharaCardDecoration</remarks>
    [FieldOffset(0x0C)] public ushort PlateFrame;
    /// <remarks>CharaCardDecoration</remarks>
    [FieldOffset(0x0E)] public ushort Accent;
    [FieldOffset(0x10)] public ushort SortKey;
    /// <remarks>CharaCardHeader</remarks>
    [FieldOffset(0x12)] public byte TopBorder;
    /// <remarks>CharaCardHeader</remarks>
    [FieldOffset(0x13)] public byte BottomBorder;
}
