// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0xC8)]
public unsafe partial struct CharaMakeName {
    [FieldOffset(0x00)] public int HyurMidlanderMale_Offset;
    [FieldOffset(0x04)] public int HyurMidlanderFemale_Offset;
    [FieldOffset(0x08)] public int HyurMidlanderLastName_Offset;
    [FieldOffset(0x0C)] public int HyurHighlanderMale_Offset;
    [FieldOffset(0x10)] public int HyurHighlanderFemale_Offset;
    [FieldOffset(0x14)] public int HyurHighlanderLastName_Offset;
    [FieldOffset(0x18)] public int ElezenMale_Offset;
    [FieldOffset(0x1C)] public int ElezenFemale_Offset;
    [FieldOffset(0x20)] public int ElezenWildwoodLastName_Offset;
    [FieldOffset(0x24)] public int ElezenDuskwightLastName_Offset;
    [FieldOffset(0x28)] public int MiqoteSunMale_Offset;
    [FieldOffset(0x2C)] public int MiqoteSunFemale_Offset;
    [FieldOffset(0x30)] public int MiqoteSunMaleLastName_Offset;
    [FieldOffset(0x34)] public int MiqoteSunFemaleLastName_Offset;
    [FieldOffset(0x38)] public int MiqoteMoonMale_Offset;
    [FieldOffset(0x3C)] public int MiqoteMoonFemale_Offset;
    [FieldOffset(0x40)] public int MiqoteMoonLastname_Offset;
    [FieldOffset(0x44)] public int LalafellPlainsfolkFirstNameStart_Offset;
    [FieldOffset(0x48)] public int LalafellPlainsfolkLastNameStart_Offset;
    [FieldOffset(0x4C)] public int LalafellPlainsfolkEndOfNames_Offset;
    [FieldOffset(0x50)] public int LalafellDunesfolkMale_Offset;
    [FieldOffset(0x54)] public int LalafellDunesfolkMaleLastName_Offset;
    [FieldOffset(0x58)] public int LalafellDunesfolkFemale_Offset;
    [FieldOffset(0x5C)] public int LalafellDunesfolkFemaleLastName_Offset;
    [FieldOffset(0x60)] public int RoegadynSeaWolfMale_Offset;
    [FieldOffset(0x64)] public int RoegadynSeaWolfMaleLastName_Offset;
    [FieldOffset(0x68)] public int RoegadynSeaWolfFemale_Offset;
    [FieldOffset(0x6C)] public int RoegadynSeaWolfFemaleLastName_Offset;
    [FieldOffset(0x70)] public int RoegadynHellsguardFirstName_Offset;
    [FieldOffset(0x74)] public int RoegadynHellsguardMaleLastName_Offset;
    [FieldOffset(0x78)] public int RoegadynHellsguardFemaleLastName_Offset;
    [FieldOffset(0x7C)] public int AuRaRaenMale_Offset;
    [FieldOffset(0x80)] public int AuRaRaenFemale_Offset;
    [FieldOffset(0x84)] public int AuRaRaenLastName_Offset;
    [FieldOffset(0x88)] public int AuRaXaelaMale_Offset;
    [FieldOffset(0x8C)] public int AuRaXaelaFemale_Offset;
    [FieldOffset(0x90)] public int AuRaXaelaLastName_Offset;
    [FieldOffset(0x94)] public int HrothgarHellionsFirstName_Offset;
    [FieldOffset(0x98)] public int HrothgarHellionsLastName_Offset;
    [FieldOffset(0x9C)] public int HrothgarLostFirstName_Offset;
    [FieldOffset(0xA0)] public int HrothgarLostLastName_Offset;
    [FieldOffset(0xA4)] public int Unknown0_Offset;
    [FieldOffset(0xA8)] public int Unknown1_Offset;
    [FieldOffset(0xAC)] public int Unknown2_Offset;
    [FieldOffset(0xB0)] public int VieraFirstName_Offset;
    [FieldOffset(0xB4)] public int VieraRavaLastName_Offset;
    [FieldOffset(0xB8)] public int VieraVeenaLastName_Offset;
    [FieldOffset(0xBC)] public int Unknown_70_1_Offset;
    [FieldOffset(0xC0)] public int Unknown_70_2_Offset;
    [FieldOffset(0xC4)] public int Unknown_70_3_Offset;
}
