// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x6C)]
public unsafe partial struct ClassJob {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Abbreviation_Offset;
    [FieldOffset(0x08)] public int Unknown0_Offset;
    [FieldOffset(0x0C)] public bool CanQueueForDuty;
    [FieldOffset(0x10)] public int NameEnglish_Offset;
    /// <remarks>Item</remarks>
    [FieldOffset(0x14)] public uint ItemSoulCrystal;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x18)] public uint UnlockQuest;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x1C)] public uint RelicQuest;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x20)] public uint Prerequisite;
    [FieldOffset(0x24)] public int Unknown_70_1;
    [FieldOffset(0x28)] public int Unknown_70_2;
    /// <remarks>Item</remarks>
    [FieldOffset(0x2C)] public int ItemStartingWeapon;
    [FieldOffset(0x30)] public int Unknown1;
    [FieldOffset(0x34)] public ushort ModifierHitPoints;
    [FieldOffset(0x36)] public ushort ModifierManaPoints;
    [FieldOffset(0x38)] public ushort ModifierStrength;
    [FieldOffset(0x3A)] public ushort ModifierVitality;
    [FieldOffset(0x3C)] public ushort ModifierDexterity;
    [FieldOffset(0x3E)] public ushort ModifierIntelligence;
    [FieldOffset(0x40)] public ushort ModifierMind;
    [FieldOffset(0x42)] public ushort ModifierPiety;
    [FieldOffset(0x44)] public ushort Unknown2;
    [FieldOffset(0x46)] public ushort Unknown3;
    [FieldOffset(0x48)] public ushort Unknown4;
    [FieldOffset(0x4A)] public ushort Unknown5;
    [FieldOffset(0x4C)] public ushort Unknown6;
    [FieldOffset(0x4E)] public ushort Unknown7;
    /// <remarks>Action</remarks>
    [FieldOffset(0x50)] public ushort LimitBreak1;
    /// <remarks>Action</remarks>
    [FieldOffset(0x52)] public ushort LimitBreak2;
    /// <remarks>Action</remarks>
    [FieldOffset(0x54)] public ushort LimitBreak3;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x56)] public byte ClassJobCategory;
    [FieldOffset(0x57)] public byte Unknown8;
    [FieldOffset(0x58)] public byte JobIndex;
    [FieldOffset(0x59)] public byte Unknown9;
    [FieldOffset(0x5A)] public byte PvPActionSortRow;
    [FieldOffset(0x5B)] public byte Unknown10;
    /// <remarks>ClassJob</remarks>
    [FieldOffset(0x5C)] public byte ClassJobParent;
    [FieldOffset(0x5D)] public byte Role;
    /// <remarks>Town</remarks>
    [FieldOffset(0x5E)] public byte StartingTown;
    [FieldOffset(0x5F)] public byte PrimaryStat;
    [FieldOffset(0x60)] public byte UIPriority;
    [FieldOffset(0x61)] public byte StartingLevel;
    [FieldOffset(0x62)] public byte PartyBonus;
    [FieldOffset(0x63)] public byte Unknown11;
    [FieldOffset(0x64)] public sbyte ExpArrayIndex;
    [FieldOffset(0x65)] public sbyte BattleClassIndex;
    [FieldOffset(0x66)] public sbyte DohDolJobIndex;
    /// <remarks>MonsterNote</remarks>
    [FieldOffset(0x67)] public sbyte MonsterNote;
    [FieldOffset(0x68)] public bool IsLimitedJob;
}
