// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct ClassJobCategory {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public bool ADV;
    [FieldOffset(0x05)] public bool GLA;
    [FieldOffset(0x06)] public bool PGL;
    [FieldOffset(0x07)] public bool MRD;
    [FieldOffset(0x08)] public bool LNC;
    [FieldOffset(0x09)] public bool ARC;
    [FieldOffset(0x0A)] public bool CNJ;
    [FieldOffset(0x0B)] public bool THM;
    [FieldOffset(0x0C)] public bool CRP;
    [FieldOffset(0x0D)] public bool BSM;
    [FieldOffset(0x0E)] public bool ARM;
    [FieldOffset(0x0F)] public bool GSM;
    [FieldOffset(0x10)] public bool LTW;
    [FieldOffset(0x11)] public bool WVR;
    [FieldOffset(0x12)] public bool ALC;
    [FieldOffset(0x13)] public bool CUL;
    [FieldOffset(0x14)] public bool MIN;
    [FieldOffset(0x15)] public bool BTN;
    [FieldOffset(0x16)] public bool FSH;
    [FieldOffset(0x17)] public bool PLD;
    [FieldOffset(0x18)] public bool MNK;
    [FieldOffset(0x19)] public bool WAR;
    [FieldOffset(0x1A)] public bool DRG;
    [FieldOffset(0x1B)] public bool BRD;
    [FieldOffset(0x1C)] public bool WHM;
    [FieldOffset(0x1D)] public bool BLM;
    [FieldOffset(0x1E)] public bool ACN;
    [FieldOffset(0x1F)] public bool SMN;
    [FieldOffset(0x20)] public bool SCH;
    [FieldOffset(0x21)] public bool ROG;
    [FieldOffset(0x22)] public bool NIN;
    [FieldOffset(0x23)] public bool MCH;
    [FieldOffset(0x24)] public bool DRK;
    [FieldOffset(0x25)] public bool AST;
    [FieldOffset(0x26)] public bool SAM;
    [FieldOffset(0x27)] public bool RDM;
    [FieldOffset(0x28)] public bool BLU;
    [FieldOffset(0x29)] public bool GNB;
    [FieldOffset(0x2A)] public bool DNC;
    [FieldOffset(0x2B)] public bool RPR;
    [FieldOffset(0x2C)] public bool SGE;
    [FieldOffset(0x2D)] public bool Unknown1;
    [FieldOffset(0x2E)] public bool Unknown2;
}
