// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct CollectablesShopItem {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint Item;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x04)] public uint RequiredQuest;
    [FieldOffset(0x08)] public ushort LevelMin;
    [FieldOffset(0x0A)] public ushort LevelMax;
    /// <remarks>CollectablesShopRefine</remarks>
    [FieldOffset(0x0C)] public ushort CollectablesShopRefine;
    /// <remarks>CollectablesShopRewardScrip</remarks>
    [FieldOffset(0x0E)] public ushort CollectablesShopRewardScrip;
    /// <remarks>CollectablesShopItemGroup</remarks>
    [FieldOffset(0x10)] public byte CollectablesShopItemGroup;
    [FieldOffset(0x11)] public byte Stars;
    [FieldOffset(0x12)] public byte Key;
}
