// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct CollectablesShopRewardItem {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint Item;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public byte RewardLow;
    [FieldOffset(0x09)] public byte RewardMid;
    [FieldOffset(0x0A)] public byte RewardHigh;
    [FieldOffset(0x0B)] public byte Unknown1;
    [FieldOffset(0x0C)] public byte Unknown2;
    [FieldOffset(0x0D)] public byte Unknown3;
    [FieldOffset(0x0E)] public BitField0EFlags BitField0E;
    public bool Unknown4 => BitField0E.HasFlag(BitField0EFlags.Unknown4);
    public bool Unknown5 => BitField0E.HasFlag(BitField0EFlags.Unknown5);

    [Flags]
    public enum BitField0EFlags : byte {
    	Unknown4 = 1 << 0,
    	Unknown5 = 1 << 1,
    }
}
