// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x3C)]
public unsafe partial struct ColorFilter {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public float Unknown1;
    [FieldOffset(0x08)] public float Unknown2;
    [FieldOffset(0x0C)] public float Unknown3;
    [FieldOffset(0x10)] public float Unknown4;
    [FieldOffset(0x14)] public float Unknown5;
    [FieldOffset(0x18)] public float Unknown6;
    [FieldOffset(0x1C)] public float Unknown7;
    [FieldOffset(0x20)] public float Unknown8;
    [FieldOffset(0x24)] public float Unknown9;
    [FieldOffset(0x28)] public float Unknown10;
    [FieldOffset(0x2C)] public float Unknown11;
    [FieldOffset(0x30)] public float Unknown12;
    [FieldOffset(0x34)] public float Unknown13;
    [FieldOffset(0x38)] public byte Unknown14;
    [FieldOffset(0x39)] public bool Unknown15;
}
