// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x1A0)]
public unsafe partial struct CompanyLeve {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray8<ushort> _routePointTime;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray8<CompanyLeveStructStruct> _companyLeveStruct;
    [FieldOffset(0x190), FixedSizeArray] internal FixedSizeArray8<byte> _toDoSequence;
    /// <remarks>CompanyLeveRule</remarks>
    [FieldOffset(0x198)] public int Rule;
    [FieldOffset(0x19C)] public byte RuleParam;

    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public partial struct CompanyLeveStructStruct {
        /// <remarks>BNpcName</remarks>
        [FieldOffset(0x00)] public uint BNpcName;
        [FieldOffset(0x04), FixedSizeArray] internal FixedSizeArray6<uint> _toDoParam;
        /// <remarks>EventItem, BNpcBase</remarks>
        [FieldOffset(0x1C)] public int BaseID;
        /// <remarks>EventItem</remarks>
        [FieldOffset(0x20)] public int ItemsInvolved;
        [FieldOffset(0x24)] public ushort EnemyLevel;
        [FieldOffset(0x26)] public byte ItemsInvolvedQty;
        [FieldOffset(0x27)] public byte ItemDropRate;
        [FieldOffset(0x28), FixedSizeArray] internal FixedSizeArray8<byte> _numOfAppearance;
    }
}
