// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct ContentCloseCycle {
    [FieldOffset(0x00)] public uint Unixtime;
    [FieldOffset(0x04)] public uint TimeSeconds;
    [FieldOffset(0x08)] public uint Unknown0;
    [FieldOffset(0x0C)] public bool Unknown1;
    [FieldOffset(0x0D)] public bool Unknown2;
    [FieldOffset(0x0E)] public bool Unknown3;
    [FieldOffset(0x0F)] public bool Unknown4;
    [FieldOffset(0x10)] public bool Unknown5;
    [FieldOffset(0x11)] public bool Unknown6;
    [FieldOffset(0x12)] public bool Unknown7;
    [FieldOffset(0x13)] public bool Unknown8;
    [FieldOffset(0x14)] public bool Unknown9;
    [FieldOffset(0x15)] public bool Unknown10;
}
