// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x180)]
public unsafe partial struct ContentAttributeRect {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public byte Unknown2;
    [FieldOffset(0x09)] public byte Unknown3;
    [FieldOffset(0x0C)] public uint Unknown4;
    [FieldOffset(0x10)] public uint Unknown5;
    [FieldOffset(0x14)] public byte Unknown6;
    [FieldOffset(0x15)] public byte Unknown7;
    [FieldOffset(0x18)] public uint Unknown8;
    [FieldOffset(0x1C)] public uint Unknown9;
    [FieldOffset(0x20)] public byte Unknown10;
    [FieldOffset(0x21)] public byte Unknown11;
    [FieldOffset(0x24)] public uint Unknown12;
    [FieldOffset(0x28)] public uint Unknown13;
    [FieldOffset(0x2C)] public byte Unknown14;
    [FieldOffset(0x2D)] public byte Unknown15;
    [FieldOffset(0x30)] public uint Unknown16;
    [FieldOffset(0x34)] public uint Unknown17;
    [FieldOffset(0x38)] public byte Unknown18;
    [FieldOffset(0x39)] public byte Unknown19;
    [FieldOffset(0x3C)] public uint Unknown20;
    [FieldOffset(0x40)] public uint Unknown21;
    [FieldOffset(0x44)] public byte Unknown22;
    [FieldOffset(0x45)] public byte Unknown23;
    [FieldOffset(0x48)] public uint Unknown24;
    [FieldOffset(0x4C)] public uint Unknown25;
    [FieldOffset(0x50)] public byte Unknown26;
    [FieldOffset(0x51)] public byte Unknown27;
    [FieldOffset(0x54)] public uint Unknown28;
    [FieldOffset(0x58)] public uint Unknown29;
    [FieldOffset(0x5C)] public byte Unknown30;
    [FieldOffset(0x5D)] public byte Unknown31;
    [FieldOffset(0x60)] public uint Unknown32;
    [FieldOffset(0x64)] public uint Unknown33;
    [FieldOffset(0x68)] public byte Unknown34;
    [FieldOffset(0x69)] public byte Unknown35;
    [FieldOffset(0x6C)] public uint Unknown36;
    [FieldOffset(0x70)] public uint Unknown37;
    [FieldOffset(0x74)] public byte Unknown38;
    [FieldOffset(0x75)] public byte Unknown39;
    [FieldOffset(0x78)] public uint Unknown40;
    [FieldOffset(0x7C)] public uint Unknown41;
    [FieldOffset(0x80)] public byte Unknown42;
    [FieldOffset(0x81)] public byte Unknown43;
    [FieldOffset(0x84)] public uint Unknown44;
    [FieldOffset(0x88)] public uint Unknown45;
    [FieldOffset(0x8C)] public byte Unknown46;
    [FieldOffset(0x8D)] public byte Unknown47;
    [FieldOffset(0x90)] public uint Unknown48;
    [FieldOffset(0x94)] public uint Unknown49;
    [FieldOffset(0x98)] public byte Unknown50;
    [FieldOffset(0x99)] public byte Unknown51;
    [FieldOffset(0x9C)] public uint Unknown52;
    [FieldOffset(0xA0)] public uint Unknown53;
    [FieldOffset(0xA4)] public byte Unknown54;
    [FieldOffset(0xA5)] public byte Unknown55;
    [FieldOffset(0xA8)] public uint Unknown56;
    [FieldOffset(0xAC)] public uint Unknown57;
    [FieldOffset(0xB0)] public byte Unknown58;
    [FieldOffset(0xB1)] public byte Unknown59;
    [FieldOffset(0xB4)] public uint Unknown60;
    [FieldOffset(0xB8)] public uint Unknown61;
    [FieldOffset(0xBC)] public byte Unknown62;
    [FieldOffset(0xBD)] public byte Unknown63;
    [FieldOffset(0xC0)] public uint Unknown64;
    [FieldOffset(0xC4)] public uint Unknown65;
    [FieldOffset(0xC8)] public byte Unknown66;
    [FieldOffset(0xC9)] public byte Unknown67;
    [FieldOffset(0xCC)] public uint Unknown68;
    [FieldOffset(0xD0)] public uint Unknown69;
    [FieldOffset(0xD4)] public byte Unknown70;
    [FieldOffset(0xD5)] public byte Unknown71;
    [FieldOffset(0xD8)] public uint Unknown72;
    [FieldOffset(0xDC)] public uint Unknown73;
    [FieldOffset(0xE0)] public byte Unknown74;
    [FieldOffset(0xE1)] public byte Unknown75;
    [FieldOffset(0xE4)] public uint Unknown76;
    [FieldOffset(0xE8)] public uint Unknown77;
    [FieldOffset(0xEC)] public byte Unknown78;
    [FieldOffset(0xED)] public byte Unknown79;
    [FieldOffset(0xF0)] public uint Unknown80;
    [FieldOffset(0xF4)] public uint Unknown81;
    [FieldOffset(0xF8)] public byte Unknown82;
    [FieldOffset(0xF9)] public byte Unknown83;
    [FieldOffset(0xFC)] public uint Unknown84;
    [FieldOffset(0x100)] public uint Unknown85;
    [FieldOffset(0x104)] public byte Unknown86;
    [FieldOffset(0x105)] public byte Unknown87;
    [FieldOffset(0x108)] public uint Unknown88;
    [FieldOffset(0x10C)] public uint Unknown89;
    [FieldOffset(0x110)] public byte Unknown90;
    [FieldOffset(0x111)] public byte Unknown91;
    [FieldOffset(0x114)] public uint Unknown92;
    [FieldOffset(0x118)] public uint Unknown93;
    [FieldOffset(0x11C)] public byte Unknown94;
    [FieldOffset(0x11D)] public byte Unknown95;
    [FieldOffset(0x120)] public uint Unknown96;
    [FieldOffset(0x124)] public uint Unknown97;
    [FieldOffset(0x128)] public byte Unknown98;
    [FieldOffset(0x129)] public byte Unknown99;
    [FieldOffset(0x12C)] public uint Unknown100;
    [FieldOffset(0x130)] public uint Unknown101;
    [FieldOffset(0x134)] public byte Unknown102;
    [FieldOffset(0x135)] public byte Unknown103;
    [FieldOffset(0x138)] public uint Unknown104;
    [FieldOffset(0x13C)] public uint Unknown105;
    [FieldOffset(0x140)] public byte Unknown106;
    [FieldOffset(0x141)] public byte Unknown107;
    [FieldOffset(0x144)] public uint Unknown108;
    [FieldOffset(0x148)] public uint Unknown109;
    [FieldOffset(0x14C)] public byte Unknown110;
    [FieldOffset(0x14D)] public byte Unknown111;
    [FieldOffset(0x150)] public uint Unknown112;
    [FieldOffset(0x154)] public uint Unknown113;
    [FieldOffset(0x158)] public byte Unknown114;
    [FieldOffset(0x159)] public byte Unknown115;
    [FieldOffset(0x15C)] public uint Unknown116;
    [FieldOffset(0x160)] public uint Unknown117;
    [FieldOffset(0x164)] public byte Unknown118;
    [FieldOffset(0x165)] public byte Unknown119;
    [FieldOffset(0x168)] public uint Unknown120;
    [FieldOffset(0x16C)] public uint Unknown121;
    [FieldOffset(0x170)] public byte Unknown122;
    [FieldOffset(0x171)] public byte Unknown123;
    [FieldOffset(0x174)] public uint Unknown124;
    [FieldOffset(0x178)] public uint Unknown125;
    [FieldOffset(0x17C)] public byte Unknown126;
    [FieldOffset(0x17D)] public byte Unknown127;
}
