// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct ContentGauge {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int TextString_Offset;
    [FieldOffset(0x08)] public short Unknown0;
    [FieldOffset(0x0A)] public short Unknown1;
    [FieldOffset(0x0C)] public short Unknown2;
    [FieldOffset(0x0E)] public byte Unknown3;
    /// <remarks>ContentGaugeColor</remarks>
    [FieldOffset(0x0F)] public byte Color;
    [FieldOffset(0x10)] public byte Unknown4;
    [FieldOffset(0x11)] public byte Unknown5;
    [FieldOffset(0x12)] public sbyte Unknown6;
    [FieldOffset(0x13)] public sbyte Unknown7;
    [FieldOffset(0x14)] public bool Unknown8;
}
