// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct ContentRouletteRoleBonus {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint ItemRewardType;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public ushort Unknown1;
    [FieldOffset(0x0A)] public ushort Unknown2;
    [FieldOffset(0x0C)] public ushort Unknown3;
    [FieldOffset(0x0E)] public ushort Unknown4;
    [FieldOffset(0x10)] public ushort Unknown5;
    [FieldOffset(0x12)] public ushort Unknown6;
    [FieldOffset(0x14)] public byte RewardAmount;
    [FieldOffset(0x15)] public byte Unknown7;
    [FieldOffset(0x16)] public byte Unknown8;
    [FieldOffset(0x17)] public byte Unknown9;
}
