// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct ContentsNote {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x08)] public uint ReqUnlock;
    [FieldOffset(0x0C)] public int Icon;
    [FieldOffset(0x10)] public int RequiredAmount;
    [FieldOffset(0x14)] public int ExpMultiplier;
    [FieldOffset(0x18)] public int GilRward;
    [FieldOffset(0x1C)] public int ExpCap;
    [FieldOffset(0x20)] public ushort LevelUnlock;
    /// <remarks>HowTo</remarks>
    [FieldOffset(0x22)] public ushort HowTo;
    /// <remarks>ContentsNoteCategory</remarks>
    [FieldOffset(0x24)] public byte ContentType;
    [FieldOffset(0x25)] public byte MenuOrder;
    [FieldOffset(0x26)] public byte Reward0;
    [FieldOffset(0x27)] public byte Reward1;
}
