// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x3C)]
public unsafe partial struct CraftAction {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x08)] public uint QuestRequirement;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x0C)] public int CRP;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x10)] public int BSM;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x14)] public int ARM;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x18)] public int GSM;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x1C)] public int LTW;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x20)] public int WVR;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x24)] public int ALC;
    /// <remarks>CraftAction</remarks>
    [FieldOffset(0x28)] public int CUL;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x2C)] public ushort AnimationStart;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x2E)] public ushort AnimationEnd;
    [FieldOffset(0x30)] public ushort Icon;
    [FieldOffset(0x32)] public ushort Unknown0;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x34)] public byte ClassJobCategory;
    [FieldOffset(0x35)] public byte ClassJobLevel;
    [FieldOffset(0x36)] public byte Cost;
    /// <remarks>ClassJob</remarks>
    [FieldOffset(0x37)] public sbyte ClassJob;
    [FieldOffset(0x38)] public bool Specialist;
}
