// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct Credit {
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x00)] public ushort Roles1;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x02)] public ushort JapaneseCast1;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x04)] public ushort EnglishCast1;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x06)] public ushort FrenchCast1;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x08)] public ushort GermanCast1;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x0A)] public ushort Roles2;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x0C)] public ushort JapaneseCast2;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x0E)] public ushort EnglishCast2;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x10)] public ushort FrenchCast2;
    /// <remarks>CreditCast</remarks>
    [FieldOffset(0x12)] public ushort GermanCast2;
    [FieldOffset(0x14)] public byte Unknown0;
}
