// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x0C)]
public unsafe partial struct CreditFont {
    [FieldOffset(0x00)] public byte Unknown0;
    [FieldOffset(0x01)] public byte Unknown1;
    [FieldOffset(0x02)] public byte Unknown2;
    [FieldOffset(0x03)] public byte Unknown3;
    [FieldOffset(0x04)] public byte Unknown4;
    [FieldOffset(0x05)] public byte Unknown5;
    [FieldOffset(0x06)] public byte Unknown6;
    [FieldOffset(0x07)] public byte Unknown7;
    [FieldOffset(0x08)] public sbyte Unknown8;
}
