// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct CSBonusContent {
    [FieldOffset(0x00)] public int Score1;
    [FieldOffset(0x04)] public int Score2;
    [FieldOffset(0x08)] public int Score3;
    [FieldOffset(0x0C)] public int Score4;
    [FieldOffset(0x10)] public int Score5;
    /// <remarks>CSBonusContentIdentifier</remarks>
    [FieldOffset(0x14)] public ushort Content0;
    /// <remarks>CSBonusContentIdentifier</remarks>
    [FieldOffset(0x16)] public ushort Content1;
    [FieldOffset(0x18)] public ushort Score0;
    /// <remarks>CSBonusContentType</remarks>
    [FieldOffset(0x1A)] public byte ContentType;
    [FieldOffset(0x1B)] public byte RewardCount0;
    [FieldOffset(0x1C)] public byte RewardCount1;
    [FieldOffset(0x1D)] public byte RewardCount2;
    [FieldOffset(0x1E)] public byte RewardCount3;
    [FieldOffset(0x1F)] public byte RewardCount4;
}
