// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct CSBonusSeason {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint Item;
    [FieldOffset(0x04)] public ushort Unknown1;
    [FieldOffset(0x06)] public ushort Unknown2;
    [FieldOffset(0x08)] public ushort Category0;
    [FieldOffset(0x0A)] public ushort Category1;
    [FieldOffset(0x0C)] public ushort Category2;
    [FieldOffset(0x0E)] public ushort Category3;
    /// <remarks>CSBonusTextData</remarks>
    [FieldOffset(0x10)] public byte Text0;
    /// <remarks>CSBonusTextData</remarks>
    [FieldOffset(0x11)] public byte Text1;
    [FieldOffset(0x12)] public byte Unknown12;
    [FieldOffset(0x13)] public bool Unknown3;
    [FieldOffset(0x14)] public bool Unknown4;
    [FieldOffset(0x15)] public bool Unknown0;
}
