// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct Cutscene {
    [FieldOffset(0x00)] public int Path_Offset;
    [FieldOffset(0x04)] public int Unknown0;
    [FieldOffset(0x08)] public int Unknown1;
    [FieldOffset(0x0C)] public int Unknown2;
    [FieldOffset(0x10)] public int Unknown3;
    [FieldOffset(0x14)] public ushort Unknown4;
    [FieldOffset(0x16)] public byte Unknown5;
    [FieldOffset(0x17)] public byte Unknown6;
    [FieldOffset(0x18)] public BitField18Flags BitField18;
    public bool Unknown7 => BitField18.HasFlag(BitField18Flags.Unknown7);
    public bool Unknown8 => BitField18.HasFlag(BitField18Flags.Unknown8);

    [Flags]
    public enum BitField18Flags : byte {
    	Unknown7 = 1 << 0,
    	Unknown8 = 1 << 1,
    }
}
