// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct CutsceneMotion {
    [FieldOffset(0x00)] public float WALK_LOOP_SPEED;
    [FieldOffset(0x04)] public float RUN_LOOP_SPEED;
    [FieldOffset(0x08)] public float SLOWWALK_LOOP_SPEED;
    [FieldOffset(0x0C)] public float SLOWRUN_LOOP_SPEED;
    [FieldOffset(0x10)] public float BATTLEWALK_LOOP_SPEED;
    [FieldOffset(0x14)] public float BATTLERUN_LOOP_SPEED;
    [FieldOffset(0x18)] public float DASH_LOOP_SPEED;
    [FieldOffset(0x1C)] public byte TURN_CW90_FRAME;
    [FieldOffset(0x1D)] public byte TURN_CCW90_FRAME;
    [FieldOffset(0x1E)] public byte TURN_CW180_FRAME;
    [FieldOffset(0x1F)] public byte TURN_CCW180_FRAME;
}
