// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct DeepDungeonDemiclone {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int TitleCase_Offset;
    [FieldOffset(0x0C)] public int Description_Offset;
    [FieldOffset(0x10)] public sbyte Unknown4;
    [FieldOffset(0x11)] public sbyte Unknown5;
    [FieldOffset(0x12)] public sbyte Unknown6;
    [FieldOffset(0x13)] public sbyte Unknown7;
    [FieldOffset(0x14)] public sbyte Unknown8;
    [FieldOffset(0x15)] public sbyte Unknown9;
    [FieldOffset(0x18)] public uint Icon;
}
