// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct DefaultTalk {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray3<DefaultTalkParamsStruct> _defaultTalkParams;
    [FieldOffset(0x18), FixedSizeArray] internal FixedSizeArray3<int> _text;
    [FieldOffset(0x24)] public uint Unknown0;
    [FieldOffset(0x28)] public byte Unknown1;

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public partial struct DefaultTalkParamsStruct {
        /// <remarks>ActionTimeline</remarks>
        [FieldOffset(0x00)] public ushort ActionTimelinePose;
        [FieldOffset(0x02)] public ushort Unknown0;
        [FieldOffset(0x04)] public byte Unknown1;
        [FieldOffset(0x05)] public byte Unknown2;
        [FieldOffset(0x06)] public byte Unknown3;
        [FieldOffset(0x07)] public bool Unknown4;
    }
}
