// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x48)]
public unsafe partial struct DisposalShop {
    [FieldOffset(0x00)] public int ShopName_Offset;
    [FieldOffset(0x04)] public int Unknown0;
    [FieldOffset(0x08)] public ushort Unknown1;
    [FieldOffset(0x0C)] public int Unknown2;
    [FieldOffset(0x10)] public ushort Unknown3;
    [FieldOffset(0x14)] public int Unknown4;
    [FieldOffset(0x18)] public ushort Unknown5;
    [FieldOffset(0x1C)] public int Unknown6;
    [FieldOffset(0x20)] public ushort Unknown7;
    [FieldOffset(0x24)] public int Unknown8;
    [FieldOffset(0x28)] public ushort Unknown9;
    [FieldOffset(0x2C)] public int Unknown10;
    [FieldOffset(0x30)] public ushort Unknown11;
    [FieldOffset(0x34)] public int Unknown12;
    [FieldOffset(0x38)] public ushort Unknown13;
    [FieldOffset(0x3C)] public int Unknown14;
    [FieldOffset(0x40)] public ushort Unknown15;
    [FieldOffset(0x44)] public bool Unknown16;
}
