// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct EmjDani {
    [FieldOffset(0x00)] public uint Icon;
    [FieldOffset(0x04)] public ushort Unknown0;
    [FieldOffset(0x06)] public ushort Unknown1;
    [FieldOffset(0x08)] public short Unknown2;
    [FieldOffset(0x0A)] public short Unknown3;
    [FieldOffset(0x0C)] public short Unknown4;
    [FieldOffset(0x0E)] public short Unknown5;
    [FieldOffset(0x10)] public short Unknown6;
    [FieldOffset(0x12)] public short Unknown7;
    [FieldOffset(0x14)] public short Unknown8;
    [FieldOffset(0x16)] public short Unknown9;
    [FieldOffset(0x18)] public bool Unknown10;
}
