// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct Emote {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public uint UnlockLink;
    /// <remarks>TextCommand</remarks>
    [FieldOffset(0x08)] public int TextCommand;
    [FieldOffset(0x0C), FixedSizeArray] internal FixedSizeArray7<ushort> _actionTimeline;
    [FieldOffset(0x1A)] public ushort Order;
    [FieldOffset(0x1C)] public ushort Icon;
    /// <remarks>LogMessage</remarks>
    [FieldOffset(0x1E)] public ushort LogMessageTargeted;
    /// <remarks>LogMessage</remarks>
    [FieldOffset(0x20)] public ushort LogMessageUntargeted;
    [FieldOffset(0x22)] public ushort Unknown0;
    /// <remarks>EmoteCategory</remarks>
    [FieldOffset(0x24)] public byte EmoteCategory;
    /// <remarks>EmoteMode</remarks>
    [FieldOffset(0x25)] public byte EmoteMode;
    [FieldOffset(0x26)] public BitField26Flags BitField26;
    public bool Unknown1 => BitField26.HasFlag(BitField26Flags.Unknown1);
    public bool Unknown2 => BitField26.HasFlag(BitField26Flags.Unknown2);
    public bool Unknown3 => BitField26.HasFlag(BitField26Flags.Unknown3);
    public bool Unknown4 => BitField26.HasFlag(BitField26Flags.Unknown4);
    public bool Unknown5 => BitField26.HasFlag(BitField26Flags.Unknown5);
    public bool HasCancelEmote => BitField26.HasFlag(BitField26Flags.HasCancelEmote);
    public bool DrawsWeapon => BitField26.HasFlag(BitField26Flags.DrawsWeapon);
    public bool Unknown6 => BitField26.HasFlag(BitField26Flags.Unknown6);

    [Flags]
    public enum BitField26Flags : byte {
    	Unknown1 = 1 << 0,
    	Unknown2 = 1 << 1,
    	Unknown3 = 1 << 2,
    	Unknown4 = 1 << 3,
    	Unknown5 = 1 << 4,
    	HasCancelEmote = 1 << 5,
    	DrawsWeapon = 1 << 6,
    	Unknown6 = 1 << 7,
    }
}
