// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x7C)]
public unsafe partial struct ENpcDressUpDress {
    [FieldOffset(0x00)] public ulong ModelMainHand;
    [FieldOffset(0x08)] public ulong ModelOffHand;
    [FieldOffset(0x10)] public uint Unknown0;
    /// <remarks>ENpcResident</remarks>
    [FieldOffset(0x14)] public uint ENpc;
    [FieldOffset(0x18)] public uint ModelHead;
    [FieldOffset(0x1C)] public uint ModelBody;
    [FieldOffset(0x20)] public uint ModelHands;
    [FieldOffset(0x24)] public uint ModelLegs;
    [FieldOffset(0x28)] public uint ModelFeet;
    [FieldOffset(0x2C)] public uint Unknown1;
    [FieldOffset(0x30)] public uint Unknown2;
    [FieldOffset(0x34)] public uint Unknown3;
    [FieldOffset(0x38)] public uint Unknown4;
    [FieldOffset(0x3C)] public uint Unknown5;
    [FieldOffset(0x40)] public ushort Unknown6;
    /// <remarks>Behavior</remarks>
    [FieldOffset(0x42)] public ushort Behavior;
    [FieldOffset(0x44)] public ushort Unknown7;
    [FieldOffset(0x46)] public byte Unknown8;
    [FieldOffset(0x47)] public byte Unknown9;
    [FieldOffset(0x48)] public byte Unknown10;
    [FieldOffset(0x49)] public byte Unknown11;
    [FieldOffset(0x4A)] public byte Unknown12;
    [FieldOffset(0x4B)] public byte Unknown13;
    [FieldOffset(0x4C)] public byte Unknown14;
    [FieldOffset(0x4D)] public byte Unknown15;
    [FieldOffset(0x4E)] public byte Unknown16;
    [FieldOffset(0x4F)] public byte Unknown17;
    [FieldOffset(0x50)] public byte Unknown18;
    [FieldOffset(0x51)] public byte Unknown19;
    [FieldOffset(0x52)] public byte Unknown20;
    [FieldOffset(0x53)] public byte Unknown21;
    [FieldOffset(0x54)] public byte Unknown22;
    [FieldOffset(0x55)] public byte Unknown23;
    [FieldOffset(0x56)] public byte Unknown24;
    [FieldOffset(0x57)] public byte Unknown25;
    [FieldOffset(0x58)] public byte Unknown26;
    [FieldOffset(0x59)] public byte Unknown27;
    [FieldOffset(0x5A)] public byte Unknown28;
    [FieldOffset(0x5B)] public byte Unknown29;
    [FieldOffset(0x5C)] public byte Unknown30;
    [FieldOffset(0x5D)] public byte Unknown31;
    [FieldOffset(0x5E)] public byte Unknown32;
    [FieldOffset(0x5F)] public byte Unknown33;
    [FieldOffset(0x60)] public byte Unknown34;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x61)] public byte DyeMainHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x62)] public byte Dye2MainHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x63)] public byte DyeOffHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x64)] public byte Dye2OffHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x65)] public byte DyeHead;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x66)] public byte DyeBody;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x67)] public byte DyeHands;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x68)] public byte DyeLegs;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x69)] public byte DyeFeet;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6A)] public byte DyeEars;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6B)] public byte DyeNeck;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6C)] public byte DyeWrists;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6D)] public byte DyeLeftRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6E)] public byte DyeRightRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x6F)] public byte Dye2Head;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x70)] public byte Dye2Body;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x71)] public byte Dye2Hands;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x72)] public byte Dye2Legs;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x73)] public byte Dye2Feet;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x74)] public byte Dye2Ears;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x75)] public byte Dye2Neck;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x76)] public byte Dye2Wrists;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x77)] public byte Dye2LeftRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x78)] public byte Dye2RightRing;
    [FieldOffset(0x79)] public BitField79Flags BitField79;
    public bool Unknown40 => BitField79.HasFlag(BitField79Flags.Unknown40);
    public bool Unknown41 => BitField79.HasFlag(BitField79Flags.Unknown41);
    public bool Unknown42 => BitField79.HasFlag(BitField79Flags.Unknown42);
    public bool Unknown43 => BitField79.HasFlag(BitField79Flags.Unknown43);
    public bool Unknown44 => BitField79.HasFlag(BitField79Flags.Unknown44);

    [Flags]
    public enum BitField79Flags : byte {
    	Unknown40 = 1 << 0,
    	Unknown41 = 1 << 1,
    	Unknown42 = 1 << 2,
    	Unknown43 = 1 << 3,
    	Unknown44 = 1 << 4,
    }
}
