// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x0C)]
public unsafe partial struct EquipRaceCategory {
    [FieldOffset(0x00)] public bool Hyur;
    [FieldOffset(0x01)] public bool Elezen;
    [FieldOffset(0x02)] public bool Lalafell;
    [FieldOffset(0x03)] public bool Miqote;
    [FieldOffset(0x04)] public bool Roegadyn;
    [FieldOffset(0x05)] public bool AuRa;
    [FieldOffset(0x06)] public bool Unknown0;
    [FieldOffset(0x07)] public bool Unknown1;
    [FieldOffset(0x08)] public BitField08Flags BitField08;
    public bool Male => BitField08.HasFlag(BitField08Flags.Male);
    public bool Female => BitField08.HasFlag(BitField08Flags.Female);

    [Flags]
    public enum BitField08Flags : byte {
    	Male = 1 << 0,
    	Female = 1 << 1,
    }
}
