// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct EquipSlotCategory {
    [FieldOffset(0x00)] public sbyte MainHand;
    [FieldOffset(0x01)] public sbyte OffHand;
    [FieldOffset(0x02)] public sbyte Head;
    [FieldOffset(0x03)] public sbyte Body;
    [FieldOffset(0x04)] public sbyte Gloves;
    [FieldOffset(0x05)] public sbyte Waist;
    [FieldOffset(0x06)] public sbyte Legs;
    [FieldOffset(0x07)] public sbyte Feet;
    [FieldOffset(0x08)] public sbyte Ears;
    [FieldOffset(0x09)] public sbyte Neck;
    [FieldOffset(0x0A)] public sbyte Wrists;
    [FieldOffset(0x0B)] public sbyte FingerL;
    [FieldOffset(0x0C)] public sbyte FingerR;
    [FieldOffset(0x0D)] public sbyte SoulCrystal;
}
