// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct EventPathMove {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1_Offset;
    [FieldOffset(0x08)] public uint Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public ushort Unknown8;
    [FieldOffset(0x22)] public ushort Unknown9;
    [FieldOffset(0x24)] public byte Unknown10;
    [FieldOffset(0x25)] public bool Unknown11;
}
