// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct EventItem {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int Name_Offset;
    [FieldOffset(0x0C)] public sbyte Adjective;
    [FieldOffset(0x0D)] public sbyte PossessivePronoun;
    [FieldOffset(0x0E)] public sbyte StartsWithVowel;
    [FieldOffset(0x0F)] public sbyte Unknown0;
    [FieldOffset(0x10)] public sbyte Pronoun;
    [FieldOffset(0x11)] public sbyte Article;
    [FieldOffset(0x12)] public bool Unknown1;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x14)] public uint Quest;
    [FieldOffset(0x18)] public ushort Icon;
    /// <remarks>Action</remarks>
    [FieldOffset(0x1A)] public ushort Action;
    [FieldOffset(0x1C)] public byte StackSize;
    [FieldOffset(0x1D)] public byte Unknown2;
    [FieldOffset(0x1E)] public byte CastTime;
    /// <remarks>EventItemCastTimeline</remarks>
    [FieldOffset(0x1F)] public byte CastTimeline;
    [FieldOffset(0x20)] public byte Timeline;
}
