// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x48)]
public unsafe partial struct FishingSpot {
    [FieldOffset(0x00)] public int BigFishOnReach_Offset;
    [FieldOffset(0x04)] public int BigFishOnEnd_Offset;
    [FieldOffset(0x08)] public int Unknown_70_1_Offset;
    [FieldOffset(0x0C), FixedSizeArray] internal FixedSizeArray10<uint> _item;
    /// <remarks>TerritoryType</remarks>
    [FieldOffset(0x34)] public ushort TerritoryType;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x36)] public ushort PlaceNameMain;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x38)] public ushort PlaceNameSub;
    [FieldOffset(0x3A)] public ushort Radius;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x3C)] public ushort PlaceName;
    [FieldOffset(0x3E)] public ushort Order;
    [FieldOffset(0x40)] public short X;
    [FieldOffset(0x42)] public short Z;
    [FieldOffset(0x44)] public byte GatheringLevel;
    [FieldOffset(0x45)] public byte FishingSpotCategory;
    [FieldOffset(0x46)] public byte Unknown0;
    [FieldOffset(0x47)] public bool Rare;
}
