// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x40)]
public unsafe partial struct FittingShop {
    [FieldOffset(0x00)] public ushort Unknown0;
    [FieldOffset(0x02)] public ushort Unknown1;
    [FieldOffset(0x04)] public ushort Unknown2;
    [FieldOffset(0x06)] public ushort Unknown3;
    [FieldOffset(0x08)] public ushort Unknown4;
    [FieldOffset(0x0A)] public ushort Unknown5;
    [FieldOffset(0x0C)] public ushort Unknown6;
    [FieldOffset(0x0E)] public ushort Unknown7;
    [FieldOffset(0x10)] public ushort Unknown8;
    [FieldOffset(0x12)] public ushort Unknown9;
    [FieldOffset(0x14)] public ushort Unknown10;
    [FieldOffset(0x16)] public ushort Unknown11;
    [FieldOffset(0x18)] public ushort Unknown12;
    [FieldOffset(0x1A)] public ushort Unknown13;
    [FieldOffset(0x1C)] public ushort Unknown14;
    [FieldOffset(0x1E)] public ushort Unknown15;
    [FieldOffset(0x20)] public ushort Unknown16;
    [FieldOffset(0x22)] public ushort Unknown17;
    [FieldOffset(0x24)] public ushort Unknown18;
    [FieldOffset(0x26)] public ushort Unknown19;
    [FieldOffset(0x28)] public ushort Unknown20;
    [FieldOffset(0x2A)] public ushort Unknown21;
    [FieldOffset(0x2C)] public ushort Unknown22;
    [FieldOffset(0x2E)] public ushort Unknown23;
    [FieldOffset(0x30)] public ushort Unknown24;
    [FieldOffset(0x32)] public ushort Unknown25;
    [FieldOffset(0x34)] public ushort Unknown26;
    [FieldOffset(0x36)] public ushort Unknown27;
    [FieldOffset(0x38)] public ushort Unknown28;
    [FieldOffset(0x3A)] public ushort Unknown29;
    [FieldOffset(0x3C)] public ushort Unknown30;
    [FieldOffset(0x3E)] public ushort Unknown31;
}
