// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x50)]
public unsafe partial struct Frontline02 {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public uint Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public uint Unknown8;
    [FieldOffset(0x24)] public ushort Unknown9;
    [FieldOffset(0x26)] public ushort Unknown10;
    [FieldOffset(0x28)] public ushort Unknown11;
    [FieldOffset(0x2A)] public ushort Unknown12;
    [FieldOffset(0x2C)] public ushort Unknown13;
    [FieldOffset(0x2E)] public ushort Unknown14;
    [FieldOffset(0x30)] public ushort Unknown15;
    [FieldOffset(0x32)] public ushort Unknown16;
    [FieldOffset(0x34)] public ushort Unknown17;
    [FieldOffset(0x36)] public ushort Unknown18;
    [FieldOffset(0x38)] public ushort Unknown19;
    [FieldOffset(0x3A)] public ushort Unknown20;
    [FieldOffset(0x3C)] public ushort Unknown21;
    [FieldOffset(0x3E)] public ushort Unknown22;
    [FieldOffset(0x40)] public ushort Unknown23;
    [FieldOffset(0x42)] public ushort Unknown24;
    [FieldOffset(0x44)] public ushort Unknown25;
    [FieldOffset(0x46)] public ushort Unknown26;
    [FieldOffset(0x48)] public ushort Unknown27;
    [FieldOffset(0x4A)] public ushort Unknown28;
    [FieldOffset(0x4C)] public ushort Unknown29;
}
