// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x260)]
public unsafe partial struct Frontline01 {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public ushort Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public ushort Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public ushort Unknown8;
    [FieldOffset(0x24)] public uint Unknown9;
    [FieldOffset(0x28)] public uint Unknown10;
    [FieldOffset(0x2C)] public ushort Unknown11;
    [FieldOffset(0x30)] public uint Unknown12;
    [FieldOffset(0x34)] public uint Unknown13;
    [FieldOffset(0x38)] public ushort Unknown14;
    [FieldOffset(0x3C)] public uint Unknown15;
    [FieldOffset(0x40)] public uint Unknown16;
    [FieldOffset(0x44)] public ushort Unknown17;
    [FieldOffset(0x48)] public uint Unknown18;
    [FieldOffset(0x4C)] public uint Unknown19;
    [FieldOffset(0x50)] public ushort Unknown20;
    [FieldOffset(0x54)] public uint Unknown21;
    [FieldOffset(0x58)] public uint Unknown22;
    [FieldOffset(0x5C)] public ushort Unknown23;
    [FieldOffset(0x60)] public uint Unknown24;
    [FieldOffset(0x64)] public byte Unknown25;
    [FieldOffset(0x65)] public byte Unknown26;
    [FieldOffset(0x68)] public uint Unknown27;
    [FieldOffset(0x6C)] public byte Unknown28;
    [FieldOffset(0x6D)] public byte Unknown29;
    [FieldOffset(0x70)] public uint Unknown30;
    [FieldOffset(0x74)] public byte Unknown31;
    [FieldOffset(0x75)] public byte Unknown32;
    [FieldOffset(0x78)] public uint Unknown33;
    [FieldOffset(0x7C)] public byte Unknown34;
    [FieldOffset(0x7D)] public byte Unknown35;
    [FieldOffset(0x80)] public uint Unknown36;
    [FieldOffset(0x84)] public byte Unknown37;
    [FieldOffset(0x85)] public byte Unknown38;
    [FieldOffset(0x88)] public uint Unknown39;
    [FieldOffset(0x8C)] public byte Unknown40;
    [FieldOffset(0x8D)] public byte Unknown41;
    [FieldOffset(0x90)] public uint Unknown42;
    [FieldOffset(0x94)] public byte Unknown43;
    [FieldOffset(0x95)] public byte Unknown44;
    [FieldOffset(0x98)] public uint Unknown45;
    [FieldOffset(0x9C)] public byte Unknown46;
    [FieldOffset(0x9D)] public byte Unknown47;
    [FieldOffset(0xA0)] public uint Unknown48;
    [FieldOffset(0xA4)] public byte Unknown49;
    [FieldOffset(0xA5)] public byte Unknown50;
    [FieldOffset(0xA8)] public uint Unknown51;
    [FieldOffset(0xAC)] public byte Unknown52;
    [FieldOffset(0xAD)] public byte Unknown53;
    [FieldOffset(0xB0)] public uint Unknown54;
    [FieldOffset(0xB4)] public byte Unknown55;
    [FieldOffset(0xB5)] public byte Unknown56;
    [FieldOffset(0xB8)] public uint Unknown57;
    [FieldOffset(0xBC)] public byte Unknown58;
    [FieldOffset(0xBD)] public byte Unknown59;
    [FieldOffset(0xC0)] public uint Unknown60;
    [FieldOffset(0xC4)] public byte Unknown61;
    [FieldOffset(0xC5)] public byte Unknown62;
    [FieldOffset(0xC8)] public uint Unknown63;
    [FieldOffset(0xCC)] public byte Unknown64;
    [FieldOffset(0xCD)] public byte Unknown65;
    [FieldOffset(0xD0)] public uint Unknown66;
    [FieldOffset(0xD4)] public byte Unknown67;
    [FieldOffset(0xD5)] public byte Unknown68;
    [FieldOffset(0xD8)] public uint Unknown69;
    [FieldOffset(0xDC)] public byte Unknown70;
    [FieldOffset(0xDD)] public byte Unknown71;
    [FieldOffset(0xE0)] public uint Unknown72;
    [FieldOffset(0xE4)] public byte Unknown73;
    [FieldOffset(0xE5)] public byte Unknown74;
    [FieldOffset(0xE8)] public uint Unknown75;
    [FieldOffset(0xEC)] public byte Unknown76;
    [FieldOffset(0xED)] public byte Unknown77;
    [FieldOffset(0xF0)] public uint Unknown78;
    [FieldOffset(0xF4)] public byte Unknown79;
    [FieldOffset(0xF5)] public byte Unknown80;
    [FieldOffset(0xF8)] public uint Unknown81;
    [FieldOffset(0xFC)] public byte Unknown82;
    [FieldOffset(0xFD)] public byte Unknown83;
    [FieldOffset(0x100)] public uint Unknown84;
    [FieldOffset(0x104)] public byte Unknown85;
    [FieldOffset(0x105)] public byte Unknown86;
    [FieldOffset(0x108)] public uint Unknown87;
    [FieldOffset(0x10C)] public byte Unknown88;
    [FieldOffset(0x10D)] public byte Unknown89;
    [FieldOffset(0x110)] public uint Unknown90;
    [FieldOffset(0x114)] public byte Unknown91;
    [FieldOffset(0x115)] public byte Unknown92;
    [FieldOffset(0x118)] public uint Unknown93;
    [FieldOffset(0x11C)] public byte Unknown94;
    [FieldOffset(0x11D)] public byte Unknown95;
    [FieldOffset(0x120)] public uint Unknown96;
    [FieldOffset(0x124)] public byte Unknown97;
    [FieldOffset(0x125)] public byte Unknown98;
    [FieldOffset(0x128)] public uint Unknown99;
    [FieldOffset(0x12C)] public byte Unknown100;
    [FieldOffset(0x12D)] public byte Unknown101;
    [FieldOffset(0x130)] public uint Unknown102;
    [FieldOffset(0x134)] public byte Unknown103;
    [FieldOffset(0x135)] public byte Unknown104;
    [FieldOffset(0x138)] public uint Unknown105;
    [FieldOffset(0x13C)] public byte Unknown106;
    [FieldOffset(0x13D)] public byte Unknown107;
    [FieldOffset(0x140)] public uint Unknown108;
    [FieldOffset(0x144)] public byte Unknown109;
    [FieldOffset(0x145)] public byte Unknown110;
    [FieldOffset(0x148)] public uint Unknown111;
    [FieldOffset(0x14C)] public byte Unknown112;
    [FieldOffset(0x14D)] public byte Unknown113;
    [FieldOffset(0x150)] public uint Unknown114;
    [FieldOffset(0x154)] public byte Unknown115;
    [FieldOffset(0x155)] public byte Unknown116;
    [FieldOffset(0x158)] public uint Unknown117;
    [FieldOffset(0x15C)] public byte Unknown118;
    [FieldOffset(0x15D)] public byte Unknown119;
    [FieldOffset(0x160)] public uint Unknown120;
    [FieldOffset(0x164)] public byte Unknown121;
    [FieldOffset(0x165)] public byte Unknown122;
    [FieldOffset(0x168)] public uint Unknown123;
    [FieldOffset(0x16C)] public byte Unknown124;
    [FieldOffset(0x16D)] public byte Unknown125;
    [FieldOffset(0x170)] public uint Unknown126;
    [FieldOffset(0x174)] public byte Unknown127;
    [FieldOffset(0x175)] public byte Unknown128;
    [FieldOffset(0x178)] public uint Unknown129;
    [FieldOffset(0x17C)] public byte Unknown130;
    [FieldOffset(0x17D)] public byte Unknown131;
    [FieldOffset(0x180)] public uint Unknown132;
    [FieldOffset(0x184)] public byte Unknown133;
    [FieldOffset(0x185)] public byte Unknown134;
    [FieldOffset(0x188)] public uint Unknown135;
    [FieldOffset(0x18C)] public byte Unknown136;
    [FieldOffset(0x18D)] public byte Unknown137;
    [FieldOffset(0x190)] public uint Unknown138;
    [FieldOffset(0x194)] public byte Unknown139;
    [FieldOffset(0x195)] public byte Unknown140;
    [FieldOffset(0x198)] public uint Unknown141;
    [FieldOffset(0x19C)] public byte Unknown142;
    [FieldOffset(0x19D)] public byte Unknown143;
    [FieldOffset(0x1A0)] public uint Unknown144;
    [FieldOffset(0x1A4)] public byte Unknown145;
    [FieldOffset(0x1A5)] public byte Unknown146;
    [FieldOffset(0x1A8)] public uint Unknown147;
    [FieldOffset(0x1AC)] public byte Unknown148;
    [FieldOffset(0x1AD)] public byte Unknown149;
    [FieldOffset(0x1B0)] public uint Unknown150;
    [FieldOffset(0x1B4)] public byte Unknown151;
    [FieldOffset(0x1B5)] public byte Unknown152;
    [FieldOffset(0x1B8)] public uint Unknown153;
    [FieldOffset(0x1BC)] public byte Unknown154;
    [FieldOffset(0x1BD)] public byte Unknown155;
    [FieldOffset(0x1C0)] public uint Unknown156;
    [FieldOffset(0x1C4)] public byte Unknown157;
    [FieldOffset(0x1C5)] public byte Unknown158;
    [FieldOffset(0x1C8)] public uint Unknown159;
    [FieldOffset(0x1CC)] public byte Unknown160;
    [FieldOffset(0x1CD)] public byte Unknown161;
    [FieldOffset(0x1D0)] public uint Unknown162;
    [FieldOffset(0x1D4)] public byte Unknown163;
    [FieldOffset(0x1D5)] public byte Unknown164;
    [FieldOffset(0x1D8)] public uint Unknown165;
    [FieldOffset(0x1DC)] public byte Unknown166;
    [FieldOffset(0x1DD)] public byte Unknown167;
    [FieldOffset(0x1E0)] public uint Unknown168;
    [FieldOffset(0x1E4)] public byte Unknown169;
    [FieldOffset(0x1E8)] public uint Unknown170;
    [FieldOffset(0x1EC)] public byte Unknown171;
    [FieldOffset(0x1F0)] public uint Unknown172;
    [FieldOffset(0x1F4)] public byte Unknown173;
    [FieldOffset(0x1F8)] public uint Unknown174;
    [FieldOffset(0x1FC)] public byte Unknown175;
    [FieldOffset(0x200)] public uint Unknown176;
    [FieldOffset(0x204)] public byte Unknown177;
    [FieldOffset(0x208)] public uint Unknown178;
    [FieldOffset(0x20C)] public byte Unknown179;
    [FieldOffset(0x210)] public uint Unknown180;
    [FieldOffset(0x214)] public byte Unknown181;
    [FieldOffset(0x218)] public uint Unknown182;
    [FieldOffset(0x21C)] public byte Unknown183;
    [FieldOffset(0x220)] public uint Unknown184;
    [FieldOffset(0x224)] public byte Unknown185;
    [FieldOffset(0x228)] public uint Unknown186;
    [FieldOffset(0x22C)] public byte Unknown187;
    [FieldOffset(0x230)] public uint Unknown188;
    [FieldOffset(0x234)] public byte Unknown189;
    [FieldOffset(0x238)] public uint Unknown190;
    [FieldOffset(0x23C)] public byte Unknown191;
    [FieldOffset(0x240)] public uint Unknown192;
    [FieldOffset(0x244)] public byte Unknown193;
    [FieldOffset(0x248)] public uint Unknown194;
    [FieldOffset(0x24C)] public byte Unknown195;
    [FieldOffset(0x250)] public uint Unknown196;
    [FieldOffset(0x254)] public byte Unknown197;
    [FieldOffset(0x258)] public uint Unknown198;
    [FieldOffset(0x25C)] public byte Unknown199;
}
