// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct GatheringLeveBNpcEntry {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public ushort Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public int Unknown4;
    [FieldOffset(0x14)] public ushort Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public int Unknown7;
    [FieldOffset(0x20)] public ushort Unknown8;
    [FieldOffset(0x24)] public uint Unknown9;
    [FieldOffset(0x28)] public int Unknown10;
    [FieldOffset(0x2C)] public ushort Unknown11;
}
