// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x34)]
public unsafe partial struct GatheringLeve {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray4<int> _route;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray4<int> _requiredItem;
    /// <remarks>GatheringLeveRule</remarks>
    [FieldOffset(0x20)] public int Rule;
    /// <remarks>GatheringLeveBNpcEntry</remarks>
    [FieldOffset(0x24)] public int BNpcEntry;
    [FieldOffset(0x28), FixedSizeArray] internal FixedSizeArray2<ushort> _objective;
    [FieldOffset(0x2C), FixedSizeArray] internal FixedSizeArray4<byte> _requiredItemQuantity;
    [FieldOffset(0x30)] public byte ItemNumber;
    [FieldOffset(0x31)] public byte Varient;
    [FieldOffset(0x32)] public bool UseSecondaryTool;
}
