// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x74)]
public unsafe partial struct GcArmyExpedition {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    [FieldOffset(0x08), FixedSizeArray] internal FixedSizeArray6<ExpeditionParamsStruct> _expeditionParams;
    [FieldOffset(0x68)] public uint RewardExperience;
    [FieldOffset(0x6C)] public ushort RequiredSeals;
    [FieldOffset(0x6E)] public byte RequiredFlag;
    [FieldOffset(0x6F)] public byte UnlockFlag;
    [FieldOffset(0x70)] public byte RequiredLevel;
    [FieldOffset(0x71)] public byte PercentBase;
    [FieldOffset(0x72)] public byte Unknown0;
    /// <remarks>GcArmyExpeditionType</remarks>
    [FieldOffset(0x73)] public byte GcArmyExpeditionType;

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public partial struct ExpeditionParamsStruct {
        /// <remarks>Item</remarks>
        [FieldOffset(0x00)] public int RewardItem;
        [FieldOffset(0x04)] public ushort RequiredPhysical;
        [FieldOffset(0x06)] public ushort RequiredMental;
        [FieldOffset(0x08)] public ushort RequiredTactical;
        [FieldOffset(0x0A)] public byte RewardQuantity;
        [FieldOffset(0x0B)] public byte PercentPhysicalMet;
        [FieldOffset(0x0C)] public byte PercentMentalMet;
        [FieldOffset(0x0D)] public byte PercentTacticalMet;
        [FieldOffset(0x0E)] public byte PercentAllMet;
    }
}
