// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x178)]
public unsafe partial struct GcArmyMemberGrow {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray60<MemberParamsStruct> _memberParams;
    [FieldOffset(0x168)] public ushort Unknown0;
    [FieldOffset(0x16A)] public byte Unknown1;
    [FieldOffset(0x16B)] public byte Unknown2;
    [FieldOffset(0x16C)] public byte Unknown3;
    /// <remarks>Item</remarks>
    [FieldOffset(0x170)] public int ClassBook;
    /// <remarks>ClassJob</remarks>
    [FieldOffset(0x174)] public byte ClassJob;

    [StructLayout(LayoutKind.Explicit, Size = 0x06)]
    public partial struct MemberParamsStruct {
        /// <remarks>GcArmyEquipPreset</remarks>
        [FieldOffset(0x00)] public ushort EquipPreset;
        [FieldOffset(0x02)] public byte Physical;
        [FieldOffset(0x03)] public byte Mental;
        [FieldOffset(0x04)] public byte Tactical;
    }
}
