// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct GCRankGridaniaFemaleText {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int NameRank_Offset;
    [FieldOffset(0x0C)] public int Unknown0_Offset;
    [FieldOffset(0x10)] public sbyte Adjective;
    [FieldOffset(0x11)] public sbyte PossessivePronoun;
    [FieldOffset(0x12)] public sbyte StartsWithVowel;
    [FieldOffset(0x13)] public sbyte Unknown1;
    [FieldOffset(0x14)] public sbyte Pronoun;
    [FieldOffset(0x15)] public sbyte Article;
}
