// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct GeneralAction {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    [FieldOffset(0x08)] public int Icon;
    /// <remarks>Action</remarks>
    [FieldOffset(0x0C)] public ushort Action;
    [FieldOffset(0x0E)] public ushort UnlockLink;
    [FieldOffset(0x10)] public byte Unknown0;
    [FieldOffset(0x11)] public byte Recast;
    [FieldOffset(0x12)] public byte UIPriority;
    [FieldOffset(0x13)] public bool Unknown1;
}
