// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct GilShopItem {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public int Item;
    [FieldOffset(0x04), FixedSizeArray] internal FixedSizeArray2<int> _questRequired;
    /// <remarks>Achievement</remarks>
    [FieldOffset(0x0C)] public int AchievementRequired;
    [FieldOffset(0x10)] public ushort StateRequired;
    [FieldOffset(0x12)] public ushort Patch;
    [FieldOffset(0x14)] public byte Unknown_70_1;
    [FieldOffset(0x15)] public byte Unknown_70_2;
    [FieldOffset(0x16)] public byte Unknown1;
    [FieldOffset(0x17)] public bool Unknown2;
}
