// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct GimmickRect {
    [FieldOffset(0x00)] public uint LayoutID;
    [FieldOffset(0x04)] public uint Param0;
    [FieldOffset(0x08)] public uint Unknown0;
    [FieldOffset(0x0C)] public uint Unknown1;
    [FieldOffset(0x10)] public uint Unknown2;
    [FieldOffset(0x14)] public uint Param1;
    [FieldOffset(0x18)] public uint Unknown3;
    [FieldOffset(0x1C)] public uint Unknown4;
    [FieldOffset(0x20)] public uint Unknown5;
    [FieldOffset(0x24)] public byte TriggerIn;
    [FieldOffset(0x25)] public byte TriggerOut;
}
