// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x34)]
public unsafe partial struct GlassesStyle {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int Name_Offset;
    [FieldOffset(0x0C)] public sbyte Unknown_70_1;
    [FieldOffset(0x0D)] public sbyte Unknown_70_2;
    [FieldOffset(0x0E)] public sbyte Unknown_70_3;
    [FieldOffset(0x0F)] public sbyte Unknown_70_4;
    [FieldOffset(0x10)] public sbyte Unknown_70_5;
    [FieldOffset(0x11)] public sbyte Unknown_70_6;
    [FieldOffset(0x14)] public int Icon;
    [FieldOffset(0x18)] public ushort Order;
    [FieldOffset(0x1A), FixedSizeArray] internal FixedSizeArray12<ushort> _glasses;
    [FieldOffset(0x32)] public short Unknown_70_7;
}
