// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct Glasses {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public int Description_Offset;
    [FieldOffset(0x0C)] public int Name_Offset;
    [FieldOffset(0x10)] public sbyte Unknown_70_1;
    [FieldOffset(0x11)] public sbyte Unknown_70_2;
    [FieldOffset(0x12)] public sbyte Unknown_70_3;
    [FieldOffset(0x13)] public sbyte Unknown_70_4;
    [FieldOffset(0x14)] public sbyte Unknown_70_5;
    [FieldOffset(0x15)] public sbyte Unknown_70_6;
    [FieldOffset(0x18)] public uint Unknown_70_7;
    [FieldOffset(0x1C)] public int Icon;
    [FieldOffset(0x20)] public ushort Unknown_70_8;
    [FieldOffset(0x22)] public short Unknown_70_9;
}
