// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x58)]
public unsafe partial struct GoldSaucerArcadeMachine {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Poor;
    [FieldOffset(0x08)] public byte Unknown1;
    [FieldOffset(0x09)] public byte Unknown2;
    [FieldOffset(0x0A)] public byte Unknown3;
    [FieldOffset(0x0B)] public byte Unknown4;
    [FieldOffset(0x0C)] public uint Unknown5;
    [FieldOffset(0x10)] public uint Good;
    [FieldOffset(0x14)] public byte Unknown6;
    [FieldOffset(0x15)] public byte Unknown7;
    [FieldOffset(0x16)] public byte Unknown8;
    [FieldOffset(0x17)] public byte Unknown9;
    [FieldOffset(0x18)] public uint Unknown10;
    [FieldOffset(0x1C)] public uint Great;
    [FieldOffset(0x20)] public byte Unknown11;
    [FieldOffset(0x21)] public byte Unknown12;
    [FieldOffset(0x22)] public byte Unknown13;
    [FieldOffset(0x23)] public byte Unknown14;
    [FieldOffset(0x24)] public uint Unknown15;
    [FieldOffset(0x28)] public uint Excellent;
    [FieldOffset(0x2C)] public byte Unknown16;
    [FieldOffset(0x2D)] public byte Unknown17;
    [FieldOffset(0x2E)] public byte Unknown18;
    [FieldOffset(0x2F)] public byte Unknown19;
    [FieldOffset(0x30)] public int Unknown20_Offset;
    [FieldOffset(0x34)] public int Unknown21_Offset;
    [FieldOffset(0x38)] public int Unknown22_Offset;
    [FieldOffset(0x3C)] public int Unknown23_Offset;
    [FieldOffset(0x40)] public uint FailImage;
    [FieldOffset(0x44)] public uint Unknown24;
    [FieldOffset(0x48)] public ushort Unknown25;
    [FieldOffset(0x4A)] public byte Unknown26;
    [FieldOffset(0x4B)] public byte Unknown27;
    [FieldOffset(0x4C)] public byte Unknown28;
    [FieldOffset(0x4D)] public byte Unknown29;
    [FieldOffset(0x4E)] public byte Unknown30;
    [FieldOffset(0x4F)] public byte Unknown31;
    [FieldOffset(0x50)] public sbyte Unknown32;
    [FieldOffset(0x51)] public sbyte Unknown33;
    [FieldOffset(0x52)] public sbyte Unknown34;
    [FieldOffset(0x53)] public sbyte Unknown35;
    [FieldOffset(0x54)] public sbyte Unknown36;
    [FieldOffset(0x55)] public sbyte Unknown37;
}
