// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct GrandCompanyRank {
    [FieldOffset(0x00)] public uint MaxSeals;
    [FieldOffset(0x04)] public uint RequiredSeals;
    [FieldOffset(0x08)] public int IconMaelstrom;
    [FieldOffset(0x0C)] public int IconSerpents;
    [FieldOffset(0x10)] public int IconFlames;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x14)] public int QuestMaelstrom;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x18)] public int QuestSerpents;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x1C)] public int QuestFlames;
    [FieldOffset(0x20)] public byte Tier;
    [FieldOffset(0x21)] public byte Order;
    [FieldOffset(0x22)] public byte Unknown0;
}
