// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct GroupPoseStamp {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public int StampIcon;
    [FieldOffset(0x0C)] public int Unknown1;
    /// <remarks>GroupPoseStampCategory</remarks>
    [FieldOffset(0x10)] public int Category;
    [FieldOffset(0x14)] public int Unknown2;
    [FieldOffset(0x18)] public ushort Unknown3;
    [FieldOffset(0x1A)] public byte Unknown4;
    [FieldOffset(0x1B)] public BitField1BFlags BitField1B;
    public bool Unknown5 => BitField1B.HasFlag(BitField1BFlags.Unknown5);
    public bool Unknown6 => BitField1B.HasFlag(BitField1BFlags.Unknown6);
    public bool Unknown7 => BitField1B.HasFlag(BitField1BFlags.Unknown7);

    [Flags]
    public enum BitField1BFlags : byte {
    	Unknown5 = 1 << 0,
    	Unknown6 = 1 << 1,
    	Unknown7 = 1 << 2,
    }
}
