// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x5C)]
public unsafe partial struct GuildleveAssignmentTalk {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public byte Unknown2;
    [FieldOffset(0x09)] public sbyte Unknown3;
    [FieldOffset(0x0A)] public sbyte Unknown4;
    [FieldOffset(0x0B)] public bool Unknown5;
    [FieldOffset(0x0C)] public uint Unknown6;
    [FieldOffset(0x10)] public int Unknown7;
    [FieldOffset(0x14)] public byte Unknown8;
    [FieldOffset(0x15)] public sbyte Unknown9;
    [FieldOffset(0x16)] public sbyte Unknown10;
    [FieldOffset(0x17)] public bool Unknown11;
    [FieldOffset(0x18)] public uint Unknown12;
    [FieldOffset(0x1C)] public int Unknown13;
    [FieldOffset(0x20)] public byte Unknown14;
    [FieldOffset(0x21)] public sbyte Unknown15;
    [FieldOffset(0x22)] public sbyte Unknown16;
    [FieldOffset(0x23)] public bool Unknown17;
    [FieldOffset(0x24)] public uint Unknown18;
    [FieldOffset(0x28)] public int Unknown19;
    [FieldOffset(0x2C)] public byte Unknown20;
    [FieldOffset(0x2D)] public sbyte Unknown21;
    [FieldOffset(0x2E)] public sbyte Unknown22;
    [FieldOffset(0x2F)] public bool Unknown23;
    [FieldOffset(0x30)] public uint Unknown24;
    [FieldOffset(0x34)] public int Unknown25;
    [FieldOffset(0x38)] public byte Unknown26;
    [FieldOffset(0x39)] public sbyte Unknown27;
    [FieldOffset(0x3A)] public sbyte Unknown28;
    [FieldOffset(0x3B)] public bool Unknown29;
    [FieldOffset(0x3C), FixedSizeArray] internal FixedSizeArray8<int> _talk;
}
