// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x3C)]
public unsafe partial struct GuildOrder {
    [FieldOffset(0x00)] public int Objective_Offset;
    [FieldOffset(0x04)] public int Description1_Offset;
    [FieldOffset(0x08)] public int Description2_Offset;
    [FieldOffset(0x0C)] public int Description3_Offset;
    [FieldOffset(0x10)] public uint CompletionBonusExp;
    [FieldOffset(0x14)] public uint RewardExp;
    [FieldOffset(0x18)] public uint CompletionBonusGil;
    [FieldOffset(0x1C)] public uint RewardGil;
    [FieldOffset(0x20)] public uint Unknown0;
    [FieldOffset(0x24)] public uint Unknown1;
    [FieldOffset(0x28)] public uint Unknown2;
    [FieldOffset(0x2C)] public uint Unknown3;
    [FieldOffset(0x30)] public ushort Unknown4;
    [FieldOffset(0x32)] public ushort Unknown5;
    [FieldOffset(0x34)] public bool Unknown6;
    [FieldOffset(0x35)] public bool Unknown7;
    /// <remarks>ENpcResident</remarks>
    [FieldOffset(0x38)] public uint ENpcName;
}
