// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0xFF8)]
public unsafe partial struct HairMakeType {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public uint Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public uint Unknown8;
    [FieldOffset(0x24)] public uint Unknown9;
    [FieldOffset(0x28)] public uint Unknown10;
    [FieldOffset(0x2C)] public uint Unknown11;
    [FieldOffset(0x30)] public uint Unknown12;
    [FieldOffset(0x34)] public uint Unknown13;
    [FieldOffset(0x38)] public uint Unknown14;
    [FieldOffset(0x3C)] public uint Unknown15;
    [FieldOffset(0x40)] public uint Unknown16;
    [FieldOffset(0x44)] public uint Unknown17;
    [FieldOffset(0x48)] public uint Unknown18;
    [FieldOffset(0x4C)] public uint Unknown19;
    [FieldOffset(0x50)] public uint Unknown20;
    [FieldOffset(0x54)] public uint Unknown21;
    [FieldOffset(0x58)] public uint Unknown22;
    [FieldOffset(0x5C)] public uint Unknown23;
    [FieldOffset(0x60)] public uint Unknown24;
    [FieldOffset(0x64)] public uint Unknown25;
    [FieldOffset(0x68)] public uint Unknown26;
    [FieldOffset(0x6C)] public uint Unknown27;
    [FieldOffset(0x70)] public uint Unknown28;
    [FieldOffset(0x74)] public uint Unknown29;
    [FieldOffset(0x78)] public uint Unknown30;
    [FieldOffset(0x7C)] public uint Unknown31;
    [FieldOffset(0x80)] public uint Unknown32;
    [FieldOffset(0x84)] public uint Unknown33;
    [FieldOffset(0x88)] public uint Unknown34;
    [FieldOffset(0x8C)] public uint Unknown35;
    [FieldOffset(0x90)] public uint Unknown36;
    [FieldOffset(0x94)] public uint Unknown37;
    [FieldOffset(0x98)] public uint Unknown38;
    [FieldOffset(0x9C)] public uint Unknown39;
    [FieldOffset(0xA0)] public uint Unknown40;
    [FieldOffset(0xA4)] public uint Unknown41;
    [FieldOffset(0xA8)] public uint Unknown42;
    [FieldOffset(0xAC)] public uint Unknown43;
    [FieldOffset(0xB0)] public uint Unknown44;
    [FieldOffset(0xB4)] public uint Unknown45;
    [FieldOffset(0xB8)] public uint Unknown46;
    [FieldOffset(0xBC)] public uint Unknown47;
    [FieldOffset(0xC0)] public uint Unknown48;
    [FieldOffset(0xC4)] public uint Unknown49;
    [FieldOffset(0xC8)] public uint Unknown50;
    [FieldOffset(0xCC)] public uint Unknown51;
    [FieldOffset(0xD0)] public uint Unknown52;
    [FieldOffset(0xD4)] public uint Unknown53;
    [FieldOffset(0xD8)] public uint Unknown54;
    [FieldOffset(0xDC)] public uint Unknown55;
    [FieldOffset(0xE0)] public uint Unknown56;
    [FieldOffset(0xE4)] public uint Unknown57;
    [FieldOffset(0xE8)] public uint Unknown58;
    [FieldOffset(0xEC)] public uint Unknown59;
    [FieldOffset(0xF0)] public uint Unknown60;
    [FieldOffset(0xF4)] public uint Unknown61;
    [FieldOffset(0xF8)] public uint Unknown62;
    [FieldOffset(0xFC)] public uint Unknown63;
    [FieldOffset(0x100)] public uint Unknown64;
    [FieldOffset(0x104)] public uint Unknown65;
    [FieldOffset(0x108)] public uint Unknown66;
    [FieldOffset(0x10C)] public uint Unknown67;
    [FieldOffset(0x110)] public uint Unknown68;
    [FieldOffset(0x114)] public uint Unknown69;
    [FieldOffset(0x118)] public uint Unknown70;
    [FieldOffset(0x11C)] public uint Unknown71;
    [FieldOffset(0x120)] public uint Unknown72;
    [FieldOffset(0x124)] public uint Unknown73;
    [FieldOffset(0x128)] public uint Unknown74;
    [FieldOffset(0x12C)] public uint Unknown75;
    [FieldOffset(0x130)] public uint Unknown76;
    [FieldOffset(0x134)] public uint Unknown77;
    [FieldOffset(0x138)] public uint Unknown78;
    [FieldOffset(0x13C)] public uint Unknown79;
    [FieldOffset(0x140)] public uint Unknown80;
    [FieldOffset(0x144)] public uint Unknown81;
    [FieldOffset(0x148)] public uint Unknown82;
    [FieldOffset(0x14C)] public uint Unknown83;
    [FieldOffset(0x150)] public uint Unknown84;
    [FieldOffset(0x154)] public uint Unknown85;
    [FieldOffset(0x158)] public uint Unknown86;
    [FieldOffset(0x15C)] public uint Unknown87;
    [FieldOffset(0x160)] public uint Unknown88;
    [FieldOffset(0x164)] public uint Unknown89;
    [FieldOffset(0x168)] public uint Unknown90;
    [FieldOffset(0x16C)] public uint Unknown91;
    [FieldOffset(0x170)] public uint Unknown92;
    [FieldOffset(0x174)] public uint Unknown93;
    [FieldOffset(0x178)] public uint Unknown94;
    [FieldOffset(0x17C)] public uint Unknown95;
    [FieldOffset(0x180)] public uint Unknown96;
    [FieldOffset(0x184)] public uint Unknown97;
    [FieldOffset(0x188)] public uint Unknown98;
    [FieldOffset(0x18C)] public uint Unknown99;
    [FieldOffset(0x190)] public uint Unknown100;
    [FieldOffset(0x194)] public uint Unknown101;
    [FieldOffset(0x198)] public uint Unknown102;
    [FieldOffset(0x19C)] public byte Unknown103;
    [FieldOffset(0x19D)] public byte Unknown104;
    [FieldOffset(0x19E)] public byte Unknown105;
    [FieldOffset(0x19F)] public byte Unknown106;
    [FieldOffset(0x1A0)] public byte Unknown107;
    [FieldOffset(0x1A1)] public byte Unknown108;
    [FieldOffset(0x1A2)] public byte Unknown109;
    [FieldOffset(0x1A3)] public byte Unknown110;
    [FieldOffset(0x1A4)] public byte Unknown111;
    [FieldOffset(0x1A5)] public byte Unknown112;
    [FieldOffset(0x1A6)] public byte Unknown113;
    [FieldOffset(0x1A7)] public byte Unknown114;
    [FieldOffset(0x1A8)] public byte Unknown115;
    [FieldOffset(0x1A9)] public byte Unknown116;
    [FieldOffset(0x1AC)] public uint Unknown117;
    [FieldOffset(0x1B0)] public uint Unknown118;
    [FieldOffset(0x1B4)] public uint Unknown119;
    [FieldOffset(0x1B8)] public uint Unknown120;
    [FieldOffset(0x1BC)] public uint Unknown121;
    [FieldOffset(0x1C0)] public uint Unknown122;
    [FieldOffset(0x1C4)] public uint Unknown123;
    [FieldOffset(0x1C8)] public uint Unknown124;
    [FieldOffset(0x1CC)] public uint Unknown125;
    [FieldOffset(0x1D0)] public uint Unknown126;
    [FieldOffset(0x1D4)] public uint Unknown127;
    [FieldOffset(0x1D8)] public uint Unknown128;
    [FieldOffset(0x1DC)] public uint Unknown129;
    [FieldOffset(0x1E0)] public uint Unknown130;
    [FieldOffset(0x1E4)] public uint Unknown131;
    [FieldOffset(0x1E8)] public uint Unknown132;
    [FieldOffset(0x1EC)] public uint Unknown133;
    [FieldOffset(0x1F0)] public uint Unknown134;
    [FieldOffset(0x1F4)] public uint Unknown135;
    [FieldOffset(0x1F8)] public uint Unknown136;
    [FieldOffset(0x1FC)] public uint Unknown137;
    [FieldOffset(0x200)] public uint Unknown138;
    [FieldOffset(0x204)] public uint Unknown139;
    [FieldOffset(0x208)] public uint Unknown140;
    [FieldOffset(0x20C)] public uint Unknown141;
    [FieldOffset(0x210)] public uint Unknown142;
    [FieldOffset(0x214)] public uint Unknown143;
    [FieldOffset(0x218)] public uint Unknown144;
    [FieldOffset(0x21C)] public uint Unknown145;
    [FieldOffset(0x220)] public uint Unknown146;
    [FieldOffset(0x224)] public uint Unknown147;
    [FieldOffset(0x228)] public uint Unknown148;
    [FieldOffset(0x22C)] public uint Unknown149;
    [FieldOffset(0x230)] public uint Unknown150;
    [FieldOffset(0x234)] public uint Unknown151;
    [FieldOffset(0x238)] public uint Unknown152;
    [FieldOffset(0x23C)] public uint Unknown153;
    [FieldOffset(0x240)] public uint Unknown154;
    [FieldOffset(0x244)] public uint Unknown155;
    [FieldOffset(0x248)] public uint Unknown156;
    [FieldOffset(0x24C)] public uint Unknown157;
    [FieldOffset(0x250)] public uint Unknown158;
    [FieldOffset(0x254)] public uint Unknown159;
    [FieldOffset(0x258)] public uint Unknown160;
    [FieldOffset(0x25C)] public uint Unknown161;
    [FieldOffset(0x260)] public uint Unknown162;
    [FieldOffset(0x264)] public uint Unknown163;
    [FieldOffset(0x268)] public uint Unknown164;
    [FieldOffset(0x26C)] public uint Unknown165;
    [FieldOffset(0x270)] public uint Unknown166;
    [FieldOffset(0x274)] public uint Unknown167;
    [FieldOffset(0x278)] public uint Unknown168;
    [FieldOffset(0x27C)] public uint Unknown169;
    [FieldOffset(0x280)] public uint Unknown170;
    [FieldOffset(0x284)] public uint Unknown171;
    [FieldOffset(0x288)] public uint Unknown172;
    [FieldOffset(0x28C)] public uint Unknown173;
    [FieldOffset(0x290)] public uint Unknown174;
    [FieldOffset(0x294)] public uint Unknown175;
    [FieldOffset(0x298)] public uint Unknown176;
    [FieldOffset(0x29C)] public uint Unknown177;
    [FieldOffset(0x2A0)] public uint Unknown178;
    [FieldOffset(0x2A4)] public uint Unknown179;
    [FieldOffset(0x2A8)] public uint Unknown180;
    [FieldOffset(0x2AC)] public uint Unknown181;
    [FieldOffset(0x2B0)] public uint Unknown182;
    [FieldOffset(0x2B4)] public uint Unknown183;
    [FieldOffset(0x2B8)] public uint Unknown184;
    [FieldOffset(0x2BC)] public uint Unknown185;
    [FieldOffset(0x2C0)] public uint Unknown186;
    [FieldOffset(0x2C4)] public uint Unknown187;
    [FieldOffset(0x2C8)] public uint Unknown188;
    [FieldOffset(0x2CC)] public uint Unknown189;
    [FieldOffset(0x2D0)] public uint Unknown190;
    [FieldOffset(0x2D4)] public uint Unknown191;
    [FieldOffset(0x2D8)] public uint Unknown192;
    [FieldOffset(0x2DC)] public uint Unknown193;
    [FieldOffset(0x2E0)] public uint Unknown194;
    [FieldOffset(0x2E4)] public uint Unknown195;
    [FieldOffset(0x2E8)] public uint Unknown196;
    [FieldOffset(0x2EC)] public uint Unknown197;
    [FieldOffset(0x2F0)] public uint Unknown198;
    [FieldOffset(0x2F4)] public uint Unknown199;
    [FieldOffset(0x2F8)] public uint Unknown200;
    [FieldOffset(0x2FC)] public uint Unknown201;
    [FieldOffset(0x300)] public uint Unknown202;
    [FieldOffset(0x304)] public uint Unknown203;
    [FieldOffset(0x308)] public uint Unknown204;
    [FieldOffset(0x30C)] public uint Unknown205;
    [FieldOffset(0x310)] public uint Unknown206;
    [FieldOffset(0x314)] public uint Unknown207;
    [FieldOffset(0x318)] public uint Unknown208;
    [FieldOffset(0x31C)] public uint Unknown209;
    [FieldOffset(0x320)] public uint Unknown210;
    [FieldOffset(0x324)] public uint Unknown211;
    [FieldOffset(0x328)] public uint Unknown212;
    [FieldOffset(0x32C)] public uint Unknown213;
    [FieldOffset(0x330)] public uint Unknown214;
    [FieldOffset(0x334)] public uint Unknown215;
    [FieldOffset(0x338)] public uint Unknown216;
    [FieldOffset(0x33C)] public uint Unknown217;
    [FieldOffset(0x340)] public uint Unknown218;
    [FieldOffset(0x344)] public uint Unknown219;
    [FieldOffset(0x348)] public byte Unknown220;
    [FieldOffset(0x349)] public byte Unknown221;
    [FieldOffset(0x34A)] public byte Unknown222;
    [FieldOffset(0x34B)] public byte Unknown223;
    [FieldOffset(0x34C)] public byte Unknown224;
    [FieldOffset(0x34D)] public byte Unknown225;
    [FieldOffset(0x34E)] public byte Unknown226;
    [FieldOffset(0x34F)] public byte Unknown227;
    [FieldOffset(0x350)] public byte Unknown228;
    [FieldOffset(0x351)] public byte Unknown229;
    [FieldOffset(0x352)] public byte Unknown230;
    [FieldOffset(0x353)] public byte Unknown231;
    [FieldOffset(0x354)] public byte Unknown232;
    [FieldOffset(0x355)] public byte Unknown233;
    [FieldOffset(0x358)] public uint Unknown234;
    [FieldOffset(0x35C)] public uint Unknown235;
    [FieldOffset(0x360)] public uint Unknown236;
    [FieldOffset(0x364)] public uint Unknown237;
    [FieldOffset(0x368)] public uint Unknown238;
    [FieldOffset(0x36C)] public uint Unknown239;
    [FieldOffset(0x370)] public uint Unknown240;
    [FieldOffset(0x374)] public uint Unknown241;
    [FieldOffset(0x378)] public uint Unknown242;
    [FieldOffset(0x37C)] public uint Unknown243;
    [FieldOffset(0x380)] public uint Unknown244;
    [FieldOffset(0x384)] public uint Unknown245;
    [FieldOffset(0x388)] public uint Unknown246;
    [FieldOffset(0x38C)] public uint Unknown247;
    [FieldOffset(0x390)] public uint Unknown248;
    [FieldOffset(0x394)] public uint Unknown249;
    [FieldOffset(0x398)] public uint Unknown250;
    [FieldOffset(0x39C)] public uint Unknown251;
    [FieldOffset(0x3A0)] public uint Unknown252;
    [FieldOffset(0x3A4)] public uint Unknown253;
    [FieldOffset(0x3A8)] public uint Unknown254;
    [FieldOffset(0x3AC)] public uint Unknown255;
    [FieldOffset(0x3B0)] public uint Unknown256;
    [FieldOffset(0x3B4)] public uint Unknown257;
    [FieldOffset(0x3B8)] public uint Unknown258;
    [FieldOffset(0x3BC)] public uint Unknown259;
    [FieldOffset(0x3C0)] public uint Unknown260;
    [FieldOffset(0x3C4)] public uint Unknown261;
    [FieldOffset(0x3C8)] public uint Unknown262;
    [FieldOffset(0x3CC)] public uint Unknown263;
    [FieldOffset(0x3D0)] public uint Unknown264;
    [FieldOffset(0x3D4)] public uint Unknown265;
    [FieldOffset(0x3D8)] public uint Unknown266;
    [FieldOffset(0x3DC)] public uint Unknown267;
    [FieldOffset(0x3E0)] public uint Unknown268;
    [FieldOffset(0x3E4)] public uint Unknown269;
    [FieldOffset(0x3E8)] public uint Unknown270;
    [FieldOffset(0x3EC)] public uint Unknown271;
    [FieldOffset(0x3F0)] public uint Unknown272;
    [FieldOffset(0x3F4)] public uint Unknown273;
    [FieldOffset(0x3F8)] public uint Unknown274;
    [FieldOffset(0x3FC)] public uint Unknown275;
    [FieldOffset(0x400)] public uint Unknown276;
    [FieldOffset(0x404)] public uint Unknown277;
    [FieldOffset(0x408)] public uint Unknown278;
    [FieldOffset(0x40C)] public uint Unknown279;
    [FieldOffset(0x410)] public uint Unknown280;
    [FieldOffset(0x414)] public uint Unknown281;
    [FieldOffset(0x418)] public uint Unknown282;
    [FieldOffset(0x41C)] public uint Unknown283;
    [FieldOffset(0x420)] public uint Unknown284;
    [FieldOffset(0x424)] public uint Unknown285;
    [FieldOffset(0x428)] public uint Unknown286;
    [FieldOffset(0x42C)] public uint Unknown287;
    [FieldOffset(0x430)] public uint Unknown288;
    [FieldOffset(0x434)] public uint Unknown289;
    [FieldOffset(0x438)] public uint Unknown290;
    [FieldOffset(0x43C)] public uint Unknown291;
    [FieldOffset(0x440)] public uint Unknown292;
    [FieldOffset(0x444)] public uint Unknown293;
    [FieldOffset(0x448)] public uint Unknown294;
    [FieldOffset(0x44C)] public uint Unknown295;
    [FieldOffset(0x450)] public uint Unknown296;
    [FieldOffset(0x454)] public uint Unknown297;
    [FieldOffset(0x458)] public uint Unknown298;
    [FieldOffset(0x45C)] public uint Unknown299;
    [FieldOffset(0x460)] public uint Unknown300;
    [FieldOffset(0x464)] public uint Unknown301;
    [FieldOffset(0x468)] public uint Unknown302;
    [FieldOffset(0x46C)] public uint Unknown303;
    [FieldOffset(0x470)] public uint Unknown304;
    [FieldOffset(0x474)] public uint Unknown305;
    [FieldOffset(0x478)] public uint Unknown306;
    [FieldOffset(0x47C)] public uint Unknown307;
    [FieldOffset(0x480)] public uint Unknown308;
    [FieldOffset(0x484)] public uint Unknown309;
    [FieldOffset(0x488)] public uint Unknown310;
    [FieldOffset(0x48C)] public uint Unknown311;
    [FieldOffset(0x490)] public uint Unknown312;
    [FieldOffset(0x494)] public uint Unknown313;
    [FieldOffset(0x498)] public uint Unknown314;
    [FieldOffset(0x49C)] public uint Unknown315;
    [FieldOffset(0x4A0)] public uint Unknown316;
    [FieldOffset(0x4A4)] public uint Unknown317;
    [FieldOffset(0x4A8)] public uint Unknown318;
    [FieldOffset(0x4AC)] public uint Unknown319;
    [FieldOffset(0x4B0)] public uint Unknown320;
    [FieldOffset(0x4B4)] public uint Unknown321;
    [FieldOffset(0x4B8)] public uint Unknown322;
    [FieldOffset(0x4BC)] public uint Unknown323;
    [FieldOffset(0x4C0)] public uint Unknown324;
    [FieldOffset(0x4C4)] public uint Unknown325;
    [FieldOffset(0x4C8)] public uint Unknown326;
    [FieldOffset(0x4CC)] public uint Unknown327;
    [FieldOffset(0x4D0)] public uint Unknown328;
    [FieldOffset(0x4D4)] public uint Unknown329;
    [FieldOffset(0x4D8)] public uint Unknown330;
    [FieldOffset(0x4DC)] public uint Unknown331;
    [FieldOffset(0x4E0)] public uint Unknown332;
    [FieldOffset(0x4E4)] public uint Unknown333;
    [FieldOffset(0x4E8)] public uint Unknown334;
    [FieldOffset(0x4EC)] public uint Unknown335;
    [FieldOffset(0x4F0)] public uint Unknown336;
    [FieldOffset(0x4F4)] public byte Unknown337;
    [FieldOffset(0x4F5)] public byte Unknown338;
    [FieldOffset(0x4F6)] public byte Unknown339;
    [FieldOffset(0x4F7)] public byte Unknown340;
    [FieldOffset(0x4F8)] public byte Unknown341;
    [FieldOffset(0x4F9)] public byte Unknown342;
    [FieldOffset(0x4FA)] public byte Unknown343;
    [FieldOffset(0x4FB)] public byte Unknown344;
    [FieldOffset(0x4FC)] public byte Unknown345;
    [FieldOffset(0x4FD)] public byte Unknown346;
    [FieldOffset(0x4FE)] public byte Unknown347;
    [FieldOffset(0x4FF)] public byte Unknown348;
    [FieldOffset(0x500)] public byte Unknown349;
    [FieldOffset(0x501)] public byte Unknown350;
    [FieldOffset(0x504)] public uint Unknown351;
    [FieldOffset(0x508)] public uint Unknown352;
    [FieldOffset(0x50C)] public uint Unknown353;
    [FieldOffset(0x510)] public uint Unknown354;
    [FieldOffset(0x514)] public uint Unknown355;
    [FieldOffset(0x518)] public uint Unknown356;
    [FieldOffset(0x51C)] public uint Unknown357;
    [FieldOffset(0x520)] public uint Unknown358;
    [FieldOffset(0x524)] public uint Unknown359;
    [FieldOffset(0x528)] public uint Unknown360;
    [FieldOffset(0x52C)] public uint Unknown361;
    [FieldOffset(0x530)] public uint Unknown362;
    [FieldOffset(0x534)] public uint Unknown363;
    [FieldOffset(0x538)] public uint Unknown364;
    [FieldOffset(0x53C)] public uint Unknown365;
    [FieldOffset(0x540)] public uint Unknown366;
    [FieldOffset(0x544)] public uint Unknown367;
    [FieldOffset(0x548)] public uint Unknown368;
    [FieldOffset(0x54C)] public uint Unknown369;
    [FieldOffset(0x550)] public uint Unknown370;
    [FieldOffset(0x554)] public uint Unknown371;
    [FieldOffset(0x558)] public uint Unknown372;
    [FieldOffset(0x55C)] public uint Unknown373;
    [FieldOffset(0x560)] public uint Unknown374;
    [FieldOffset(0x564)] public uint Unknown375;
    [FieldOffset(0x568)] public uint Unknown376;
    [FieldOffset(0x56C)] public uint Unknown377;
    [FieldOffset(0x570)] public uint Unknown378;
    [FieldOffset(0x574)] public uint Unknown379;
    [FieldOffset(0x578)] public uint Unknown380;
    [FieldOffset(0x57C)] public uint Unknown381;
    [FieldOffset(0x580)] public uint Unknown382;
    [FieldOffset(0x584)] public uint Unknown383;
    [FieldOffset(0x588)] public uint Unknown384;
    [FieldOffset(0x58C)] public uint Unknown385;
    [FieldOffset(0x590)] public uint Unknown386;
    [FieldOffset(0x594)] public uint Unknown387;
    [FieldOffset(0x598)] public uint Unknown388;
    [FieldOffset(0x59C)] public uint Unknown389;
    [FieldOffset(0x5A0)] public uint Unknown390;
    [FieldOffset(0x5A4)] public uint Unknown391;
    [FieldOffset(0x5A8)] public uint Unknown392;
    [FieldOffset(0x5AC)] public uint Unknown393;
    [FieldOffset(0x5B0)] public uint Unknown394;
    [FieldOffset(0x5B4)] public uint Unknown395;
    [FieldOffset(0x5B8)] public uint Unknown396;
    [FieldOffset(0x5BC)] public uint Unknown397;
    [FieldOffset(0x5C0)] public uint Unknown398;
    [FieldOffset(0x5C4)] public uint Unknown399;
    [FieldOffset(0x5C8)] public uint Unknown400;
    [FieldOffset(0x5CC)] public uint Unknown401;
    [FieldOffset(0x5D0)] public uint Unknown402;
    [FieldOffset(0x5D4)] public uint Unknown403;
    [FieldOffset(0x5D8)] public uint Unknown404;
    [FieldOffset(0x5DC)] public uint Unknown405;
    [FieldOffset(0x5E0)] public uint Unknown406;
    [FieldOffset(0x5E4)] public uint Unknown407;
    [FieldOffset(0x5E8)] public uint Unknown408;
    [FieldOffset(0x5EC)] public uint Unknown409;
    [FieldOffset(0x5F0)] public uint Unknown410;
    [FieldOffset(0x5F4)] public uint Unknown411;
    [FieldOffset(0x5F8)] public uint Unknown412;
    [FieldOffset(0x5FC)] public uint Unknown413;
    [FieldOffset(0x600)] public uint Unknown414;
    [FieldOffset(0x604)] public uint Unknown415;
    [FieldOffset(0x608)] public uint Unknown416;
    [FieldOffset(0x60C)] public uint Unknown417;
    [FieldOffset(0x610)] public uint Unknown418;
    [FieldOffset(0x614)] public uint Unknown419;
    [FieldOffset(0x618)] public uint Unknown420;
    [FieldOffset(0x61C)] public uint Unknown421;
    [FieldOffset(0x620)] public uint Unknown422;
    [FieldOffset(0x624)] public uint Unknown423;
    [FieldOffset(0x628)] public uint Unknown424;
    [FieldOffset(0x62C)] public uint Unknown425;
    [FieldOffset(0x630)] public uint Unknown426;
    [FieldOffset(0x634)] public uint Unknown427;
    [FieldOffset(0x638)] public uint Unknown428;
    [FieldOffset(0x63C)] public uint Unknown429;
    [FieldOffset(0x640)] public uint Unknown430;
    [FieldOffset(0x644)] public uint Unknown431;
    [FieldOffset(0x648)] public uint Unknown432;
    [FieldOffset(0x64C)] public uint Unknown433;
    [FieldOffset(0x650)] public uint Unknown434;
    [FieldOffset(0x654)] public uint Unknown435;
    [FieldOffset(0x658)] public uint Unknown436;
    [FieldOffset(0x65C)] public uint Unknown437;
    [FieldOffset(0x660)] public uint Unknown438;
    [FieldOffset(0x664)] public uint Unknown439;
    [FieldOffset(0x668)] public uint Unknown440;
    [FieldOffset(0x66C)] public uint Unknown441;
    [FieldOffset(0x670)] public uint Unknown442;
    [FieldOffset(0x674)] public uint Unknown443;
    [FieldOffset(0x678)] public uint Unknown444;
    [FieldOffset(0x67C)] public uint Unknown445;
    [FieldOffset(0x680)] public uint Unknown446;
    [FieldOffset(0x684)] public uint Unknown447;
    [FieldOffset(0x688)] public uint Unknown448;
    [FieldOffset(0x68C)] public uint Unknown449;
    [FieldOffset(0x690)] public uint Unknown450;
    [FieldOffset(0x694)] public uint Unknown451;
    [FieldOffset(0x698)] public uint Unknown452;
    [FieldOffset(0x69C)] public uint Unknown453;
    [FieldOffset(0x6A0)] public byte Unknown454;
    [FieldOffset(0x6A1)] public byte Unknown455;
    [FieldOffset(0x6A2)] public byte Unknown456;
    [FieldOffset(0x6A3)] public byte Unknown457;
    [FieldOffset(0x6A4)] public byte Unknown458;
    [FieldOffset(0x6A5)] public byte Unknown459;
    [FieldOffset(0x6A6)] public byte Unknown460;
    [FieldOffset(0x6A7)] public byte Unknown461;
    [FieldOffset(0x6A8)] public byte Unknown462;
    [FieldOffset(0x6A9)] public byte Unknown463;
    [FieldOffset(0x6AA)] public byte Unknown464;
    [FieldOffset(0x6AB)] public byte Unknown465;
    [FieldOffset(0x6AC)] public byte Unknown466;
    [FieldOffset(0x6AD)] public byte Unknown467;
    [FieldOffset(0x6B0)] public uint Unknown468;
    [FieldOffset(0x6B4)] public uint Unknown469;
    [FieldOffset(0x6B8)] public uint Unknown470;
    [FieldOffset(0x6BC)] public uint Unknown471;
    [FieldOffset(0x6C0)] public uint Unknown472;
    [FieldOffset(0x6C4)] public uint Unknown473;
    [FieldOffset(0x6C8)] public uint Unknown474;
    [FieldOffset(0x6CC)] public uint Unknown475;
    [FieldOffset(0x6D0)] public uint Unknown476;
    [FieldOffset(0x6D4)] public uint Unknown477;
    [FieldOffset(0x6D8)] public uint Unknown478;
    [FieldOffset(0x6DC)] public uint Unknown479;
    [FieldOffset(0x6E0)] public uint Unknown480;
    [FieldOffset(0x6E4)] public uint Unknown481;
    [FieldOffset(0x6E8)] public uint Unknown482;
    [FieldOffset(0x6EC)] public uint Unknown483;
    [FieldOffset(0x6F0)] public uint Unknown484;
    [FieldOffset(0x6F4)] public uint Unknown485;
    [FieldOffset(0x6F8)] public uint Unknown486;
    [FieldOffset(0x6FC)] public uint Unknown487;
    [FieldOffset(0x700)] public uint Unknown488;
    [FieldOffset(0x704)] public uint Unknown489;
    [FieldOffset(0x708)] public uint Unknown490;
    [FieldOffset(0x70C)] public uint Unknown491;
    [FieldOffset(0x710)] public uint Unknown492;
    [FieldOffset(0x714)] public uint Unknown493;
    [FieldOffset(0x718)] public uint Unknown494;
    [FieldOffset(0x71C)] public uint Unknown495;
    [FieldOffset(0x720)] public uint Unknown496;
    [FieldOffset(0x724)] public uint Unknown497;
    [FieldOffset(0x728)] public uint Unknown498;
    [FieldOffset(0x72C)] public uint Unknown499;
    [FieldOffset(0x730)] public uint Unknown500;
    [FieldOffset(0x734)] public uint Unknown501;
    [FieldOffset(0x738)] public uint Unknown502;
    [FieldOffset(0x73C)] public uint Unknown503;
    [FieldOffset(0x740)] public uint Unknown504;
    [FieldOffset(0x744)] public uint Unknown505;
    [FieldOffset(0x748)] public uint Unknown506;
    [FieldOffset(0x74C)] public uint Unknown507;
    [FieldOffset(0x750)] public uint Unknown508;
    [FieldOffset(0x754)] public uint Unknown509;
    [FieldOffset(0x758)] public uint Unknown510;
    [FieldOffset(0x75C)] public uint Unknown511;
    [FieldOffset(0x760)] public uint Unknown512;
    [FieldOffset(0x764)] public uint Unknown513;
    [FieldOffset(0x768)] public uint Unknown514;
    [FieldOffset(0x76C)] public uint Unknown515;
    [FieldOffset(0x770)] public uint Unknown516;
    [FieldOffset(0x774)] public uint Unknown517;
    [FieldOffset(0x778)] public uint Unknown518;
    [FieldOffset(0x77C)] public uint Unknown519;
    [FieldOffset(0x780)] public uint Unknown520;
    [FieldOffset(0x784)] public uint Unknown521;
    [FieldOffset(0x788)] public uint Unknown522;
    [FieldOffset(0x78C)] public uint Unknown523;
    [FieldOffset(0x790)] public uint Unknown524;
    [FieldOffset(0x794)] public uint Unknown525;
    [FieldOffset(0x798)] public uint Unknown526;
    [FieldOffset(0x79C)] public uint Unknown527;
    [FieldOffset(0x7A0)] public uint Unknown528;
    [FieldOffset(0x7A4)] public uint Unknown529;
    [FieldOffset(0x7A8)] public uint Unknown530;
    [FieldOffset(0x7AC)] public uint Unknown531;
    [FieldOffset(0x7B0)] public uint Unknown532;
    [FieldOffset(0x7B4)] public uint Unknown533;
    [FieldOffset(0x7B8)] public uint Unknown534;
    [FieldOffset(0x7BC)] public uint Unknown535;
    [FieldOffset(0x7C0)] public uint Unknown536;
    [FieldOffset(0x7C4)] public uint Unknown537;
    [FieldOffset(0x7C8)] public uint Unknown538;
    [FieldOffset(0x7CC)] public uint Unknown539;
    [FieldOffset(0x7D0)] public uint Unknown540;
    [FieldOffset(0x7D4)] public uint Unknown541;
    [FieldOffset(0x7D8)] public uint Unknown542;
    [FieldOffset(0x7DC)] public uint Unknown543;
    [FieldOffset(0x7E0)] public uint Unknown544;
    [FieldOffset(0x7E4)] public uint Unknown545;
    [FieldOffset(0x7E8)] public uint Unknown546;
    [FieldOffset(0x7EC)] public uint Unknown547;
    [FieldOffset(0x7F0)] public uint Unknown548;
    [FieldOffset(0x7F4)] public uint Unknown549;
    [FieldOffset(0x7F8)] public uint Unknown550;
    [FieldOffset(0x7FC)] public uint Unknown551;
    [FieldOffset(0x800)] public uint Unknown552;
    [FieldOffset(0x804)] public uint Unknown553;
    [FieldOffset(0x808)] public uint Unknown554;
    [FieldOffset(0x80C)] public uint Unknown555;
    [FieldOffset(0x810)] public uint Unknown556;
    [FieldOffset(0x814)] public uint Unknown557;
    [FieldOffset(0x818)] public uint Unknown558;
    [FieldOffset(0x81C)] public uint Unknown559;
    [FieldOffset(0x820)] public uint Unknown560;
    [FieldOffset(0x824)] public uint Unknown561;
    [FieldOffset(0x828)] public uint Unknown562;
    [FieldOffset(0x82C)] public uint Unknown563;
    [FieldOffset(0x830)] public uint Unknown564;
    [FieldOffset(0x834)] public uint Unknown565;
    [FieldOffset(0x838)] public uint Unknown566;
    [FieldOffset(0x83C)] public uint Unknown567;
    [FieldOffset(0x840)] public uint Unknown568;
    [FieldOffset(0x844)] public uint Unknown569;
    [FieldOffset(0x848)] public uint Unknown570;
    [FieldOffset(0x84C)] public byte Unknown571;
    [FieldOffset(0x84D)] public byte Unknown572;
    [FieldOffset(0x84E)] public byte Unknown573;
    [FieldOffset(0x84F)] public byte Unknown574;
    [FieldOffset(0x850)] public byte Unknown575;
    [FieldOffset(0x851)] public byte Unknown576;
    [FieldOffset(0x852)] public byte Unknown577;
    [FieldOffset(0x853)] public byte Unknown578;
    [FieldOffset(0x854)] public byte Unknown579;
    [FieldOffset(0x855)] public byte Unknown580;
    [FieldOffset(0x856)] public byte Unknown581;
    [FieldOffset(0x857)] public byte Unknown582;
    [FieldOffset(0x858)] public byte Unknown583;
    [FieldOffset(0x859)] public byte Unknown584;
    [FieldOffset(0x85C)] public uint Unknown585;
    [FieldOffset(0x860)] public uint Unknown586;
    [FieldOffset(0x864)] public uint Unknown587;
    [FieldOffset(0x868)] public uint Unknown588;
    [FieldOffset(0x86C)] public uint Unknown589;
    [FieldOffset(0x870)] public uint Unknown590;
    [FieldOffset(0x874)] public uint Unknown591;
    [FieldOffset(0x878)] public uint Unknown592;
    [FieldOffset(0x87C)] public uint Unknown593;
    [FieldOffset(0x880)] public uint Unknown594;
    [FieldOffset(0x884)] public uint Unknown595;
    [FieldOffset(0x888)] public uint Unknown596;
    [FieldOffset(0x88C)] public uint Unknown597;
    [FieldOffset(0x890)] public uint Unknown598;
    [FieldOffset(0x894)] public uint Unknown599;
    [FieldOffset(0x898)] public uint Unknown600;
    [FieldOffset(0x89C)] public uint Unknown601;
    [FieldOffset(0x8A0)] public uint Unknown602;
    [FieldOffset(0x8A4)] public uint Unknown603;
    [FieldOffset(0x8A8)] public uint Unknown604;
    [FieldOffset(0x8AC)] public uint Unknown605;
    [FieldOffset(0x8B0)] public uint Unknown606;
    [FieldOffset(0x8B4)] public uint Unknown607;
    [FieldOffset(0x8B8)] public uint Unknown608;
    [FieldOffset(0x8BC)] public uint Unknown609;
    [FieldOffset(0x8C0)] public uint Unknown610;
    [FieldOffset(0x8C4)] public uint Unknown611;
    [FieldOffset(0x8C8)] public uint Unknown612;
    [FieldOffset(0x8CC)] public uint Unknown613;
    [FieldOffset(0x8D0)] public uint Unknown614;
    [FieldOffset(0x8D4)] public uint Unknown615;
    [FieldOffset(0x8D8)] public uint Unknown616;
    [FieldOffset(0x8DC)] public uint Unknown617;
    [FieldOffset(0x8E0)] public uint Unknown618;
    [FieldOffset(0x8E4)] public uint Unknown619;
    [FieldOffset(0x8E8)] public uint Unknown620;
    [FieldOffset(0x8EC)] public uint Unknown621;
    [FieldOffset(0x8F0)] public uint Unknown622;
    [FieldOffset(0x8F4)] public uint Unknown623;
    [FieldOffset(0x8F8)] public uint Unknown624;
    [FieldOffset(0x8FC)] public uint Unknown625;
    [FieldOffset(0x900)] public uint Unknown626;
    [FieldOffset(0x904)] public uint Unknown627;
    [FieldOffset(0x908)] public uint Unknown628;
    [FieldOffset(0x90C)] public uint Unknown629;
    [FieldOffset(0x910)] public uint Unknown630;
    [FieldOffset(0x914)] public uint Unknown631;
    [FieldOffset(0x918)] public uint Unknown632;
    [FieldOffset(0x91C)] public uint Unknown633;
    [FieldOffset(0x920)] public uint Unknown634;
    [FieldOffset(0x924)] public uint Unknown635;
    [FieldOffset(0x928)] public uint Unknown636;
    [FieldOffset(0x92C)] public uint Unknown637;
    [FieldOffset(0x930)] public uint Unknown638;
    [FieldOffset(0x934)] public uint Unknown639;
    [FieldOffset(0x938)] public uint Unknown640;
    [FieldOffset(0x93C)] public uint Unknown641;
    [FieldOffset(0x940)] public uint Unknown642;
    [FieldOffset(0x944)] public uint Unknown643;
    [FieldOffset(0x948)] public uint Unknown644;
    [FieldOffset(0x94C)] public uint Unknown645;
    [FieldOffset(0x950)] public uint Unknown646;
    [FieldOffset(0x954)] public uint Unknown647;
    [FieldOffset(0x958)] public uint Unknown648;
    [FieldOffset(0x95C)] public uint Unknown649;
    [FieldOffset(0x960)] public uint Unknown650;
    [FieldOffset(0x964)] public uint Unknown651;
    [FieldOffset(0x968)] public uint Unknown652;
    [FieldOffset(0x96C)] public uint Unknown653;
    [FieldOffset(0x970)] public uint Unknown654;
    [FieldOffset(0x974)] public uint Unknown655;
    [FieldOffset(0x978)] public uint Unknown656;
    [FieldOffset(0x97C)] public uint Unknown657;
    [FieldOffset(0x980)] public uint Unknown658;
    [FieldOffset(0x984)] public uint Unknown659;
    [FieldOffset(0x988)] public uint Unknown660;
    [FieldOffset(0x98C)] public uint Unknown661;
    [FieldOffset(0x990)] public uint Unknown662;
    [FieldOffset(0x994)] public uint Unknown663;
    [FieldOffset(0x998)] public uint Unknown664;
    [FieldOffset(0x99C)] public uint Unknown665;
    [FieldOffset(0x9A0)] public uint Unknown666;
    [FieldOffset(0x9A4)] public uint Unknown667;
    [FieldOffset(0x9A8)] public uint Unknown668;
    [FieldOffset(0x9AC)] public uint Unknown669;
    [FieldOffset(0x9B0)] public uint Unknown670;
    [FieldOffset(0x9B4)] public uint Unknown671;
    [FieldOffset(0x9B8)] public uint Unknown672;
    [FieldOffset(0x9BC)] public uint Unknown673;
    [FieldOffset(0x9C0)] public uint Unknown674;
    [FieldOffset(0x9C4)] public uint Unknown675;
    [FieldOffset(0x9C8)] public uint Unknown676;
    [FieldOffset(0x9CC)] public uint Unknown677;
    [FieldOffset(0x9D0)] public uint Unknown678;
    [FieldOffset(0x9D4)] public uint Unknown679;
    [FieldOffset(0x9D8)] public uint Unknown680;
    [FieldOffset(0x9DC)] public uint Unknown681;
    [FieldOffset(0x9E0)] public uint Unknown682;
    [FieldOffset(0x9E4)] public uint Unknown683;
    [FieldOffset(0x9E8)] public uint Unknown684;
    [FieldOffset(0x9EC)] public uint Unknown685;
    [FieldOffset(0x9F0)] public uint Unknown686;
    [FieldOffset(0x9F4)] public uint Unknown687;
    [FieldOffset(0x9F8)] public byte Unknown688;
    [FieldOffset(0x9F9)] public byte Unknown689;
    [FieldOffset(0x9FA)] public byte Unknown690;
    [FieldOffset(0x9FB)] public byte Unknown691;
    [FieldOffset(0x9FC)] public byte Unknown692;
    [FieldOffset(0x9FD)] public byte Unknown693;
    [FieldOffset(0x9FE)] public byte Unknown694;
    [FieldOffset(0x9FF)] public byte Unknown695;
    [FieldOffset(0xA00)] public byte Unknown696;
    [FieldOffset(0xA01)] public byte Unknown697;
    [FieldOffset(0xA02)] public byte Unknown698;
    [FieldOffset(0xA03)] public byte Unknown699;
    [FieldOffset(0xA04)] public byte Unknown700;
    [FieldOffset(0xA05)] public byte Unknown701;
    [FieldOffset(0xA08)] public uint Unknown702;
    [FieldOffset(0xA0C)] public uint Unknown703;
    [FieldOffset(0xA10)] public uint Unknown704;
    [FieldOffset(0xA14)] public uint Unknown705;
    [FieldOffset(0xA18)] public uint Unknown706;
    [FieldOffset(0xA1C)] public uint Unknown707;
    [FieldOffset(0xA20)] public uint Unknown708;
    [FieldOffset(0xA24)] public uint Unknown709;
    [FieldOffset(0xA28)] public uint Unknown710;
    [FieldOffset(0xA2C)] public uint Unknown711;
    [FieldOffset(0xA30)] public uint Unknown712;
    [FieldOffset(0xA34)] public uint Unknown713;
    [FieldOffset(0xA38)] public uint Unknown714;
    [FieldOffset(0xA3C)] public uint Unknown715;
    [FieldOffset(0xA40)] public uint Unknown716;
    [FieldOffset(0xA44)] public uint Unknown717;
    [FieldOffset(0xA48)] public uint Unknown718;
    [FieldOffset(0xA4C)] public uint Unknown719;
    [FieldOffset(0xA50)] public uint Unknown720;
    [FieldOffset(0xA54)] public uint Unknown721;
    [FieldOffset(0xA58)] public uint Unknown722;
    [FieldOffset(0xA5C)] public uint Unknown723;
    [FieldOffset(0xA60)] public uint Unknown724;
    [FieldOffset(0xA64)] public uint Unknown725;
    [FieldOffset(0xA68)] public uint Unknown726;
    [FieldOffset(0xA6C)] public uint Unknown727;
    [FieldOffset(0xA70)] public uint Unknown728;
    [FieldOffset(0xA74)] public uint Unknown729;
    [FieldOffset(0xA78)] public uint Unknown730;
    [FieldOffset(0xA7C)] public uint Unknown731;
    [FieldOffset(0xA80)] public uint Unknown732;
    [FieldOffset(0xA84)] public uint Unknown733;
    [FieldOffset(0xA88)] public uint Unknown734;
    [FieldOffset(0xA8C)] public uint Unknown735;
    [FieldOffset(0xA90)] public uint Unknown736;
    [FieldOffset(0xA94)] public uint Unknown737;
    [FieldOffset(0xA98)] public uint Unknown738;
    [FieldOffset(0xA9C)] public uint Unknown739;
    [FieldOffset(0xAA0)] public uint Unknown740;
    [FieldOffset(0xAA4)] public uint Unknown741;
    [FieldOffset(0xAA8)] public uint Unknown742;
    [FieldOffset(0xAAC)] public uint Unknown743;
    [FieldOffset(0xAB0)] public uint Unknown744;
    [FieldOffset(0xAB4)] public uint Unknown745;
    [FieldOffset(0xAB8)] public uint Unknown746;
    [FieldOffset(0xABC)] public uint Unknown747;
    [FieldOffset(0xAC0)] public uint Unknown748;
    [FieldOffset(0xAC4)] public uint Unknown749;
    [FieldOffset(0xAC8)] public uint Unknown750;
    [FieldOffset(0xACC)] public uint Unknown751;
    [FieldOffset(0xAD0)] public uint Unknown752;
    [FieldOffset(0xAD4)] public uint Unknown753;
    [FieldOffset(0xAD8)] public uint Unknown754;
    [FieldOffset(0xADC)] public uint Unknown755;
    [FieldOffset(0xAE0)] public uint Unknown756;
    [FieldOffset(0xAE4)] public uint Unknown757;
    [FieldOffset(0xAE8)] public uint Unknown758;
    [FieldOffset(0xAEC)] public uint Unknown759;
    [FieldOffset(0xAF0)] public uint Unknown760;
    [FieldOffset(0xAF4)] public uint Unknown761;
    [FieldOffset(0xAF8)] public uint Unknown762;
    [FieldOffset(0xAFC)] public uint Unknown763;
    [FieldOffset(0xB00)] public uint Unknown764;
    [FieldOffset(0xB04)] public uint Unknown765;
    [FieldOffset(0xB08)] public uint Unknown766;
    [FieldOffset(0xB0C)] public uint Unknown767;
    [FieldOffset(0xB10)] public uint Unknown768;
    [FieldOffset(0xB14)] public uint Unknown769;
    [FieldOffset(0xB18)] public uint Unknown770;
    [FieldOffset(0xB1C)] public uint Unknown771;
    [FieldOffset(0xB20)] public uint Unknown772;
    [FieldOffset(0xB24)] public uint Unknown773;
    [FieldOffset(0xB28)] public uint Unknown774;
    [FieldOffset(0xB2C)] public uint Unknown775;
    [FieldOffset(0xB30)] public uint Unknown776;
    [FieldOffset(0xB34)] public uint Unknown777;
    [FieldOffset(0xB38)] public uint Unknown778;
    [FieldOffset(0xB3C)] public uint Unknown779;
    [FieldOffset(0xB40)] public uint Unknown780;
    [FieldOffset(0xB44)] public uint Unknown781;
    [FieldOffset(0xB48)] public uint Unknown782;
    [FieldOffset(0xB4C)] public uint Unknown783;
    [FieldOffset(0xB50)] public uint Unknown784;
    [FieldOffset(0xB54)] public uint Unknown785;
    [FieldOffset(0xB58)] public uint Unknown786;
    [FieldOffset(0xB5C)] public uint Unknown787;
    [FieldOffset(0xB60)] public uint Unknown788;
    [FieldOffset(0xB64)] public uint Unknown789;
    [FieldOffset(0xB68)] public uint Unknown790;
    [FieldOffset(0xB6C)] public uint Unknown791;
    [FieldOffset(0xB70)] public uint Unknown792;
    [FieldOffset(0xB74)] public uint Unknown793;
    [FieldOffset(0xB78)] public uint Unknown794;
    [FieldOffset(0xB7C)] public uint Unknown795;
    [FieldOffset(0xB80)] public uint Unknown796;
    [FieldOffset(0xB84)] public uint Unknown797;
    [FieldOffset(0xB88)] public uint Unknown798;
    [FieldOffset(0xB8C)] public uint Unknown799;
    [FieldOffset(0xB90)] public uint Unknown800;
    [FieldOffset(0xB94)] public uint Unknown801;
    [FieldOffset(0xB98)] public uint Unknown802;
    [FieldOffset(0xB9C)] public uint Unknown803;
    [FieldOffset(0xBA0)] public uint Unknown804;
    [FieldOffset(0xBA4)] public byte Unknown805;
    [FieldOffset(0xBA5)] public byte Unknown806;
    [FieldOffset(0xBA6)] public byte Unknown807;
    [FieldOffset(0xBA7)] public byte Unknown808;
    [FieldOffset(0xBA8)] public byte Unknown809;
    [FieldOffset(0xBA9)] public byte Unknown810;
    [FieldOffset(0xBAA)] public byte Unknown811;
    [FieldOffset(0xBAB)] public byte Unknown812;
    [FieldOffset(0xBAC)] public byte Unknown813;
    [FieldOffset(0xBAD)] public byte Unknown814;
    [FieldOffset(0xBAE)] public byte Unknown815;
    [FieldOffset(0xBAF)] public byte Unknown816;
    [FieldOffset(0xBB0)] public byte Unknown817;
    [FieldOffset(0xBB1)] public byte Unknown818;
    [FieldOffset(0xBB4)] public uint Unknown819;
    [FieldOffset(0xBB8)] public uint Unknown820;
    [FieldOffset(0xBBC)] public uint Unknown821;
    [FieldOffset(0xBC0)] public uint Unknown822;
    [FieldOffset(0xBC4)] public uint Unknown823;
    [FieldOffset(0xBC8)] public uint Unknown824;
    [FieldOffset(0xBCC)] public uint Unknown825;
    [FieldOffset(0xBD0)] public uint Unknown826;
    [FieldOffset(0xBD4)] public uint Unknown827;
    [FieldOffset(0xBD8)] public uint Unknown828;
    [FieldOffset(0xBDC)] public uint Unknown829;
    [FieldOffset(0xBE0)] public uint Unknown830;
    [FieldOffset(0xBE4)] public uint Unknown831;
    [FieldOffset(0xBE8)] public uint Unknown832;
    [FieldOffset(0xBEC)] public uint Unknown833;
    [FieldOffset(0xBF0)] public uint Unknown834;
    [FieldOffset(0xBF4)] public uint Unknown835;
    [FieldOffset(0xBF8)] public uint Unknown836;
    [FieldOffset(0xBFC)] public uint Unknown837;
    [FieldOffset(0xC00)] public uint Unknown838;
    [FieldOffset(0xC04)] public uint Unknown839;
    [FieldOffset(0xC08)] public uint Unknown840;
    [FieldOffset(0xC0C)] public uint Unknown841;
    [FieldOffset(0xC10)] public uint Unknown842;
    [FieldOffset(0xC14)] public uint Unknown843;
    [FieldOffset(0xC18)] public uint Unknown844;
    [FieldOffset(0xC1C)] public uint Unknown845;
    [FieldOffset(0xC20)] public uint Unknown846;
    [FieldOffset(0xC24)] public uint Unknown847;
    [FieldOffset(0xC28)] public uint Unknown848;
    [FieldOffset(0xC2C)] public uint Unknown849;
    [FieldOffset(0xC30)] public uint Unknown850;
    [FieldOffset(0xC34)] public uint Unknown851;
    [FieldOffset(0xC38)] public uint Unknown852;
    [FieldOffset(0xC3C)] public uint Unknown853;
    [FieldOffset(0xC40)] public uint Unknown854;
    [FieldOffset(0xC44)] public uint Unknown855;
    [FieldOffset(0xC48)] public uint Unknown856;
    [FieldOffset(0xC4C)] public uint Unknown857;
    [FieldOffset(0xC50)] public uint Unknown858;
    [FieldOffset(0xC54)] public uint Unknown859;
    [FieldOffset(0xC58)] public uint Unknown860;
    [FieldOffset(0xC5C)] public uint Unknown861;
    [FieldOffset(0xC60)] public uint Unknown862;
    [FieldOffset(0xC64)] public uint Unknown863;
    [FieldOffset(0xC68)] public uint Unknown864;
    [FieldOffset(0xC6C)] public uint Unknown865;
    [FieldOffset(0xC70)] public uint Unknown866;
    [FieldOffset(0xC74)] public uint Unknown867;
    [FieldOffset(0xC78)] public uint Unknown868;
    [FieldOffset(0xC7C)] public uint Unknown869;
    [FieldOffset(0xC80)] public uint Unknown870;
    [FieldOffset(0xC84)] public uint Unknown871;
    [FieldOffset(0xC88)] public uint Unknown872;
    [FieldOffset(0xC8C)] public uint Unknown873;
    [FieldOffset(0xC90)] public uint Unknown874;
    [FieldOffset(0xC94)] public uint Unknown875;
    [FieldOffset(0xC98)] public uint Unknown876;
    [FieldOffset(0xC9C)] public uint Unknown877;
    [FieldOffset(0xCA0)] public uint Unknown878;
    [FieldOffset(0xCA4)] public uint Unknown879;
    [FieldOffset(0xCA8)] public uint Unknown880;
    [FieldOffset(0xCAC)] public uint Unknown881;
    [FieldOffset(0xCB0)] public uint Unknown882;
    [FieldOffset(0xCB4)] public uint Unknown883;
    [FieldOffset(0xCB8)] public uint Unknown884;
    [FieldOffset(0xCBC)] public uint Unknown885;
    [FieldOffset(0xCC0)] public uint Unknown886;
    [FieldOffset(0xCC4)] public uint Unknown887;
    [FieldOffset(0xCC8)] public uint Unknown888;
    [FieldOffset(0xCCC)] public uint Unknown889;
    [FieldOffset(0xCD0)] public uint Unknown890;
    [FieldOffset(0xCD4)] public uint Unknown891;
    [FieldOffset(0xCD8)] public uint Unknown892;
    [FieldOffset(0xCDC)] public uint Unknown893;
    [FieldOffset(0xCE0)] public uint Unknown894;
    [FieldOffset(0xCE4)] public uint Unknown895;
    [FieldOffset(0xCE8)] public uint Unknown896;
    [FieldOffset(0xCEC)] public uint Unknown897;
    [FieldOffset(0xCF0)] public uint Unknown898;
    [FieldOffset(0xCF4)] public uint Unknown899;
    [FieldOffset(0xCF8)] public uint Unknown900;
    [FieldOffset(0xCFC)] public uint Unknown901;
    [FieldOffset(0xD00)] public uint Unknown902;
    [FieldOffset(0xD04)] public uint Unknown903;
    [FieldOffset(0xD08)] public uint Unknown904;
    [FieldOffset(0xD0C)] public uint Unknown905;
    [FieldOffset(0xD10)] public uint Unknown906;
    [FieldOffset(0xD14)] public uint Unknown907;
    [FieldOffset(0xD18)] public uint Unknown908;
    [FieldOffset(0xD1C)] public uint Unknown909;
    [FieldOffset(0xD20)] public uint Unknown910;
    [FieldOffset(0xD24)] public uint Unknown911;
    [FieldOffset(0xD28)] public uint Unknown912;
    [FieldOffset(0xD2C)] public uint Unknown913;
    [FieldOffset(0xD30)] public uint Unknown914;
    [FieldOffset(0xD34)] public uint Unknown915;
    [FieldOffset(0xD38)] public uint Unknown916;
    [FieldOffset(0xD3C)] public uint Unknown917;
    [FieldOffset(0xD40)] public uint Unknown918;
    [FieldOffset(0xD44)] public uint Unknown919;
    [FieldOffset(0xD48)] public uint Unknown920;
    [FieldOffset(0xD4C)] public uint Unknown921;
    [FieldOffset(0xD50)] public byte Unknown922;
    [FieldOffset(0xD51)] public byte Unknown923;
    [FieldOffset(0xD52)] public byte Unknown924;
    [FieldOffset(0xD53)] public byte Unknown925;
    [FieldOffset(0xD54)] public byte Unknown926;
    [FieldOffset(0xD55)] public byte Unknown927;
    [FieldOffset(0xD56)] public byte Unknown928;
    [FieldOffset(0xD57)] public byte Unknown929;
    [FieldOffset(0xD58)] public byte Unknown930;
    [FieldOffset(0xD59)] public byte Unknown931;
    [FieldOffset(0xD5A)] public byte Unknown932;
    [FieldOffset(0xD5B)] public byte Unknown933;
    [FieldOffset(0xD5C)] public byte Unknown934;
    [FieldOffset(0xD5D)] public byte Unknown935;
    [FieldOffset(0xD60)] public uint Unknown936;
    [FieldOffset(0xD64)] public uint Unknown937;
    [FieldOffset(0xD68)] public uint Unknown938;
    [FieldOffset(0xD6C)] public uint Unknown939;
    [FieldOffset(0xD70)] public uint Unknown940;
    [FieldOffset(0xD74)] public uint Unknown941;
    [FieldOffset(0xD78)] public uint Unknown942;
    [FieldOffset(0xD7C)] public uint Unknown943;
    [FieldOffset(0xD80)] public uint Unknown944;
    [FieldOffset(0xD84)] public uint Unknown945;
    [FieldOffset(0xD88)] public uint Unknown946;
    [FieldOffset(0xD8C)] public uint Unknown947;
    [FieldOffset(0xD90)] public uint Unknown948;
    [FieldOffset(0xD94)] public uint Unknown949;
    [FieldOffset(0xD98)] public uint Unknown950;
    [FieldOffset(0xD9C)] public uint Unknown951;
    [FieldOffset(0xDA0)] public uint Unknown952;
    [FieldOffset(0xDA4)] public uint Unknown953;
    [FieldOffset(0xDA8)] public uint Unknown954;
    [FieldOffset(0xDAC)] public uint Unknown955;
    [FieldOffset(0xDB0)] public uint Unknown956;
    [FieldOffset(0xDB4)] public uint Unknown957;
    [FieldOffset(0xDB8)] public uint Unknown958;
    [FieldOffset(0xDBC)] public uint Unknown959;
    [FieldOffset(0xDC0)] public uint Unknown960;
    [FieldOffset(0xDC4)] public uint Unknown961;
    [FieldOffset(0xDC8)] public uint Unknown962;
    [FieldOffset(0xDCC)] public uint Unknown963;
    [FieldOffset(0xDD0)] public uint Unknown964;
    [FieldOffset(0xDD4)] public uint Unknown965;
    [FieldOffset(0xDD8)] public uint Unknown966;
    [FieldOffset(0xDDC)] public uint Unknown967;
    [FieldOffset(0xDE0)] public uint Unknown968;
    [FieldOffset(0xDE4)] public uint Unknown969;
    [FieldOffset(0xDE8)] public uint Unknown970;
    [FieldOffset(0xDEC)] public uint Unknown971;
    [FieldOffset(0xDF0)] public uint Unknown972;
    [FieldOffset(0xDF4)] public uint Unknown973;
    [FieldOffset(0xDF8)] public uint Unknown974;
    [FieldOffset(0xDFC)] public uint Unknown975;
    [FieldOffset(0xE00)] public uint Unknown976;
    [FieldOffset(0xE04)] public uint Unknown977;
    [FieldOffset(0xE08)] public uint Unknown978;
    [FieldOffset(0xE0C)] public uint Unknown979;
    [FieldOffset(0xE10)] public uint Unknown980;
    [FieldOffset(0xE14)] public uint Unknown981;
    [FieldOffset(0xE18)] public uint Unknown982;
    [FieldOffset(0xE1C)] public uint Unknown983;
    [FieldOffset(0xE20)] public uint Unknown984;
    [FieldOffset(0xE24)] public uint Unknown985;
    [FieldOffset(0xE28)] public uint Unknown986;
    [FieldOffset(0xE2C)] public uint Unknown987;
    [FieldOffset(0xE30)] public uint Unknown988;
    [FieldOffset(0xE34)] public uint Unknown989;
    [FieldOffset(0xE38)] public uint Unknown990;
    [FieldOffset(0xE3C)] public uint Unknown991;
    [FieldOffset(0xE40)] public uint Unknown992;
    [FieldOffset(0xE44)] public uint Unknown993;
    [FieldOffset(0xE48)] public uint Unknown994;
    [FieldOffset(0xE4C)] public uint Unknown995;
    [FieldOffset(0xE50)] public uint Unknown996;
    [FieldOffset(0xE54)] public uint Unknown997;
    [FieldOffset(0xE58)] public uint Unknown998;
    [FieldOffset(0xE5C)] public uint Unknown999;
    [FieldOffset(0xE60)] public uint Unknown1000;
    [FieldOffset(0xE64)] public uint Unknown1001;
    [FieldOffset(0xE68)] public uint Unknown1002;
    [FieldOffset(0xE6C)] public uint Unknown1003;
    [FieldOffset(0xE70)] public uint Unknown1004;
    [FieldOffset(0xE74)] public uint Unknown1005;
    [FieldOffset(0xE78)] public uint Unknown1006;
    [FieldOffset(0xE7C)] public uint Unknown1007;
    [FieldOffset(0xE80)] public uint Unknown1008;
    [FieldOffset(0xE84)] public uint Unknown1009;
    [FieldOffset(0xE88)] public uint Unknown1010;
    [FieldOffset(0xE8C)] public uint Unknown1011;
    [FieldOffset(0xE90)] public uint Unknown1012;
    [FieldOffset(0xE94)] public uint Unknown1013;
    [FieldOffset(0xE98)] public uint Unknown1014;
    [FieldOffset(0xE9C)] public uint Unknown1015;
    [FieldOffset(0xEA0)] public uint Unknown1016;
    [FieldOffset(0xEA4)] public uint Unknown1017;
    [FieldOffset(0xEA8)] public uint Unknown1018;
    [FieldOffset(0xEAC)] public uint Unknown1019;
    [FieldOffset(0xEB0)] public uint Unknown1020;
    [FieldOffset(0xEB4)] public uint Unknown1021;
    [FieldOffset(0xEB8)] public uint Unknown1022;
    [FieldOffset(0xEBC)] public uint Unknown1023;
    [FieldOffset(0xEC0)] public uint Unknown1024;
    [FieldOffset(0xEC4)] public uint Unknown1025;
    [FieldOffset(0xEC8)] public uint Unknown1026;
    [FieldOffset(0xECC)] public uint Unknown1027;
    [FieldOffset(0xED0)] public uint Unknown1028;
    [FieldOffset(0xED4)] public uint Unknown1029;
    [FieldOffset(0xED8)] public uint Unknown1030;
    [FieldOffset(0xEDC)] public uint Unknown1031;
    [FieldOffset(0xEE0)] public uint Unknown1032;
    [FieldOffset(0xEE4)] public uint Unknown1033;
    [FieldOffset(0xEE8)] public uint Unknown1034;
    [FieldOffset(0xEEC)] public uint Unknown1035;
    [FieldOffset(0xEF0)] public uint Unknown1036;
    [FieldOffset(0xEF4)] public uint Unknown1037;
    [FieldOffset(0xEF8)] public uint Unknown1038;
    [FieldOffset(0xEFC)] public byte Unknown1039;
    [FieldOffset(0xEFD)] public byte Unknown1040;
    [FieldOffset(0xEFE)] public byte Unknown1041;
    [FieldOffset(0xEFF)] public byte Unknown1042;
    [FieldOffset(0xF00)] public byte Unknown1043;
    [FieldOffset(0xF01)] public byte Unknown1044;
    [FieldOffset(0xF02)] public byte Unknown1045;
    [FieldOffset(0xF03)] public byte Unknown1046;
    [FieldOffset(0xF04)] public byte Unknown1047;
    [FieldOffset(0xF05)] public byte Unknown1048;
    [FieldOffset(0xF06)] public byte Unknown1049;
    [FieldOffset(0xF07)] public byte Unknown1050;
    [FieldOffset(0xF08)] public byte Unknown1051;
    [FieldOffset(0xF09)] public byte Unknown1052;
    [FieldOffset(0xF0C)] public int Unknown1053;
    [FieldOffset(0xF10)] public int Unknown1054;
    [FieldOffset(0xF14)] public int Unknown1055;
    [FieldOffset(0xF18)] public int Unknown1056;
    [FieldOffset(0xF1C)] public int Unknown1057;
    [FieldOffset(0xF20)] public int Unknown1058;
    [FieldOffset(0xF24)] public int Unknown1059;
    [FieldOffset(0xF28)] public int Unknown1060;
    [FieldOffset(0xF2C)] public int Unknown1061;
    [FieldOffset(0xF30)] public int Unknown1062;
    [FieldOffset(0xF34)] public int Unknown1063;
    [FieldOffset(0xF38)] public int Unknown1064;
    [FieldOffset(0xF3C)] public int Unknown1065;
    [FieldOffset(0xF40)] public int Unknown1066;
    [FieldOffset(0xF44)] public int Unknown1067;
    [FieldOffset(0xF48)] public int Unknown1068;
    [FieldOffset(0xF4C)] public int Unknown1069;
    [FieldOffset(0xF50)] public int Unknown1070;
    [FieldOffset(0xF54)] public int Unknown1071;
    [FieldOffset(0xF58)] public int Unknown1072;
    [FieldOffset(0xF5C)] public int Unknown1073;
    [FieldOffset(0xF60)] public int Unknown1074;
    [FieldOffset(0xF64)] public int Unknown1075;
    [FieldOffset(0xF68)] public int Unknown1076;
    [FieldOffset(0xF6C)] public int Unknown1077;
    [FieldOffset(0xF70)] public int Unknown1078;
    [FieldOffset(0xF74)] public int Unknown1079;
    [FieldOffset(0xF78)] public int Unknown1080;
    [FieldOffset(0xF7C)] public int Unknown1081;
    [FieldOffset(0xF80)] public int Unknown1082;
    [FieldOffset(0xF84)] public int Unknown1083;
    [FieldOffset(0xF88)] public int Unknown1084;
    [FieldOffset(0xF8C)] public int Unknown1085;
    [FieldOffset(0xF90)] public int Unknown1086;
    [FieldOffset(0xF94)] public int Unknown1087;
    [FieldOffset(0xF98)] public int Unknown1088;
    [FieldOffset(0xF9C)] public int Unknown1089;
    [FieldOffset(0xFA0)] public int Unknown1090;
    [FieldOffset(0xFA4)] public int Unknown1091;
    [FieldOffset(0xFA8)] public int Unknown1092;
    [FieldOffset(0xFAC)] public int Unknown1093;
    [FieldOffset(0xFB0)] public int Unknown1094;
    [FieldOffset(0xFB4)] public int Unknown1095;
    [FieldOffset(0xFB8)] public int Unknown1096;
    [FieldOffset(0xFBC)] public int Unknown1097;
    [FieldOffset(0xFC0)] public int Unknown1098;
    [FieldOffset(0xFC4)] public int Unknown1099;
    [FieldOffset(0xFC8)] public int Unknown1100;
    [FieldOffset(0xFCC)] public int Unknown1101;
    [FieldOffset(0xFD0)] public int Unknown1102;
    [FieldOffset(0xFD4)] public int Unknown1103;
    [FieldOffset(0xFD8)] public int Unknown1104;
    [FieldOffset(0xFDC)] public int Unknown1105;
    [FieldOffset(0xFE0)] public int Unknown1106;
    [FieldOffset(0xFE4)] public int Unknown1107;
    [FieldOffset(0xFE8)] public int Unknown1108;
    /// <remarks>Race</remarks>
    [FieldOffset(0xFEC)] public int Race;
    /// <remarks>Tribe</remarks>
    [FieldOffset(0xFF0)] public int Tribe;
    [FieldOffset(0xFF4)] public sbyte Gender;
}
