// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x4C)]
public unsafe partial struct HousingPreset {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public sbyte Adjective;
    [FieldOffset(0x09)] public sbyte PossessivePronoun;
    [FieldOffset(0x0A)] public sbyte StartsWithVowel;
    [FieldOffset(0x0B)] public sbyte Unknown0;
    [FieldOffset(0x0C)] public sbyte Pronoun;
    [FieldOffset(0x0D)] public sbyte Article;
    /// <remarks>Item</remarks>
    [FieldOffset(0x10)] public int ExteriorRoof;
    /// <remarks>Item</remarks>
    [FieldOffset(0x14)] public int ExteriorWall;
    /// <remarks>Item</remarks>
    [FieldOffset(0x18)] public int ExteriorWindow;
    /// <remarks>Item</remarks>
    [FieldOffset(0x1C)] public int ExteriorDoor;
    /// <remarks>Item</remarks>
    [FieldOffset(0x20)] public int InteriorWall;
    /// <remarks>Item</remarks>
    [FieldOffset(0x24)] public int InteriorFlooring;
    /// <remarks>Item</remarks>
    [FieldOffset(0x28)] public int InteriorLighting;
    /// <remarks>Item</remarks>
    [FieldOffset(0x2C)] public int OtherFloorWall;
    /// <remarks>Item</remarks>
    [FieldOffset(0x30)] public int OtherFloorFlooring;
    /// <remarks>Item</remarks>
    [FieldOffset(0x34)] public int OtherFloorLighting;
    /// <remarks>Item</remarks>
    [FieldOffset(0x38)] public int BasementWall;
    /// <remarks>Item</remarks>
    [FieldOffset(0x3C)] public int BasementFlooring;
    /// <remarks>Item</remarks>
    [FieldOffset(0x40)] public int BasementLighting;
    /// <remarks>Item</remarks>
    [FieldOffset(0x44)] public int MansionLighting;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x48)] public ushort PlaceName;
    [FieldOffset(0x4A)] public byte HousingSize;
}
