// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct HousingUnitedExterior {
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x00)] public uint Roof;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x04)] public uint Walls;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x08)] public uint Windows;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x0C)] public uint Door;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x10)] public uint OptionalRoof;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x14)] public uint OptionalWall;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x18)] public uint OptionalSignboard;
    /// <remarks>HousingExterior</remarks>
    [FieldOffset(0x1C)] public uint Fence;
    [FieldOffset(0x20)] public byte PlotSize;
}
