// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0xB4)]
public unsafe partial struct HugeCraftworksNpc {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray6<HugeCraftworksTurnInParamStruct> _hugeCraftworksTurnInParam;
    [FieldOffset(0x60), FixedSizeArray] internal FixedSizeArray6<HugeCraftworksRewardParamStruct> _hugeCraftworksRewardParam;
    [FieldOffset(0xA8)] public int Transient_Offset;
    /// <remarks>ENpcResident</remarks>
    [FieldOffset(0xAC)] public uint EventNpc;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0xB0)] public ushort ClassJobCategory;

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public partial struct HugeCraftworksTurnInParamStruct {
        /// <remarks>Item</remarks>
        [FieldOffset(0x00)] public uint RequestedItem;
        [FieldOffset(0x04)] public ushort Unknown0;
        [FieldOffset(0x06)] public byte RequestedQuantity;
        [FieldOffset(0x07)] public byte Unknown1;
        [FieldOffset(0x08)] public byte Unknown2;
        [FieldOffset(0x09)] public byte Unknown3;
        [FieldOffset(0x0A)] public byte Unknown4;
        [FieldOffset(0x0B)] public byte Unknown5;
        [FieldOffset(0x0C)] public bool Unknown6;
    }
    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public partial struct HugeCraftworksRewardParamStruct {
        [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray2<uint> _rewardItem;
        [FieldOffset(0x08), FixedSizeArray] internal FixedSizeArray2<byte> _rewardQuantity;
        [FieldOffset(0x0A), FixedSizeArray] internal FixedSizeArray2<bool> _rewardHQ;
    }
}
