// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x284)]
public unsafe partial struct HWDCrafterSupply {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray23<HWDCrafterSupplyParamsStruct> _hWDCrafterSupplyParams;

    [StructLayout(LayoutKind.Explicit, Size = 0x1C)]
    public partial struct HWDCrafterSupplyParamsStruct {
        /// <remarks>Item</remarks>
        [FieldOffset(0x00)] public uint ItemTradeIn;
        [FieldOffset(0x04)] public ushort BaseCollectableRating;
        [FieldOffset(0x06)] public ushort MidCollectableRating;
        [FieldOffset(0x08)] public ushort HighCollectableRating;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x0A)] public ushort BaseCollectableReward;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x0C)] public ushort MidCollectableReward;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x0E)] public ushort HighCollectableReward;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x10)] public ushort BaseCollectableRewardPostPhase;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x12)] public ushort MidCollectableRewardPostPhase;
        /// <remarks>HWDCrafterSupplyReward</remarks>
        [FieldOffset(0x14)] public ushort HighCollectableRewardPostPhase;
        [FieldOffset(0x16)] public byte Level;
        [FieldOffset(0x17)] public byte LevelMax;
        [FieldOffset(0x18)] public byte Unknown0;
        /// <remarks>HWDCrafterSupplyTerm</remarks>
        [FieldOffset(0x19)] public byte TermName;
    }
}
