// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0xA8)]
public unsafe partial struct InstanceContent {
    [FieldOffset(0x00)] public uint NewPlayerBonusGil;
    [FieldOffset(0x04)] public uint NewPlayerBonusExp;
    [FieldOffset(0x08)] public uint FinalBossExp;
    [FieldOffset(0x0C)] public uint Unknown0;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray5<uint> _bossExp;
    [FieldOffset(0x24)] public uint InstanceClearExp;
    [FieldOffset(0x28)] public uint InstanceClearGil;
    /// <remarks>InstanceContentRewardItem</remarks>
    [FieldOffset(0x2C)] public uint InstanceContentRewardItem;
    [FieldOffset(0x30)] public ushort NewPlayerBonusA;
    [FieldOffset(0x32)] public ushort NewPlayerBonusB;
    [FieldOffset(0x34)] public ushort FinalBossCurrencyA;
    [FieldOffset(0x36)] public ushort FinalBossCurrencyB;
    [FieldOffset(0x38)] public ushort FinalBossCurrencyC;
    [FieldOffset(0x3A), FixedSizeArray] internal FixedSizeArray5<ushort> _bossCurrencyA;
    [FieldOffset(0x44), FixedSizeArray] internal FixedSizeArray5<ushort> _bossCurrencyB;
    [FieldOffset(0x4E), FixedSizeArray] internal FixedSizeArray5<ushort> _bossCurrencyC;
    [FieldOffset(0x58)] public ushort Unknown1;
    /// <remarks>Cutscene</remarks>
    [FieldOffset(0x5C)] public uint Cutscene;
    [FieldOffset(0x60)] public uint LGBEventRange;
    /// <remarks>InstanceContentTextData</remarks>
    [FieldOffset(0x64)] public uint InstanceContentTextDataBossStart;
    /// <remarks>InstanceContentTextData</remarks>
    [FieldOffset(0x68)] public uint InstanceContentTextDataBossEnd;
    /// <remarks>BNpcBase</remarks>
    [FieldOffset(0x6C)] public uint BNpcBaseBoss;
    /// <remarks>InstanceContentTextData</remarks>
    [FieldOffset(0x70)] public uint InstanceContentTextDataObjectiveStart;
    /// <remarks>InstanceContentTextData</remarks>
    [FieldOffset(0x74)] public uint InstanceContentTextDataObjectiveEnd;
    [FieldOffset(0x78)] public uint Unknown2;
    /// <remarks>InstanceContent</remarks>
    [FieldOffset(0x7C)] public uint ReqInstance;
    /// <remarks>InstanceContentBuff</remarks>
    [FieldOffset(0x80)] public int InstanceContentBuff;
    [FieldOffset(0x84)] public ushort TimeLimitmin;
    /// <remarks>BGM</remarks>
    [FieldOffset(0x86)] public ushort BGM;
    /// <remarks>BGM</remarks>
    [FieldOffset(0x88)] public ushort WinBGM;
    [FieldOffset(0x8A)] public ushort Order;
    [FieldOffset(0x8C)] public ushort SortKey;
    [FieldOffset(0x8E)] public ushort Unknown3;
    [FieldOffset(0x90)] public ushort Unknown4;
    [FieldOffset(0x92)] public ushort Unknown5;
    [FieldOffset(0x94)] public ushort Unknown6;
    [FieldOffset(0x96)] public ushort Unknown7;
    [FieldOffset(0x98)] public ushort Unknown8;
    [FieldOffset(0x9A)] public ushort Unknown_70;
    [FieldOffset(0x9C)] public short PartyCondition;
    /// <remarks>InstanceContentType</remarks>
    [FieldOffset(0x9E)] public byte InstanceContentType;
    [FieldOffset(0x9F)] public byte WeekRestriction;
    /// <remarks>Colosseum</remarks>
    [FieldOffset(0xA0)] public byte Colosseum;
    [FieldOffset(0xA1)] public byte Unknown9;
    [FieldOffset(0xA2)] public byte Unknown10;
    [FieldOffset(0xA3)] public byte Unknown11;
    [FieldOffset(0xA4)] public byte Unknown12;
    [FieldOffset(0xA5)] public byte Unknown19;
    [FieldOffset(0xA6)] public byte Unknown13;
    [FieldOffset(0xA7)] public BitFieldA7Flags BitFieldA7;
    public bool Unknown14 => BitFieldA7.HasFlag(BitFieldA7Flags.Unknown14);
    public bool Unknown15 => BitFieldA7.HasFlag(BitFieldA7Flags.Unknown15);
    public bool Unknown16 => BitFieldA7.HasFlag(BitFieldA7Flags.Unknown16);
    public bool Unknown17 => BitFieldA7.HasFlag(BitFieldA7Flags.Unknown17);
    public bool Unknown18 => BitFieldA7.HasFlag(BitFieldA7Flags.Unknown18);

    [Flags]
    public enum BitFieldA7Flags : byte {
    	Unknown14 = 1 << 0,
    	Unknown15 = 1 << 1,
    	Unknown16 = 1 << 2,
    	Unknown17 = 1 << 3,
    	Unknown18 = 1 << 4,
    }
}
