// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x94)]
public unsafe partial struct ItemLevel {
    [FieldOffset(0x00)] public ushort Strength;
    [FieldOffset(0x02)] public ushort Dexterity;
    [FieldOffset(0x04)] public ushort Vitality;
    [FieldOffset(0x06)] public ushort Intelligence;
    [FieldOffset(0x08)] public ushort Mind;
    [FieldOffset(0x0A)] public ushort Piety;
    [FieldOffset(0x0C)] public ushort HP;
    [FieldOffset(0x0E)] public ushort MP;
    [FieldOffset(0x10)] public ushort TP;
    [FieldOffset(0x12)] public ushort GP;
    [FieldOffset(0x14)] public ushort CP;
    [FieldOffset(0x16)] public ushort PhysicalDamage;
    [FieldOffset(0x18)] public ushort MagicalDamage;
    [FieldOffset(0x1A)] public ushort Delay;
    [FieldOffset(0x1C)] public ushort AdditionalEffect;
    [FieldOffset(0x1E)] public ushort AttackSpeed;
    [FieldOffset(0x20)] public ushort BlockRate;
    [FieldOffset(0x22)] public ushort BlockStrength;
    [FieldOffset(0x24)] public ushort Tenacity;
    [FieldOffset(0x26)] public ushort AttackPower;
    [FieldOffset(0x28)] public ushort Defense;
    [FieldOffset(0x2A)] public ushort DirectHitRate;
    [FieldOffset(0x2C)] public ushort Evasion;
    [FieldOffset(0x2E)] public ushort MagicDefense;
    [FieldOffset(0x30)] public ushort CriticalHitPower;
    [FieldOffset(0x32)] public ushort CriticalHitResilience;
    [FieldOffset(0x34)] public ushort CriticalHit;
    [FieldOffset(0x36)] public ushort CriticalHitEvasion;
    [FieldOffset(0x38)] public ushort SlashingResistance;
    [FieldOffset(0x3A)] public ushort PiercingResistance;
    [FieldOffset(0x3C)] public ushort BluntResistance;
    [FieldOffset(0x3E)] public ushort ProjectileResistance;
    [FieldOffset(0x40)] public ushort AttackMagicPotency;
    [FieldOffset(0x42)] public ushort HealingMagicPotency;
    [FieldOffset(0x44)] public ushort EnhancementMagicPotency;
    [FieldOffset(0x46)] public ushort EnfeeblingMagicPotency;
    [FieldOffset(0x48)] public ushort FireResistance;
    [FieldOffset(0x4A)] public ushort IceResistance;
    [FieldOffset(0x4C)] public ushort WindResistance;
    [FieldOffset(0x4E)] public ushort EarthResistance;
    [FieldOffset(0x50)] public ushort LightningResistance;
    [FieldOffset(0x52)] public ushort WaterResistance;
    [FieldOffset(0x54)] public ushort MagicResistance;
    [FieldOffset(0x56)] public ushort Determination;
    [FieldOffset(0x58)] public ushort SkillSpeed;
    [FieldOffset(0x5A)] public ushort SpellSpeed;
    [FieldOffset(0x5C)] public ushort Haste;
    [FieldOffset(0x5E)] public ushort Morale;
    [FieldOffset(0x60)] public ushort Enmity;
    [FieldOffset(0x62)] public ushort EnmityReduction;
    [FieldOffset(0x64)] public ushort CarefulDesynthesis;
    [FieldOffset(0x66)] public ushort EXPBonus;
    [FieldOffset(0x68)] public ushort Regen;
    [FieldOffset(0x6A)] public ushort Refresh;
    [FieldOffset(0x6C)] public ushort MovementSpeed;
    [FieldOffset(0x6E)] public ushort Spikes;
    [FieldOffset(0x70)] public ushort SlowResistance;
    [FieldOffset(0x72)] public ushort PetrificationResistance;
    [FieldOffset(0x74)] public ushort ParalysisResistance;
    [FieldOffset(0x76)] public ushort SilenceResistance;
    [FieldOffset(0x78)] public ushort BlindResistance;
    [FieldOffset(0x7A)] public ushort PoisonResistance;
    [FieldOffset(0x7C)] public ushort StunResistance;
    [FieldOffset(0x7E)] public ushort SleepResistance;
    [FieldOffset(0x80)] public ushort BindResistance;
    [FieldOffset(0x82)] public ushort HeavyResistance;
    [FieldOffset(0x84)] public ushort DoomResistance;
    [FieldOffset(0x86)] public ushort ReducedDurabilityLoss;
    [FieldOffset(0x88)] public ushort IncreasedSpiritbondGain;
    [FieldOffset(0x8A)] public ushort Craftsmanship;
    [FieldOffset(0x8C)] public ushort Control;
    [FieldOffset(0x8E)] public ushort Gathering;
    [FieldOffset(0x90)] public ushort Perception;
    [FieldOffset(0x92)] public ushort Unknown0;
}
