// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct Level {
    [FieldOffset(0x00)] public float X;
    [FieldOffset(0x04)] public float Y;
    [FieldOffset(0x08)] public float Z;
    [FieldOffset(0x0C)] public float Yaw;
    [FieldOffset(0x10)] public float Radius;
    [FieldOffset(0x14)] public uint Object;
    /// <remarks>TripleTriad, Adventure, Opening, Quest</remarks>
    [FieldOffset(0x18)] public uint EventId;
    /// <remarks>Map</remarks>
    [FieldOffset(0x1C)] public ushort Map;
    /// <remarks>TerritoryType</remarks>
    [FieldOffset(0x1E)] public ushort Territory;
    [FieldOffset(0x20)] public byte Type;
}
