// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct ManeuversArmor {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    /// <remarks>BNpcName</remarks>
    [FieldOffset(0x08)] public uint FalconName;
    /// <remarks>BNpcName</remarks>
    [FieldOffset(0x0C)] public uint RavenName;
    [FieldOffset(0x10)] public uint NeutralMapIcon;
    [FieldOffset(0x14)] public uint FalconImage;
    [FieldOffset(0x18)] public uint RavenImage;
    [FieldOffset(0x1C)] public uint FalconMapImage;
    [FieldOffset(0x20)] public uint RavenMapImage;
    [FieldOffset(0x24)] public ushort Unknown0;
    [FieldOffset(0x26)] public byte Unknown1;
    [FieldOffset(0x27)] public bool Unknown2;
}
