// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct MapMarker {
    [FieldOffset(0x00)] public ushort Icon;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x02)] public ushort PlaceNameSubtext;
    [FieldOffset(0x04)] public ushort DataKey;
    [FieldOffset(0x06)] public short X;
    [FieldOffset(0x08)] public short Y;
    [FieldOffset(0x0A)] public byte SubtextOrientation;
    /// <remarks>MapMarkerRegion</remarks>
    [FieldOffset(0x0B)] public byte MapMarkerRegion;
    [FieldOffset(0x0C)] public byte Type;
    [FieldOffset(0x0D)] public byte DataType;
    [FieldOffset(0x0E)] public byte Unknown0;
    [FieldOffset(0x0F)] public byte Unknown1;
}
