// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct MapMarkerRegion {
    [FieldOffset(0x00)] public ushort Unknown0;
    [FieldOffset(0x02)] public ushort Unknown1;
    [FieldOffset(0x04)] public ushort Unknown2;
    [FieldOffset(0x06)] public ushort Unknown3;
    [FieldOffset(0x08)] public short X;
    [FieldOffset(0x0A)] public short Unknown4;
    [FieldOffset(0x0C)] public short Unknown5;
    [FieldOffset(0x0E)] public short Unknown6;
    [FieldOffset(0x10)] public short Unknown7;
    [FieldOffset(0x12)] public short Unknown8;
    [FieldOffset(0x14)] public byte Unknown9;
    [FieldOffset(0x15)] public bool Unknown10;
}
