// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct MiniGameRA {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public int Icon;
    [FieldOffset(0x0C)] public int Image;
    /// <remarks>BGM</remarks>
    [FieldOffset(0x10)] public int BGM;
    [FieldOffset(0x14)] public int Unknown2;
    [FieldOffset(0x18)] public ushort Unknown3;
    [FieldOffset(0x1A)] public ushort Unknown4;
    [FieldOffset(0x1C)] public ushort Unknown5;
    [FieldOffset(0x1E)] public short Unknown6;
    [FieldOffset(0x20)] public short Unknown7;
    [FieldOffset(0x22)] public short Unknown8;
    [FieldOffset(0x24)] public short Unknown9;
    [FieldOffset(0x26)] public byte Unknown10;
    [FieldOffset(0x27)] public byte Unknown11;
    [FieldOffset(0x28)] public byte Unknown12;
    [FieldOffset(0x29)] public byte Unknown13;
    [FieldOffset(0x2A)] public BitField2AFlags BitField2A;
    public bool Unknown14 => BitField2A.HasFlag(BitField2AFlags.Unknown14);
    public bool Unknown15 => BitField2A.HasFlag(BitField2AFlags.Unknown15);
    public bool Unknown16 => BitField2A.HasFlag(BitField2AFlags.Unknown16);
    public bool Unknown17 => BitField2A.HasFlag(BitField2AFlags.Unknown17);
    public bool Unknown18 => BitField2A.HasFlag(BitField2AFlags.Unknown18);

    [Flags]
    public enum BitField2AFlags : byte {
    	Unknown14 = 1 << 0,
    	Unknown15 = 1 << 1,
    	Unknown16 = 1 << 2,
    	Unknown17 = 1 << 3,
    	Unknown18 = 1 << 4,
    }
}
