// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct MiniGameTurnBreakAction {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1_Offset;
    [FieldOffset(0x08)] public int Unknown2;
    [FieldOffset(0x0C)] public int Unknown3;
    [FieldOffset(0x10)] public int Unknown4;
    [FieldOffset(0x14)] public byte Unknown5;
    [FieldOffset(0x15)] public byte Unknown6;
    [FieldOffset(0x16)] public byte Unknown7;
    [FieldOffset(0x17)] public byte Unknown8;
    [FieldOffset(0x18)] public byte Unknown9;
}
