// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x0C)]
public unsafe partial struct MiniGameTurnBreakStage {
    [FieldOffset(0x00)] public ushort Unknown0;
    [FieldOffset(0x02)] public byte Unknown1;
    [FieldOffset(0x03)] public byte Unknown2;
    [FieldOffset(0x04)] public byte Unknown3;
    [FieldOffset(0x05)] public byte Unknown4;
    [FieldOffset(0x06)] public byte Unknown5;
    [FieldOffset(0x07)] public byte Unknown6;
    [FieldOffset(0x08)] public byte Unknown7;
    [FieldOffset(0x09)] public byte Unknown8;
    [FieldOffset(0x0A)] public byte Unknown9;
}
