// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct MirageStoreSetItem {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public uint Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public uint Unknown8;
    [FieldOffset(0x24)] public uint Unknown9;
    [FieldOffset(0x28)] public uint Unknown10;
}
