// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct MJIBuilding {
    /// <remarks>MJIText</remarks>
    [FieldOffset(0x00)] public uint Name;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public uint Icon;
    [FieldOffset(0x0C), FixedSizeArray] internal FixedSizeArray5<ushort> _sgb;
    [FieldOffset(0x16)] public byte Unknown1;
    [FieldOffset(0x17)] public byte Unknown2;
    [FieldOffset(0x18)] public byte Unknown3;
    [FieldOffset(0x19)] public byte Unknown4;
    [FieldOffset(0x1A)] public byte Unknown5;
    [FieldOffset(0x1B)] public byte Unknown6;
    [FieldOffset(0x1C)] public byte Unknown7;
    [FieldOffset(0x1D)] public byte Unknown8;
    [FieldOffset(0x1E)] public byte Unknown9;
    [FieldOffset(0x1F)] public byte Unknown10;
    [FieldOffset(0x20)] public byte Unknown11;
    [FieldOffset(0x21)] public byte Unknown12;
    [FieldOffset(0x22)] public byte Unknown13;
    [FieldOffset(0x23)] public byte Unknown14;
    [FieldOffset(0x24), FixedSizeArray] internal FixedSizeArray5<byte> _material;
    [FieldOffset(0x29), FixedSizeArray] internal FixedSizeArray5<byte> _amount;
}
