// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x80)]
public unsafe partial struct MJIFarmPastureRank {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray4<RankDataStruct> _rankData;

    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public partial struct RankDataStruct {
        [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray4<uint> _sGB;
        [FieldOffset(0x10)] public uint Unknown0;
        [FieldOffset(0x14)] public uint Unknown1;
        [FieldOffset(0x18)] public ushort Unknown2;
        [FieldOffset(0x1A)] public ushort Unknown3;
        [FieldOffset(0x1C)] public byte Unknown4;
        [FieldOffset(0x1D)] public byte Unknown5;
        [FieldOffset(0x1E)] public byte Unknown6;
        [FieldOffset(0x1F)] public byte Unknown7;
    }
}
