// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct MJIGardenscaping {
    [FieldOffset(0x00)] public int Unknown0;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public int Unknown2;
    /// <remarks>Item</remarks>
    [FieldOffset(0x0C)] public int Item;
    [FieldOffset(0x10)] public int Unknown3;
    [FieldOffset(0x14)] public ushort Unknown4;
    [FieldOffset(0x16)] public ushort Unknown5;
    [FieldOffset(0x18)] public ushort Unknown6;
    [FieldOffset(0x1A)] public byte Level;
}
