// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x38)]
public unsafe partial struct MJILandmark {
    /// <remarks>MJIText</remarks>
    [FieldOffset(0x00)] public uint Name;
    [FieldOffset(0x04)] public uint Icon;
    [FieldOffset(0x08)] public ushort Unknown0;
    [FieldOffset(0x0A), FixedSizeArray] internal FixedSizeArray7<ushort> _sGB;
    [FieldOffset(0x18), FixedSizeArray] internal FixedSizeArray5<ushort> _material;
    [FieldOffset(0x22)] public ushort Unknown1;
    [FieldOffset(0x24)] public byte Unknown2;
    [FieldOffset(0x25)] public byte Unknown3;
    [FieldOffset(0x26)] public byte Unknown4;
    [FieldOffset(0x27)] public byte Unknown5;
    [FieldOffset(0x28)] public byte Unknown6;
    [FieldOffset(0x29)] public byte Unknown7;
    [FieldOffset(0x2A)] public byte Unknown8;
    [FieldOffset(0x2B)] public byte Unknown9;
    [FieldOffset(0x2C)] public byte Unknown10;
    [FieldOffset(0x2D)] public byte Unknown11;
    [FieldOffset(0x2E)] public byte Unknown12;
    [FieldOffset(0x2F)] public byte Unknown13;
    [FieldOffset(0x30), FixedSizeArray] internal FixedSizeArray5<byte> _amount;
}
