// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct MJIProgress {
    [FieldOffset(0x00)] public int Vision_Offset;
    [FieldOffset(0x04)] public int Objective_Offset;
    [FieldOffset(0x08)] public int PreviousObjective_Offset;
    [FieldOffset(0x0C)] public ushort Unknown0;
    [FieldOffset(0x0E)] public short Unknown1;
    [FieldOffset(0x10)] public short Unknown2;
    [FieldOffset(0x12)] public byte Unknown3;
    [FieldOffset(0x13)] public byte Unknown4;
    [FieldOffset(0x14)] public byte Unknown5;
    [FieldOffset(0x15)] public byte Unknown6;
    [FieldOffset(0x16)] public byte Unknown7;
    [FieldOffset(0x17)] public byte Unknown8;
    [FieldOffset(0x18)] public byte Unknown9;
    [FieldOffset(0x19)] public byte Unknown10;
    [FieldOffset(0x1A)] public byte Unknown11;
    [FieldOffset(0x1B)] public byte Unknown12;
    [FieldOffset(0x1C)] public byte Unknown13;
    [FieldOffset(0x1D)] public byte Unknown14;
    [FieldOffset(0x1E)] public byte Unknown15;
    [FieldOffset(0x1F)] public byte Unknown16;
    [FieldOffset(0x20)] public byte Unknown17;
    [FieldOffset(0x21)] public byte Unknown18;
    [FieldOffset(0x22)] public byte Unknown19;
}
