// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct MJIVillageDevelopment {
    /// <remarks>ENpcResident</remarks>
    [FieldOffset(0x00)] public uint ENPC;
    [FieldOffset(0x04)] public uint Unknown0;
    [FieldOffset(0x08)] public uint Unknown1;
    [FieldOffset(0x0C)] public uint Unknown2;
    [FieldOffset(0x10)] public uint Unknown3;
    [FieldOffset(0x14)] public uint Unknown4;
    /// <remarks>Behavior</remarks>
    [FieldOffset(0x18)] public ushort Behavior0;
    /// <remarks>Behavior</remarks>
    [FieldOffset(0x1A)] public ushort Behavior1;
    [FieldOffset(0x1C)] public byte Unknown5;
    [FieldOffset(0x1D)] public byte Unknown6;
    [FieldOffset(0x1E)] public byte Unknown7;
    [FieldOffset(0x1F)] public byte Unknown8;
    [FieldOffset(0x20)] public byte Unknown9;
    [FieldOffset(0x21)] public byte Unknown10;
    [FieldOffset(0x22)] public byte Unknown11;
}
