// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct ModelSkeleton {
    [FieldOffset(0x00)] public float Radius;
    [FieldOffset(0x04)] public float Height;
    [FieldOffset(0x08)] public float VFXScale;
    [FieldOffset(0x0C)] public float FloatHeight;
    [FieldOffset(0x10)] public float FloatDown;
    [FieldOffset(0x14)] public ushort Unknown0;
    [FieldOffset(0x16)] public ushort Unknown1;
    [FieldOffset(0x18)] public ushort Unknown2;
    [FieldOffset(0x1A)] public ushort Unknown3;
    [FieldOffset(0x1C)] public ushort Unknown4;
    [FieldOffset(0x1E)] public ushort Unknown5;
    [FieldOffset(0x20)] public ushort Unknown6;
    [FieldOffset(0x22)] public ushort Unknown7;
    [FieldOffset(0x24)] public ushort FloatUp;
    [FieldOffset(0x26)] public byte Unknown8;
    [FieldOffset(0x27)] public byte LoopFlySE;
    [FieldOffset(0x28)] public bool MotionBlendType;
}
