// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x3C)]
public unsafe partial struct MountCustomize {
    [FieldOffset(0x00)] public ushort HyurMidlanderMaleScale;
    [FieldOffset(0x02)] public ushort HyurMidlanderFemaleScale;
    [FieldOffset(0x04)] public ushort HyurHighlanderMaleScale;
    [FieldOffset(0x06)] public ushort HyurHighlanderFemaleScale;
    [FieldOffset(0x08)] public ushort ElezenMaleScale;
    [FieldOffset(0x0A)] public ushort ElezenFemaleScale;
    [FieldOffset(0x0C)] public ushort LalaMaleScale;
    [FieldOffset(0x0E)] public ushort LalaFemaleScale;
    [FieldOffset(0x10)] public ushort MiqoMaleScale;
    [FieldOffset(0x12)] public ushort MiqoFemaleScale;
    [FieldOffset(0x14)] public ushort RoeMaleScale;
    [FieldOffset(0x16)] public ushort RoeFemaleScale;
    [FieldOffset(0x18)] public ushort AuRaMaleScale;
    [FieldOffset(0x1A)] public ushort AuRaFemaleScale;
    [FieldOffset(0x1C)] public ushort HrothgarMaleScale;
    [FieldOffset(0x1E)] public ushort VieraMaleScale;
    [FieldOffset(0x20)] public ushort VieraFemaleScale;
    [FieldOffset(0x22)] public ushort HyurMidlanderMaleCameraHeight;
    [FieldOffset(0x24)] public ushort HyurMidlanderFemaleCameraHeight;
    [FieldOffset(0x26)] public byte HyurHighlanderMaleCameraHeight;
    [FieldOffset(0x27)] public byte HyurHighlanderFemaleCameraHeight;
    [FieldOffset(0x28)] public byte ElezenMaleCameraHeight;
    [FieldOffset(0x29)] public byte ElezenFemaleCameraHeight;
    [FieldOffset(0x2A)] public byte LalaMaleCameraHeight;
    [FieldOffset(0x2B)] public byte LalaFemaleCameraHeight;
    [FieldOffset(0x2C)] public byte MiqoMaleCameraHeight;
    [FieldOffset(0x2D)] public byte MiqoFemaleCameraHeight;
    [FieldOffset(0x2E)] public byte RoeMaleCameraHeight;
    [FieldOffset(0x2F)] public byte RoeFemaleCameraHeight;
    [FieldOffset(0x30)] public byte AuRaMaleCameraHeight;
    [FieldOffset(0x31)] public byte AuRaFemaleCameraHeight;
    [FieldOffset(0x32)] public byte HrothgarMaleCameraHeight;
    [FieldOffset(0x33)] public byte VieraMaleCameraHeight;
    [FieldOffset(0x34)] public byte VieraFemaleCameraHeight;
    [FieldOffset(0x35)] public byte Unknown0;
    [FieldOffset(0x36)] public byte Unknown1;
    [FieldOffset(0x37)] public byte Unknown_70_1;
    [FieldOffset(0x38)] public byte Unknown_70_2;
    [FieldOffset(0x39)] public bool Unknown2;
}
