// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct MoveTimeline {
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x00)] public ushort Idle;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x02)] public ushort MoveForward;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x04)] public ushort MoveBack;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x06)] public ushort MoveLeft;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x08)] public ushort MoveRight;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x0A)] public ushort MoveUp;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x0C)] public ushort MoveDown;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x0E)] public ushort MoveTurnLeft;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x10)] public ushort MoveTurnRight;
    /// <remarks>ActionTimeline</remarks>
    [FieldOffset(0x12)] public ushort Extra;
}
