// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct MoveControl {
    [FieldOffset(0x00)] public float Unknown0;
    [FieldOffset(0x04)] public float Unknown1;
    [FieldOffset(0x08)] public float Unknown2;
    [FieldOffset(0x0C)] public float Unknown3;
    [FieldOffset(0x10)] public float Unknown4;
    [FieldOffset(0x14)] public float Unknown5;
    [FieldOffset(0x18)] public float Unknown6;
    [FieldOffset(0x1C)] public byte Unknown7;
    [FieldOffset(0x1D)] public byte Unknown8;
    [FieldOffset(0x1E)] public byte Unknown9;
}
