// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct MYCWarResultNotebook {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Description_Offset;
    [FieldOffset(0x08)] public int NameJP_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x0C)] public int Quest;
    [FieldOffset(0x10)] public int Unknown0;
    [FieldOffset(0x14)] public int Icon;
    [FieldOffset(0x18)] public int Image;
    [FieldOffset(0x1C)] public byte Number;
    [FieldOffset(0x1D)] public byte Unknown1;
    [FieldOffset(0x1E)] public byte Link;
    [FieldOffset(0x1F)] public byte Rarity;
}
