// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct NotebookDivision {
    [FieldOffset(0x00)] public int Name_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x04)] public uint QuestUnlock;
    /// <remarks>NotebookDivisionCategory</remarks>
    [FieldOffset(0x08)] public byte NotebookDivisionCategory;
    [FieldOffset(0x09)] public byte CraftOpeningLevel;
    [FieldOffset(0x0A)] public byte GatheringOpeningLevel;
    [FieldOffset(0x0B)] public byte Unknown0;
    [FieldOffset(0x0C)] public bool CRPCraft;
    [FieldOffset(0x0D)] public bool BSMCraft;
    [FieldOffset(0x0E)] public bool ARMCraft;
    [FieldOffset(0x0F)] public bool GSMCraft;
    [FieldOffset(0x10)] public bool LTWCraft;
    [FieldOffset(0x11)] public bool WVRCraft;
    [FieldOffset(0x12)] public bool ALCCraft;
    [FieldOffset(0x13)] public bool CULCraft;
    [FieldOffset(0x14)] public bool Unknown1;
}
