// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x58)]
public unsafe partial struct NpcEquip {
    [FieldOffset(0x00)] public ulong ModelMainHand;
    [FieldOffset(0x08)] public ulong ModelOffHand;
    [FieldOffset(0x10)] public uint ModelHead;
    [FieldOffset(0x14)] public uint ModelBody;
    [FieldOffset(0x18)] public uint ModelHands;
    [FieldOffset(0x1C)] public uint ModelLegs;
    [FieldOffset(0x20)] public uint ModelFeet;
    [FieldOffset(0x24)] public uint ModelEars;
    [FieldOffset(0x28)] public uint ModelNeck;
    [FieldOffset(0x2C)] public uint ModelWrists;
    [FieldOffset(0x30)] public uint ModelLeftRing;
    [FieldOffset(0x34)] public uint ModelRightRing;
    [FieldOffset(0x38)] public ushort Unknown_70_1;
    [FieldOffset(0x3A)] public ushort Unknown_70_2;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x3C)] public byte DyeMainHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x3D)] public byte Dye2MainHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x3E)] public byte DyeOffHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x3F)] public byte Dye2OffHand;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x40)] public byte DyeHead;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x41)] public byte DyeBody;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x42)] public byte DyeHands;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x43)] public byte DyeLegs;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x44)] public byte DyeFeet;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x45)] public byte DyeEars;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x46)] public byte DyeNeck;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x47)] public byte DyeWrists;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x48)] public byte DyeLeftRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x49)] public byte DyeRightRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4A)] public byte Dye2Head;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4B)] public byte Dye2Body;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4C)] public byte Dye2Hands;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4D)] public byte Dye2Legs;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4E)] public byte Dye2Feet;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x4F)] public byte Dye2Ears;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x50)] public byte Dye2Neck;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x51)] public byte Dye2Wrists;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x52)] public byte Dye2LeftRing;
    /// <remarks>Stain</remarks>
    [FieldOffset(0x53)] public byte Dye2RightRing;
    [FieldOffset(0x54)] public bool Visor;
}
