// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x148)]
public unsafe partial struct Opening {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public int Unknown2_Offset;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public int Unknown4_Offset;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public int Unknown6_Offset;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public int Unknown8_Offset;
    [FieldOffset(0x24)] public uint Unknown9;
    [FieldOffset(0x28)] public int Unknown10_Offset;
    [FieldOffset(0x2C)] public uint Unknown11;
    [FieldOffset(0x30)] public int Unknown12_Offset;
    [FieldOffset(0x34)] public uint Unknown13;
    [FieldOffset(0x38)] public int Unknown14_Offset;
    [FieldOffset(0x3C)] public uint Unknown15;
    [FieldOffset(0x40)] public int Unknown16_Offset;
    [FieldOffset(0x44)] public uint Unknown17;
    [FieldOffset(0x48)] public int Unknown18_Offset;
    [FieldOffset(0x4C)] public uint Unknown19;
    [FieldOffset(0x50)] public int Unknown20_Offset;
    [FieldOffset(0x54)] public uint Unknown21;
    [FieldOffset(0x58)] public int Unknown22_Offset;
    [FieldOffset(0x5C)] public uint Unknown23;
    [FieldOffset(0x60)] public int Unknown24_Offset;
    [FieldOffset(0x64)] public uint Unknown25;
    [FieldOffset(0x68)] public int Unknown26_Offset;
    [FieldOffset(0x6C)] public uint Unknown27;
    [FieldOffset(0x70)] public int Unknown28_Offset;
    [FieldOffset(0x74)] public uint Unknown29;
    [FieldOffset(0x78)] public int Unknown30_Offset;
    [FieldOffset(0x7C)] public uint Unknown31;
    [FieldOffset(0x80)] public int Unknown32_Offset;
    [FieldOffset(0x84)] public uint Unknown33;
    [FieldOffset(0x88)] public int Unknown34_Offset;
    [FieldOffset(0x8C)] public uint Unknown35;
    [FieldOffset(0x90)] public int Unknown36_Offset;
    [FieldOffset(0x94)] public uint Unknown37;
    [FieldOffset(0x98)] public int Unknown38_Offset;
    [FieldOffset(0x9C)] public uint Unknown39;
    [FieldOffset(0xA0)] public int Unknown40_Offset;
    [FieldOffset(0xA4)] public uint Unknown41;
    [FieldOffset(0xA8)] public int Unknown42_Offset;
    [FieldOffset(0xAC)] public uint Unknown43;
    [FieldOffset(0xB0)] public int Unknown44_Offset;
    [FieldOffset(0xB4)] public uint Unknown45;
    [FieldOffset(0xB8)] public int Unknown46_Offset;
    [FieldOffset(0xBC)] public uint Unknown47;
    [FieldOffset(0xC0)] public int Unknown48_Offset;
    [FieldOffset(0xC4)] public uint Unknown49;
    [FieldOffset(0xC8)] public int Unknown50_Offset;
    [FieldOffset(0xCC)] public uint Unknown51;
    [FieldOffset(0xD0)] public int Unknown52_Offset;
    [FieldOffset(0xD4)] public uint Unknown53;
    [FieldOffset(0xD8)] public int Unknown54_Offset;
    [FieldOffset(0xDC)] public uint Unknown55;
    [FieldOffset(0xE0)] public int Unknown56_Offset;
    [FieldOffset(0xE4)] public uint Unknown57;
    [FieldOffset(0xE8)] public int Unknown58_Offset;
    [FieldOffset(0xEC)] public uint Unknown59;
    [FieldOffset(0xF0)] public int Unknown60_Offset;
    [FieldOffset(0xF4)] public uint Unknown61;
    [FieldOffset(0xF8)] public int Unknown62_Offset;
    [FieldOffset(0xFC)] public uint Unknown63;
    [FieldOffset(0x100)] public int Unknown64_Offset;
    [FieldOffset(0x104)] public uint Unknown65;
    [FieldOffset(0x108)] public int Unknown66_Offset;
    [FieldOffset(0x10C)] public uint Unknown67;
    [FieldOffset(0x110)] public int Unknown68_Offset;
    [FieldOffset(0x114)] public uint Unknown69;
    [FieldOffset(0x118)] public int Unknown70_Offset;
    [FieldOffset(0x11C)] public uint Unknown71;
    [FieldOffset(0x120)] public int Unknown72_Offset;
    [FieldOffset(0x124)] public uint Unknown73;
    [FieldOffset(0x128)] public int Unknown74_Offset;
    [FieldOffset(0x12C)] public uint Unknown75;
    [FieldOffset(0x130)] public int Unknown76_Offset;
    [FieldOffset(0x134)] public uint Unknown77;
    [FieldOffset(0x138)] public int Unknown78_Offset;
    [FieldOffset(0x13C)] public uint Unknown79;
    [FieldOffset(0x140)] public int Name_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x144)] public uint Quest;
}
