// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct Ornament {
    [FieldOffset(0x00)] public int Singular_Offset;
    [FieldOffset(0x04)] public int Plural_Offset;
    [FieldOffset(0x08)] public sbyte Adjective;
    [FieldOffset(0x09)] public sbyte PossessivePronoun;
    [FieldOffset(0x0A)] public sbyte StartsWithVowel;
    [FieldOffset(0x0B)] public sbyte Unknown0;
    [FieldOffset(0x0C)] public sbyte Pronoun;
    [FieldOffset(0x0D)] public sbyte Article;
    [FieldOffset(0x10)] public ushort Model;
    [FieldOffset(0x12)] public ushort Unknown1;
    [FieldOffset(0x14)] public ushort Icon;
    [FieldOffset(0x16)] public ushort Transient;
    [FieldOffset(0x18)] public short Order;
    [FieldOffset(0x1A)] public byte Unknown2;
    [FieldOffset(0x1B)] public byte Unknown3;
    [FieldOffset(0x1C)] public byte Unknown4;
}
