// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct ParamGrow {
    [FieldOffset(0x00)] public int ExpToNext;
    [FieldOffset(0x04)] public int MpModifier;
    [FieldOffset(0x08)] public int BaseSpeed;
    [FieldOffset(0x0C)] public int LevelModifier;
    [FieldOffset(0x10)] public int HuntingLogExpReward;
    [FieldOffset(0x14)] public int MonsterNoteSeals;
    [FieldOffset(0x18)] public ushort ScaledQuestXP;
    [FieldOffset(0x1A)] public ushort HpModifier;
    [FieldOffset(0x1C)] public ushort ItemLevelSync;
    [FieldOffset(0x1E)] public ushort ProperDungeon;
    [FieldOffset(0x20)] public ushort ProperGuildOrder;
    [FieldOffset(0x22)] public ushort CraftingLevel;
    [FieldOffset(0x24)] public byte AdditionalActions;
    [FieldOffset(0x25)] public byte ApplyAction;
    [FieldOffset(0x26)] public byte QuestExpModifier;
}
