// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x84)]
public unsafe partial struct PartyContent {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray9<uint> _lGBEventObject;
    [FieldOffset(0x24), FixedSizeArray] internal FixedSizeArray9<uint> _lGBEventRange;
    [FieldOffset(0x48), FixedSizeArray] internal FixedSizeArray9<uint> _lGBEventObject2;
    /// <remarks>PartyContentTextData</remarks>
    [FieldOffset(0x6C)] public uint TextDataStart;
    /// <remarks>PartyContentTextData</remarks>
    [FieldOffset(0x70)] public uint TextDataEnd;
    [FieldOffset(0x74)] public uint Image;
    [FieldOffset(0x78)] public ushort TimeLimit;
    [FieldOffset(0x7A)] public ushort Unknown0;
    /// <remarks>ContentFinderCondition</remarks>
    [FieldOffset(0x7C)] public ushort ContentFinderCondition;
    [FieldOffset(0x7E)] public byte Key;
    [FieldOffset(0x7F)] public byte Unknown1;
    [FieldOffset(0x80)] public bool Name;
}
