// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x68)]
public unsafe partial struct Permission {
    [FieldOffset(0x00)] public bool Unknown0;
    [FieldOffset(0x01)] public bool Unknown1;
    [FieldOffset(0x02)] public bool Unknown2;
    [FieldOffset(0x03)] public bool Unknown3;
    [FieldOffset(0x04)] public bool Unknown4;
    [FieldOffset(0x05)] public bool Unknown5;
    [FieldOffset(0x06)] public bool Unknown6;
    [FieldOffset(0x07)] public bool Unknown7;
    [FieldOffset(0x08)] public bool Unknown8;
    [FieldOffset(0x09)] public bool Unknown9;
    [FieldOffset(0x0A)] public bool Unknown10;
    [FieldOffset(0x0B)] public bool Unknown11;
    [FieldOffset(0x0C)] public bool Unknown12;
    [FieldOffset(0x0D)] public bool Unknown13;
    [FieldOffset(0x0E)] public bool Unknown14;
    [FieldOffset(0x0F)] public bool Unknown15;
    [FieldOffset(0x10)] public bool Unknown16;
    [FieldOffset(0x11)] public bool Unknown17;
    [FieldOffset(0x12)] public bool Unknown18;
    [FieldOffset(0x13)] public bool Unknown19;
    [FieldOffset(0x14)] public bool Unknown20;
    [FieldOffset(0x15)] public bool Unknown21;
    [FieldOffset(0x16)] public bool Unknown22;
    [FieldOffset(0x17)] public bool Unknown23;
    [FieldOffset(0x18)] public bool Unknown24;
    [FieldOffset(0x19)] public bool Unknown25;
    [FieldOffset(0x1A)] public bool Unknown26;
    [FieldOffset(0x1B)] public bool Unknown27;
    [FieldOffset(0x1C)] public bool Unknown28;
    [FieldOffset(0x1D)] public bool Unknown29;
    [FieldOffset(0x1E)] public bool Unknown30;
    [FieldOffset(0x1F)] public bool Unknown31;
    [FieldOffset(0x20)] public bool Unknown32;
    [FieldOffset(0x21)] public bool Unknown33;
    [FieldOffset(0x22)] public bool Unknown34;
    [FieldOffset(0x23)] public bool Unknown35;
    [FieldOffset(0x24)] public bool Unknown36;
    [FieldOffset(0x25)] public bool Unknown37;
    [FieldOffset(0x26)] public bool Unknown38;
    [FieldOffset(0x27)] public bool Unknown39;
    [FieldOffset(0x28)] public bool Unknown40;
    [FieldOffset(0x29)] public bool Unknown41;
    [FieldOffset(0x2A)] public bool Unknown42;
    [FieldOffset(0x2B)] public bool Unknown43;
    [FieldOffset(0x2C)] public bool Unknown44;
    [FieldOffset(0x2D)] public bool Unknown45;
    [FieldOffset(0x2E)] public bool Unknown46;
    [FieldOffset(0x2F)] public bool Unknown47;
    [FieldOffset(0x30)] public bool Unknown48;
    [FieldOffset(0x31)] public bool Unknown49;
    [FieldOffset(0x32)] public bool Unknown50;
    [FieldOffset(0x33)] public bool Unknown51;
    [FieldOffset(0x34)] public bool Unknown52;
    [FieldOffset(0x35)] public bool Unknown53;
    [FieldOffset(0x36)] public bool Unknown54;
    [FieldOffset(0x37)] public bool Unknown55;
    [FieldOffset(0x38)] public bool Unknown56;
    [FieldOffset(0x39)] public bool Unknown57;
    [FieldOffset(0x3A)] public bool Unknown58;
    [FieldOffset(0x3B)] public bool Unknown59;
    [FieldOffset(0x3C)] public bool Unknown60;
    [FieldOffset(0x3D)] public bool Unknown61;
    [FieldOffset(0x3E)] public bool Unknown62;
    [FieldOffset(0x3F)] public bool Unknown63;
    [FieldOffset(0x40)] public bool Unknown64;
    [FieldOffset(0x41)] public bool Unknown65;
    [FieldOffset(0x42)] public bool Unknown66;
    [FieldOffset(0x43)] public bool Unknown67;
    [FieldOffset(0x44)] public bool Unknown68;
    [FieldOffset(0x45)] public bool Unknown69;
    [FieldOffset(0x46)] public bool Unknown70;
    [FieldOffset(0x47)] public bool Unknown71;
    [FieldOffset(0x48)] public bool Unknown72;
    [FieldOffset(0x49)] public bool Unknown73;
    [FieldOffset(0x4A)] public bool Unknown74;
    [FieldOffset(0x4B)] public bool Unknown75;
    [FieldOffset(0x4C)] public bool Unknown76;
    [FieldOffset(0x4D)] public bool Unknown77;
    [FieldOffset(0x4E)] public bool Unknown78;
    [FieldOffset(0x4F)] public bool Unknown79;
    [FieldOffset(0x50)] public bool Unknown80;
    [FieldOffset(0x51)] public bool Unknown81;
    [FieldOffset(0x52)] public bool Unknown82;
    [FieldOffset(0x53)] public bool Unknown83;
    [FieldOffset(0x54)] public bool Unknown84;
    [FieldOffset(0x55)] public bool Unknown85;
    [FieldOffset(0x56)] public bool Unknown86;
    [FieldOffset(0x57)] public bool Unknown87;
    [FieldOffset(0x58)] public bool Unknown88;
    [FieldOffset(0x59)] public bool Unknown89;
    [FieldOffset(0x5A)] public bool Unknown90;
    [FieldOffset(0x5B)] public bool Unknown91;
    [FieldOffset(0x5C)] public bool Unknown92;
    [FieldOffset(0x5D)] public bool Unknown93;
    [FieldOffset(0x5E)] public bool Unknown94;
    [FieldOffset(0x5F)] public bool Unknown95;
    [FieldOffset(0x60)] public bool Unknown96;
    [FieldOffset(0x61)] public bool Unknown97;
    [FieldOffset(0x62)] public bool Unknown98;
    [FieldOffset(0x63)] public bool Unknown99;
    [FieldOffset(0x64)] public bool Unknown100;
    [FieldOffset(0x65)] public bool Unknown101;
    [FieldOffset(0x66)] public bool Unknown102;
    [FieldOffset(0x67)] public bool Unknown103;
}
