// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x84)]
public unsafe partial struct PetMirage {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public ushort Unknown0;
    [FieldOffset(0x06)] public ushort Unknown1;
    [FieldOffset(0x08)] public ushort Unknown2;
    [FieldOffset(0x0A)] public byte Unknown3;
    [FieldOffset(0x0C)] public ushort Unknown4;
    [FieldOffset(0x0E)] public ushort Unknown5;
    [FieldOffset(0x10)] public ushort Unknown6;
    [FieldOffset(0x12)] public byte Unknown7;
    [FieldOffset(0x14)] public ushort Unknown8;
    [FieldOffset(0x16)] public ushort Unknown9;
    [FieldOffset(0x18)] public ushort Unknown10;
    [FieldOffset(0x1A)] public byte Unknown11;
    [FieldOffset(0x1C)] public ushort Unknown12;
    [FieldOffset(0x1E)] public ushort Unknown13;
    [FieldOffset(0x20)] public ushort Unknown14;
    [FieldOffset(0x22)] public byte Unknown15;
    [FieldOffset(0x24)] public ushort Unknown16;
    [FieldOffset(0x26)] public ushort Unknown17;
    [FieldOffset(0x28)] public ushort Unknown18;
    [FieldOffset(0x2A)] public byte Unknown19;
    [FieldOffset(0x2C)] public ushort Unknown20;
    [FieldOffset(0x2E)] public ushort Unknown21;
    [FieldOffset(0x30)] public ushort Unknown22;
    [FieldOffset(0x32)] public byte Unknown23;
    [FieldOffset(0x34)] public ushort Unknown24;
    [FieldOffset(0x36)] public ushort Unknown25;
    [FieldOffset(0x38)] public ushort Unknown26;
    [FieldOffset(0x3A)] public byte Unknown27;
    [FieldOffset(0x3C)] public ushort Unknown28;
    [FieldOffset(0x3E)] public ushort Unknown29;
    [FieldOffset(0x40)] public ushort Unknown30;
    [FieldOffset(0x42)] public byte Unknown31;
    [FieldOffset(0x44)] public ushort Unknown32;
    [FieldOffset(0x46)] public ushort Unknown33;
    [FieldOffset(0x48)] public ushort Unknown34;
    [FieldOffset(0x4A)] public byte Unknown35;
    [FieldOffset(0x4C)] public ushort Unknown36;
    [FieldOffset(0x4E)] public ushort Unknown37;
    [FieldOffset(0x50)] public ushort Unknown38;
    [FieldOffset(0x52)] public byte Unknown39;
    [FieldOffset(0x54)] public ushort Unknown40;
    [FieldOffset(0x56)] public ushort Unknown41;
    [FieldOffset(0x58)] public ushort Unknown42;
    [FieldOffset(0x5A)] public byte Unknown43;
    [FieldOffset(0x5C)] public ushort Unknown44;
    [FieldOffset(0x5E)] public ushort Unknown45;
    [FieldOffset(0x60)] public ushort Unknown46;
    [FieldOffset(0x62)] public byte Unknown47;
    [FieldOffset(0x64)] public ushort Unknown48;
    [FieldOffset(0x66)] public ushort Unknown49;
    [FieldOffset(0x68)] public ushort Unknown50;
    [FieldOffset(0x6A)] public byte Unknown51;
    [FieldOffset(0x6C)] public ushort Unknown52;
    [FieldOffset(0x6E)] public ushort Unknown53;
    [FieldOffset(0x70)] public ushort Unknown54;
    [FieldOffset(0x72)] public byte Unknown55;
    [FieldOffset(0x74)] public ushort Unknown56;
    [FieldOffset(0x76)] public ushort Unknown57;
    [FieldOffset(0x78)] public ushort Unknown58;
    [FieldOffset(0x7A)] public byte Unknown59;
    [FieldOffset(0x7C)] public float Scale;
    /// <remarks>ModelChara</remarks>
    [FieldOffset(0x80)] public ushort ModelChara;
}
