// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct PhysicsOffGroup {
    [FieldOffset(0x00)] public sbyte Unknown0;
    [FieldOffset(0x01)] public sbyte Unknown1;
    [FieldOffset(0x02)] public sbyte Unknown_70_1;
    [FieldOffset(0x03)] public sbyte Unknown_70_2;
    [FieldOffset(0x04)] public sbyte Unknown_70_3;
    [FieldOffset(0x05)] public sbyte Unknown_70_4;
    [FieldOffset(0x06)] public sbyte Unknown_70_5;
    [FieldOffset(0x07)] public sbyte Unknown_70_6;
    [FieldOffset(0x08)] public sbyte Unknown_70_7;
    [FieldOffset(0x09)] public sbyte Unknown_70_8;
    [FieldOffset(0x0A)] public sbyte Unknown_70_9;
    [FieldOffset(0x0B)] public sbyte Unknown_70_10;
    [FieldOffset(0x0C)] public sbyte Unknown_70_11;
    [FieldOffset(0x0D)] public sbyte Unknown_70_12;
    [FieldOffset(0x0E)] public sbyte Unknown_70_13;
    [FieldOffset(0x0F)] public sbyte Unknown_70_14;
}
