// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct PlaceName {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int NameNoArticle_Offset;
    [FieldOffset(0x08)] public int Unknown0_Offset;
    [FieldOffset(0x0C)] public sbyte Unknown1;
    [FieldOffset(0x0D)] public sbyte Unknown2;
    [FieldOffset(0x0E)] public sbyte Unknown3;
    [FieldOffset(0x0F)] public sbyte Unknown4;
    [FieldOffset(0x10)] public sbyte Unknown5;
    [FieldOffset(0x11)] public sbyte Unknown6;
    [FieldOffset(0x14)] public ushort Unknown7;
    [FieldOffset(0x16)] public byte Unknown8;
    [FieldOffset(0x17)] public byte Unknown9;
}
