// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x40)]
public unsafe partial struct PresetCameraAdjust {
    [FieldOffset(0x00)] public float Hyur_M;
    [FieldOffset(0x04)] public float Hyur_F;
    [FieldOffset(0x08)] public float Elezen_M;
    [FieldOffset(0x0C)] public float Elezen_F;
    [FieldOffset(0x10)] public float Lalafell_M;
    [FieldOffset(0x14)] public float Lalafell_F;
    [FieldOffset(0x18)] public float Miqote_M;
    [FieldOffset(0x1C)] public float Miqote_F;
    [FieldOffset(0x20)] public float Roe_M;
    [FieldOffset(0x24)] public float Roe_F;
    [FieldOffset(0x28)] public float Hrothgar_M;
    [FieldOffset(0x2C)] public float Hrothgar_F;
    [FieldOffset(0x30)] public float Viera_M;
    [FieldOffset(0x34)] public float Viera_F;
    [FieldOffset(0x38)] public float Unknown_70;
    [FieldOffset(0x3C)] public float Unknown0;
}
