// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x4C)]
public unsafe partial struct PresetCamera {
    [FieldOffset(0x00)] public float PosX;
    [FieldOffset(0x04)] public float PosY;
    [FieldOffset(0x08)] public float PosZ;
    [FieldOffset(0x0C)] public float Elezen;
    [FieldOffset(0x10)] public float Lalafell;
    [FieldOffset(0x14)] public float Miqote;
    [FieldOffset(0x18)] public float Roe;
    [FieldOffset(0x1C)] public float Hrothgar;
    [FieldOffset(0x20)] public float Viera;
    [FieldOffset(0x24)] public float Unknown0;
    [FieldOffset(0x28)] public float Hyur_F;
    [FieldOffset(0x2C)] public float Elezen_F;
    [FieldOffset(0x30)] public float Lalafell_F;
    [FieldOffset(0x34)] public float Miqote_F;
    [FieldOffset(0x38)] public float Roe_F;
    [FieldOffset(0x3C)] public float Hrothgar_F;
    [FieldOffset(0x40)] public float Viera_F;
    [FieldOffset(0x44)] public float Unknown_70;
    [FieldOffset(0x48)] public ushort EID;
}
