// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct PublicContent {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public uint MapIcon;
    /// <remarks>PublicContentTextData</remarks>
    [FieldOffset(0x08)] public uint TextDataStart;
    /// <remarks>PublicContentTextData</remarks>
    [FieldOffset(0x0C)] public uint TextDataEnd;
    /// <remarks>PublicContentCutscene</remarks>
    [FieldOffset(0x10)] public uint StartCutscene;
    [FieldOffset(0x14)] public uint LGBEventRange;
    [FieldOffset(0x18)] public uint LGBPopRange;
    /// <remarks>PublicContentCutscene</remarks>
    [FieldOffset(0x1C)] public uint EndCutscene;
    [FieldOffset(0x20)] public ushort TimeLimit;
    /// <remarks>ContentFinderCondition</remarks>
    [FieldOffset(0x22)] public ushort ContentFinderCondition;
    [FieldOffset(0x24)] public ushort AdditionalData;
    [FieldOffset(0x26)] public ushort Unknown0;
    [FieldOffset(0x28)] public ushort Unknown1;
    [FieldOffset(0x2A)] public ushort Unknown2;
    [FieldOffset(0x2C)] public ushort Unknown3;
    [FieldOffset(0x2E)] public byte Type;
    [FieldOffset(0x2F)] public byte Unknown4;
}
