// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct QTE {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1_Offset;
    [FieldOffset(0x08)] public int Unknown2_Offset;
    [FieldOffset(0x0C)] public int Unknown3_Offset;
    [FieldOffset(0x10)] public int Unknown4_Offset;
    [FieldOffset(0x14)] public int Unknown5;
    [FieldOffset(0x18)] public int Unknown6;
    [FieldOffset(0x1C)] public byte Unknown7;
    [FieldOffset(0x1D)] public byte Unknown8;
    [FieldOffset(0x1E)] public byte Unknown9;
    [FieldOffset(0x1F)] public byte Unknown10;
    [FieldOffset(0x20)] public BitField20Flags BitField20;
    public bool Unknown11 => BitField20.HasFlag(BitField20Flags.Unknown11);
    public bool Unknown12 => BitField20.HasFlag(BitField20Flags.Unknown12);
    public bool Unknown13 => BitField20.HasFlag(BitField20Flags.Unknown13);
    public bool Unknown14 => BitField20.HasFlag(BitField20Flags.Unknown14);

    [Flags]
    public enum BitField20Flags : byte {
    	Unknown11 = 1 << 0,
    	Unknown12 = 1 << 1,
    	Unknown13 = 1 << 2,
    	Unknown14 = 1 << 3,
    }
}
