// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x34)]
public unsafe partial struct QuestClassJobReward {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray4<uint> _rewardItem;
    [FieldOffset(0x10), FixedSizeArray] internal FixedSizeArray4<uint> _requiredItem;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x20)] public byte ClassJobCategory;
    [FieldOffset(0x21), FixedSizeArray] internal FixedSizeArray4<byte> _rewardAmount;
    [FieldOffset(0x25), FixedSizeArray] internal FixedSizeArray4<byte> _requiredAmount;
    [FieldOffset(0x29)] public bool Unknown0;
    [FieldOffset(0x2A)] public bool Unknown1;
    [FieldOffset(0x2B)] public bool Unknown2;
    [FieldOffset(0x2C)] public bool Unknown3;
    [FieldOffset(0x2D)] public bool Unknown4;
    [FieldOffset(0x2E)] public bool Unknown5;
    [FieldOffset(0x2F)] public bool Unknown6;
    [FieldOffset(0x30)] public bool Unknown7;
}
