// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct QuestRedoChapterUI {
    [FieldOffset(0x00)] public int ChapterName_Offset;
    [FieldOffset(0x04)] public int ChapterPart_Offset;
    [FieldOffset(0x08)] public int Transient_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x0C)] public uint Quest;
    [FieldOffset(0x10)] public uint Unknown0;
    [FieldOffset(0x14)] public uint QuestRedoUISmall;
    [FieldOffset(0x18)] public uint QuestRedoUILarge;
    [FieldOffset(0x1C)] public uint QuestRedoUIWide;
    /// <remarks>QuestRedoChapterUITab</remarks>
    [FieldOffset(0x20)] public byte UITab;
    /// <remarks>QuestRedoChapterUICategory</remarks>
    [FieldOffset(0x21)] public byte Category;
    [FieldOffset(0x22)] public byte Unknown1;
}
