// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct QuestClassJobSupply {
    [FieldOffset(0x00)] public byte Unknown_70_1;
    /// <remarks>ENpcResident</remarks>
    [FieldOffset(0x04)] public uint ENpcResident;
    /// <remarks>Item</remarks>
    [FieldOffset(0x08)] public uint Item;
    [FieldOffset(0x0C)] public uint Unknown_70_2;
    [FieldOffset(0x10)] public uint Unknown_70_3;
    [FieldOffset(0x14)] public uint Unknown1;
    [FieldOffset(0x18)] public ushort Unknown2;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x1A)] public byte ClassJobCategory;
    [FieldOffset(0x1B)] public byte Unknown0;
    [FieldOffset(0x1C)] public byte AmountRequired;
    [FieldOffset(0x1D)] public bool ItemHQ;
}
