// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe partial struct QuestSubCommand {
    [FieldOffset(0x00)] public uint Unknown0;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public uint Unknown2;
    [FieldOffset(0x0C)] public uint Unknown3;
    [FieldOffset(0x10)] public uint Unknown4;
    [FieldOffset(0x14)] public uint Unknown5;
    [FieldOffset(0x18)] public uint Unknown6;
    [FieldOffset(0x1C)] public uint Unknown7;
    [FieldOffset(0x20)] public byte Unknown8;
    [FieldOffset(0x21)] public byte Unknown9;
    [FieldOffset(0x22)] public byte Unknown10;
    [FieldOffset(0x23)] public byte Unknown11;
    [FieldOffset(0x24)] public byte Unknown12;
    [FieldOffset(0x25)] public byte Unknown13;
    [FieldOffset(0x26)] public byte Unknown14;
    [FieldOffset(0x27)] public byte Unknown15;
    [FieldOffset(0x28)] public byte Unknown16;
    [FieldOffset(0x29)] public byte Unknown17;
    [FieldOffset(0x2A)] public byte Unknown18;
    [FieldOffset(0x2B)] public byte Unknown19;
    [FieldOffset(0x2C)] public byte Unknown20;
    [FieldOffset(0x2D)] public byte Unknown21;
    [FieldOffset(0x2E)] public byte Unknown22;
    [FieldOffset(0x2F)] public byte Unknown23;
}
