// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
public unsafe partial struct Race {
    [FieldOffset(0x00)] public int Masculine_Offset;
    [FieldOffset(0x04)] public int Feminine_Offset;
    /// <remarks>Item</remarks>
    [FieldOffset(0x08)] public int RSEMBody;
    /// <remarks>Item</remarks>
    [FieldOffset(0x0C)] public int RSEFBody;
    /// <remarks>Item</remarks>
    [FieldOffset(0x10)] public int RSEMHands;
    /// <remarks>Item</remarks>
    [FieldOffset(0x14)] public int RSEFHands;
    /// <remarks>Item</remarks>
    [FieldOffset(0x18)] public int RSEMLegs;
    /// <remarks>Item</remarks>
    [FieldOffset(0x1C)] public int RSEFLegs;
    /// <remarks>Item</remarks>
    [FieldOffset(0x20)] public int RSEMFeet;
    /// <remarks>Item</remarks>
    [FieldOffset(0x24)] public int RSEFFeet;
    [FieldOffset(0x28)] public byte Unknown0;
    /// <remarks>ExVersion</remarks>
    [FieldOffset(0x29)] public byte ExPac;
}
