// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct RecipeLevelTable {
    [FieldOffset(0x00)] public uint Quality;
    [FieldOffset(0x04)] public ushort SuggestedCraftsmanship;
    [FieldOffset(0x06)] public ushort Difficulty;
    [FieldOffset(0x08)] public ushort Durability;
    [FieldOffset(0x0A)] public ushort ConditionsFlag;
    [FieldOffset(0x0C)] public byte ClassJobLevel;
    [FieldOffset(0x0D)] public byte Stars;
    [FieldOffset(0x0E)] public byte ProgressDivider;
    [FieldOffset(0x0F)] public byte QualityDivider;
    [FieldOffset(0x10)] public byte ProgressModifier;
    [FieldOffset(0x11)] public byte QualityModifier;
}
