// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct Relic {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint ItemAtma;
    /// <remarks>Item</remarks>
    [FieldOffset(0x04)] public uint ItemAnimus;
    [FieldOffset(0x08)] public int Icon;
    /// <remarks>Materia</remarks>
    [FieldOffset(0x0C)] public ushort Materia0;
    /// <remarks>Materia</remarks>
    [FieldOffset(0x0E)] public ushort Materia1;
    /// <remarks>Materia</remarks>
    [FieldOffset(0x10)] public ushort Materia2;
    /// <remarks>Materia</remarks>
    [FieldOffset(0x12)] public ushort Materia3;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x14)] public byte NoteMain0;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x15)] public byte NoteSub0;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x16)] public byte NoteSelection10;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x17)] public byte NoteMain1;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x18)] public byte NoteSub1;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x19)] public byte NoteSelection1;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x1A)] public byte NoteMain2;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x1B)] public byte NoteSub2;
    /// <remarks>RelicNote</remarks>
    [FieldOffset(0x1C)] public byte NoteSelection3;
}
