// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x0C)]
public unsafe partial struct Relic3Rate {
    [FieldOffset(0x00)] public sbyte Unknown0;
    [FieldOffset(0x01)] public sbyte Unknown1;
    [FieldOffset(0x02)] public sbyte Unknown2;
    [FieldOffset(0x03)] public sbyte Unknown3;
    [FieldOffset(0x04)] public sbyte Unknown4;
    [FieldOffset(0x05)] public sbyte Unknown5;
    [FieldOffset(0x06)] public sbyte Unknown6;
    [FieldOffset(0x07)] public sbyte Unknown7;
    [FieldOffset(0x08)] public sbyte Unknown8;
}
