// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x44)]
public unsafe partial struct RelicItem {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public uint GladiatorItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x04)] public uint PugilistItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x08)] public uint MarauderItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x0C)] public uint LancerItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x10)] public uint ArcherItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x14)] public uint ConjurerItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x18)] public uint ThaumaturgeItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x1C)] public uint ArcanistSMNItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x20)] public uint ArcanistSCHItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x24)] public uint ShieldItem;
    /// <remarks>Item</remarks>
    [FieldOffset(0x28)] public uint RogueItem;
    [FieldOffset(0x2C)] public uint Unknown0;
    [FieldOffset(0x30)] public uint Unknown1;
    [FieldOffset(0x34)] public uint Unknown2;
    [FieldOffset(0x38)] public uint Unknown3;
    [FieldOffset(0x3C)] public uint Unknown4;
    [FieldOffset(0x40)] public byte Unknown5;
}
