// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct Relic3Materia {
    [FieldOffset(0x00)] public ushort Unknown0;
    [FieldOffset(0x02)] public ushort Unknown1;
    [FieldOffset(0x04)] public ushort Unknown2;
    [FieldOffset(0x06)] public ushort Unknown3;
    [FieldOffset(0x08)] public ushort Unknown4;
    [FieldOffset(0x0A)] public ushort Unknown5;
    [FieldOffset(0x0C)] public sbyte Unknown6;
    [FieldOffset(0x0D)] public sbyte Unknown7;
    [FieldOffset(0x0E)] public sbyte Unknown8;
}
