// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct ReplaceAction {
    /// <remarks>Action</remarks>
    [FieldOffset(0x00)] public int Action;
    [FieldOffset(0x04), FixedSizeArray] internal FixedSizeArray3<int> _replaceActions;
    [FieldOffset(0x10)] public short Param1;
    [FieldOffset(0x12)] public short Param2;
    [FieldOffset(0x14)] public short Param3;
    [FieldOffset(0x16)] public sbyte Type1;
    [FieldOffset(0x17)] public sbyte Type2;
    [FieldOffset(0x18)] public sbyte Type3;
    [FieldOffset(0x19)] public sbyte ReplaceSettable;
    [FieldOffset(0x1A)] public bool Unknown_70;
}
