// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct RetainerTask {
    [FieldOffset(0x00)] public int Experience;
    [FieldOffset(0x04)] public ushort Unknown0;
    /// <remarks>RetainerTaskParameter</remarks>
    [FieldOffset(0x06)] public ushort RetainerTaskParameter;
    [FieldOffset(0x08)] public ushort VentureCost;
    [FieldOffset(0x0A)] public ushort MaxTimemin;
    [FieldOffset(0x0C)] public ushort RequiredItemLevel;
    [FieldOffset(0x0E)] public ushort RequiredGathering;
    [FieldOffset(0x10)] public ushort Unknown1;
    /// <remarks>RetainerTaskNormal, RetainerTaskRandom</remarks>
    [FieldOffset(0x12)] public ushort Task;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x14)] public byte ClassJobCategory;
    [FieldOffset(0x15)] public byte RetainerLevel;
    [FieldOffset(0x16)] public byte ConditionParam0;
    [FieldOffset(0x17)] public byte ConditionParam1;
    [FieldOffset(0x18)] public bool IsRandom;
}
