// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x14C)]
public unsafe partial struct RideShooting {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray8<RideShootingParamsStruct> _rideShootingParams;
    /// <remarks>GFateRideShooting</remarks>
    [FieldOffset(0x140)] public ushort GFateRideShooting;
    [FieldOffset(0x142)] public ushort Unknown0;
    [FieldOffset(0x144)] public ushort Unknown1;
    /// <remarks>RideShootingTextData</remarks>
    [FieldOffset(0x146)] public ushort StartText;
    [FieldOffset(0x148)] public short Unknown2;
    [FieldOffset(0x14A)] public short Unknown3;

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public partial struct RideShootingParamsStruct {
        [FieldOffset(0x00)] public uint Unknown0;
        [FieldOffset(0x04)] public uint PopRange;
        /// <remarks>ENpcBase</remarks>
        [FieldOffset(0x08)] public uint ENpc;
        [FieldOffset(0x0C)] public uint Unknown1;
        [FieldOffset(0x10)] public uint Unknown2;
        [FieldOffset(0x14)] public uint Unknown3;
        [FieldOffset(0x18)] public uint Unknown4;
        [FieldOffset(0x1C)] public uint Unknown5;
        [FieldOffset(0x20)] public byte ENpcScale;
        [FieldOffset(0x21)] public byte Unknown6;
        [FieldOffset(0x22)] public byte Unknown7;
        [FieldOffset(0x23)] public byte Unknown8;
        [FieldOffset(0x24)] public byte Unknown9;
        [FieldOffset(0x25)] public byte Unknown10;
    }
}
