// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct SatisfactionSupply {
    /// <remarks>Item</remarks>
    [FieldOffset(0x00)] public int Item;
    [FieldOffset(0x04)] public ushort CollectabilityLow;
    [FieldOffset(0x06)] public ushort CollectabilityMid;
    [FieldOffset(0x08)] public ushort CollectabilityHigh;
    /// <remarks>SatisfactionSupplyReward</remarks>
    [FieldOffset(0x0A)] public ushort Reward;
    [FieldOffset(0x0C)] public ushort Unknown0;
    [FieldOffset(0x0E)] public ushort Unknown1;
    [FieldOffset(0x10)] public byte Slot;
    [FieldOffset(0x11)] public byte ProbabilityPercent;
    [FieldOffset(0x12)] public bool Unknown2;
}
