// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct SatisfactionSupplyReward {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray2<SatisfactionSupplyRewardDataStruct> _satisfactionSupplyRewardData;
    [FieldOffset(0x10)] public ushort SatisfactionLow;
    [FieldOffset(0x12)] public ushort SatisfactionMid;
    [FieldOffset(0x14)] public ushort SatisfactionHigh;
    [FieldOffset(0x16)] public ushort GilLow;
    [FieldOffset(0x18)] public ushort GilMid;
    [FieldOffset(0x1A)] public ushort GilHigh;
    [FieldOffset(0x1C)] public byte Unknown0;
    [FieldOffset(0x1D)] public byte Unknown1;

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public partial struct SatisfactionSupplyRewardDataStruct {
        [FieldOffset(0x00)] public ushort RewardCurrency;
        [FieldOffset(0x02)] public ushort QuantityLow;
        [FieldOffset(0x04)] public ushort QuantityMid;
        [FieldOffset(0x06)] public ushort QuantityHigh;
    }
}
