// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x50)]
public unsafe partial struct SharlayanCraftWorksSupply {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray4<ItemStruct> _item;

    [StructLayout(LayoutKind.Explicit, Size = 0x14)]
    public partial struct ItemStruct {
        [FieldOffset(0x00)] public uint Id;
        [FieldOffset(0x04)] public uint XPReward;
        [FieldOffset(0x08)] public ushort CollectabilityMid;
        [FieldOffset(0x0A)] public ushort CollectabilityHigh;
        [FieldOffset(0x0C)] public ushort GilReward;
        [FieldOffset(0x0E)] public byte Level;
        [FieldOffset(0x0F)] public byte HighXPMultiplier;
        [FieldOffset(0x10)] public byte HighGilMultiplier;
        [FieldOffset(0x11)] public byte Unknown8;
        [FieldOffset(0x12)] public byte ScripReward;
        [FieldOffset(0x13)] public byte HighScripMultiplier;
    }
}
