// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x40)]
public unsafe partial struct ShellFixedFromCommand {
    [FieldOffset(0x00)] public ulong Unknown0;
    [FieldOffset(0x08)] public ulong Unknown1;
    [FieldOffset(0x10)] public ulong Unknown2;
    [FieldOffset(0x18)] public ulong Unknown3;
    [FieldOffset(0x20)] public ulong Unknown4;
    [FieldOffset(0x28)] public uint Unknown5;
    [FieldOffset(0x2C)] public uint Unknown6;
    [FieldOffset(0x30)] public uint Unknown7;
    [FieldOffset(0x34)] public byte Unknown8;
    [FieldOffset(0x35)] public byte Unknown9;
    [FieldOffset(0x36)] public byte Unknown10;
    [FieldOffset(0x37)] public byte Unknown11;
    [FieldOffset(0x38)] public byte Unknown12;
    [FieldOffset(0x39)] public byte Unknown13;
    [FieldOffset(0x3A)] public byte Unknown14;
    [FieldOffset(0x3B)] public byte Unknown15;
    [FieldOffset(0x3C)] public byte Unknown16;
    [FieldOffset(0x3D)] public byte Unknown17;
    [FieldOffset(0x3E)] public BitField3EFlags BitField3E;
    public bool Unknown18 => BitField3E.HasFlag(BitField3EFlags.Unknown18);
    public bool Unknown19 => BitField3E.HasFlag(BitField3EFlags.Unknown19);
    public bool Unknown20 => BitField3E.HasFlag(BitField3EFlags.Unknown20);
    public bool Unknown21 => BitField3E.HasFlag(BitField3EFlags.Unknown21);

    [Flags]
    public enum BitField3EFlags : byte {
    	Unknown18 = 1 << 0,
    	Unknown19 = 1 << 1,
    	Unknown20 = 1 << 2,
    	Unknown21 = 1 << 3,
    }
}
