// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x4C)]
public unsafe partial struct SkyIsland2Mission {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1_Offset;
    [FieldOffset(0x08)] public int Unknown2_Offset;
    [FieldOffset(0x0C)] public int Unknown3_Offset;
    [FieldOffset(0x10)] public int Unknown4_Offset;
    /// <remarks>EventItem</remarks>
    [FieldOffset(0x14)] public uint Item1;
    /// <remarks>EventItem</remarks>
    [FieldOffset(0x18)] public uint Item2;
    [FieldOffset(0x1C)] public uint PopRange0;
    [FieldOffset(0x20)] public uint PopRange1;
    [FieldOffset(0x24)] public uint PopRange2;
    [FieldOffset(0x28)] public uint Unknown5;
    [FieldOffset(0x2C)] public uint Unknown6;
    [FieldOffset(0x30)] public uint Unknown7;
    [FieldOffset(0x34)] public uint Unknown8;
    [FieldOffset(0x38)] public uint Image;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x3C)] public ushort PlaceName;
    [FieldOffset(0x3E)] public ushort Unknown9;
    /// <remarks>SkyIsland2MissionDetail</remarks>
    [FieldOffset(0x40)] public ushort Objective1;
    /// <remarks>SkyIsland2MissionDetail</remarks>
    [FieldOffset(0x42)] public ushort Objective2;
    /// <remarks>SkyIsland2MissionDetail</remarks>
    [FieldOffset(0x44)] public ushort Objective3;
    [FieldOffset(0x46)] public byte RequiredAmount1;
    [FieldOffset(0x47)] public byte RequiredAmount2;
    [FieldOffset(0x48)] public byte Unknown10;
    [FieldOffset(0x49)] public byte Unknown11;
    [FieldOffset(0x4A)] public byte Unknown12;
    [FieldOffset(0x4B)] public byte Unknown13;
}
