// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct SkyIsland2MissionDetail {
    [FieldOffset(0x00)] public int Objective_Offset;
    [FieldOffset(0x04)] public int Unknown0_Offset;
    [FieldOffset(0x08)] public int Unknown1_Offset;
    [FieldOffset(0x0C)] public int Unknown2_Offset;
    /// <remarks>EObjName</remarks>
    [FieldOffset(0x10)] public uint EObj;
    [FieldOffset(0x14)] public uint Unknown3;
    [FieldOffset(0x18)] public uint Unknown4;
    /// <remarks>SkyIsland2MissionType</remarks>
    [FieldOffset(0x1C)] public byte Type;
    [FieldOffset(0x1D)] public byte Unknown5;
    /// <remarks>SkyIsland2RangeType</remarks>
    [FieldOffset(0x1E)] public byte Range;
    [FieldOffset(0x1F)] public sbyte Unknown6;
}
