// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct SkyIslandMapMarker {
    [FieldOffset(0x00)] public short Unknown0;
    [FieldOffset(0x02)] public short Unknown1;
    [FieldOffset(0x04)] public short Unknown2;
    [FieldOffset(0x06)] public short Unknown3;
    [FieldOffset(0x08)] public short Unknown4;
    [FieldOffset(0x0A)] public short Unknown5;
    [FieldOffset(0x0C)] public short Unknown6;
    [FieldOffset(0x0E)] public short Unknown7;
    [FieldOffset(0x10)] public short Unknown8;
    [FieldOffset(0x12)] public short Unknown9;
    [FieldOffset(0x14)] public short Unknown10;
    [FieldOffset(0x16)] public short Unknown11;
    [FieldOffset(0x18)] public byte Unknown12;
    [FieldOffset(0x19)] public byte Unknown13;
    [FieldOffset(0x1A)] public byte Unknown14;
    [FieldOffset(0x1B)] public byte Unknown15;
    [FieldOffset(0x1C)] public byte Unknown16;
}
