// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x118)]
public unsafe partial struct Snipe {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray8<SnipeDataStruct> _snipeData;
    [FieldOffset(0x80), FixedSizeArray] internal FixedSizeArray8<uint> _eventNPC;
    [FieldOffset(0xA0)] public uint Unknown0;
    [FieldOffset(0xA4)] public ushort Unknown1;
    [FieldOffset(0xA6)] public byte Unknown2;
    [FieldOffset(0xA8)] public uint Unknown3;
    [FieldOffset(0xAC)] public ushort Unknown4;
    [FieldOffset(0xAE)] public byte Unknown5;
    [FieldOffset(0xB0)] public uint Unknown6;
    [FieldOffset(0xB4)] public ushort Unknown7;
    [FieldOffset(0xB6)] public byte Unknown8;
    [FieldOffset(0xB8)] public uint Unknown9;
    [FieldOffset(0xBC)] public ushort Unknown10;
    [FieldOffset(0xBE)] public byte Unknown11;
    [FieldOffset(0xC0)] public int Objective0_Offset;
    [FieldOffset(0xC4)] public int Hint0_Offset;
    [FieldOffset(0xC8)] public int Objective1_Offset;
    [FieldOffset(0xCC)] public int Hint1_Offset;
    [FieldOffset(0xD0)] public int Unknown12_Offset;
    [FieldOffset(0xD4)] public int Unknown13_Offset;
    [FieldOffset(0xD8)] public int Unknown14_Offset;
    [FieldOffset(0xDC)] public int Unknown15_Offset;
    [FieldOffset(0xE0)] public int Unknown16_Offset;
    [FieldOffset(0xE4)] public int Unknown17_Offset;
    [FieldOffset(0xE8)] public int Unknown18_Offset;
    [FieldOffset(0xEC)] public int ActionText_Offset;
    [FieldOffset(0xF0)] public byte Unknown19;
    [FieldOffset(0xF1)] public byte Unknown20;
    [FieldOffset(0xF4)] public int VFXFire_Offset;
    [FieldOffset(0xF8)] public int VFXHit_Offset;
    [FieldOffset(0xFC)] public int VFXMiss_Offset;
    [FieldOffset(0x100)] public int VFXAdditional_Offset;
    [FieldOffset(0x104)] public uint LGBTargetMarker;
    [FieldOffset(0x108)] public ushort Unknown21;
    [FieldOffset(0x10A)] public ushort Unknown22;
    [FieldOffset(0x10C)] public ushort Unknown23;
    [FieldOffset(0x10E)] public byte Unknown24;
    [FieldOffset(0x10F)] public byte Unknown25;
    [FieldOffset(0x110)] public byte Unknown26;
    [FieldOffset(0x111)] public byte Unknown27;
    [FieldOffset(0x112)] public byte Unknown28;
    [FieldOffset(0x113)] public byte Unknown29;
    [FieldOffset(0x114)] public byte Unknown30;
    [FieldOffset(0x115)] public BitField115Flags BitField115;
    public bool Unknown31 => BitField115.HasFlag(BitField115Flags.Unknown31);
    public bool Unknown32 => BitField115.HasFlag(BitField115Flags.Unknown32);

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public partial struct SnipeDataStruct {
        [FieldOffset(0x00)] public uint DataEventNPC;
        [FieldOffset(0x04)] public ushort Unknown0;
        [FieldOffset(0x06)] public ushort Unknown1;
        [FieldOffset(0x08)] public ushort Unknown2;
        [FieldOffset(0x0A)] public ushort Unknown3;
        [FieldOffset(0x0C)] public byte Unknown4;
        [FieldOffset(0x0D)] public byte Unknown5;
    }
    [Flags]
    public enum BitField115Flags : byte {
    	Unknown31 = 1 << 0,
    	Unknown32 = 1 << 1,
    }
}
