// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct SnipePerformanceCamera {
    [FieldOffset(0x00)] public ushort Unknown0;
    [FieldOffset(0x02)] public ushort Unknown1;
    [FieldOffset(0x04)] public ushort Unknown2;
    [FieldOffset(0x06)] public short Unknown3;
    [FieldOffset(0x08)] public short Unknown4;
    [FieldOffset(0x0A)] public short Unknown5;
    [FieldOffset(0x0C)] public short Unknown6;
    [FieldOffset(0x0E)] public short Unknown7;
    [FieldOffset(0x10)] public short Unknown8;
    [FieldOffset(0x12)] public byte Unknown9;
}
