// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct SpearfishingNotebook {
    /// <remarks>TerritoryType</remarks>
    [FieldOffset(0x00)] public int TerritoryType;
    [FieldOffset(0x04)] public ushort Radius;
    /// <remarks>PlaceName</remarks>
    [FieldOffset(0x06)] public ushort PlaceName;
    /// <remarks>GatheringPointBase</remarks>
    [FieldOffset(0x08)] public ushort GatheringPointBase;
    [FieldOffset(0x0A)] public ushort Unknown0;
    [FieldOffset(0x0C)] public ushort Unknown1;
    [FieldOffset(0x0E)] public short X;
    [FieldOffset(0x10)] public short Y;
    [FieldOffset(0x12)] public byte GatheringLevel;
    [FieldOffset(0x13)] public byte Unknown2;
    [FieldOffset(0x14)] public byte Unknown3;
    [FieldOffset(0x15)] public bool IsShadowNode;
}
