// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0xA4)]
public unsafe partial struct Spectator {
    [FieldOffset(0x00)] public float Unknown0;
    [FieldOffset(0x04)] public float Unknown1;
    [FieldOffset(0x08)] public float Unknown2;
    [FieldOffset(0x0C)] public float Unknown3;
    [FieldOffset(0x10)] public float Unknown4;
    [FieldOffset(0x14)] public float Unknown5;
    [FieldOffset(0x18)] public float Unknown6;
    [FieldOffset(0x1C)] public float Unknown7;
    [FieldOffset(0x20)] public float Unknown8;
    [FieldOffset(0x24)] public float Unknown9;
    [FieldOffset(0x28)] public float Unknown10;
    [FieldOffset(0x2C)] public float Unknown11;
    [FieldOffset(0x30)] public float Unknown12;
    [FieldOffset(0x34)] public float Unknown13;
    [FieldOffset(0x38)] public float Unknown14;
    [FieldOffset(0x3C)] public float Unknown15;
    [FieldOffset(0x40)] public float Unknown16;
    [FieldOffset(0x44)] public float Unknown17;
    [FieldOffset(0x48)] public float Unknown18;
    [FieldOffset(0x4C)] public float Unknown19;
    [FieldOffset(0x50)] public float Unknown20;
    [FieldOffset(0x54)] public float Unknown21;
    [FieldOffset(0x58)] public float Unknown22;
    [FieldOffset(0x5C)] public float Unknown23;
    [FieldOffset(0x60)] public float Unknown24;
    [FieldOffset(0x64)] public float Unknown25;
    [FieldOffset(0x68)] public float Unknown26;
    [FieldOffset(0x6C)] public float Unknown27;
    [FieldOffset(0x70)] public float Unknown28;
    [FieldOffset(0x74)] public float Unknown29;
    [FieldOffset(0x78)] public float Unknown30;
    [FieldOffset(0x7C)] public float Unknown31;
    [FieldOffset(0x80)] public float Unknown32;
    [FieldOffset(0x84)] public float Unknown33;
    [FieldOffset(0x88)] public float Unknown34;
    [FieldOffset(0x8C)] public float Unknown35;
    [FieldOffset(0x90)] public float Unknown36;
    [FieldOffset(0x94)] public float Unknown37;
    [FieldOffset(0x98)] public float Unknown38;
    [FieldOffset(0x9C)] public float Unknown39;
    [FieldOffset(0xA0)] public byte Unknown40;
}
