// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x16A0)]
public unsafe partial struct SpecialShop {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04), FixedSizeArray] internal FixedSizeArray60<ItemStruct> _item;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x1684)] public uint Quest;
    [FieldOffset(0x1688)] public uint Unknown0;
    [FieldOffset(0x168C)] public uint Unknown1;
    [FieldOffset(0x1690)] public int CompleteText;
    [FieldOffset(0x1694)] public int NotCompleteText;
    [FieldOffset(0x1698)] public ushort Unknown2;
    [FieldOffset(0x169A)] public ushort Unknown5;
    [FieldOffset(0x169C)] public byte UseCurrencyType;
    [FieldOffset(0x169D)] public BitField169DFlags BitField169D;
    public bool Unknown3 => BitField169D.HasFlag(BitField169DFlags.Unknown3);
    public bool Unknown4 => BitField169D.HasFlag(BitField169DFlags.Unknown4);

    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x60)]
    public partial struct ItemStruct {
        [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray2<uint> _receiveCount;
        [FieldOffset(0x08), FixedSizeArray] internal FixedSizeArray3<uint> _currencyCost;
        [FieldOffset(0x14), FixedSizeArray] internal FixedSizeArray2<int> _item;
        [FieldOffset(0x1C), FixedSizeArray] internal FixedSizeArray2<int> _category;
        [FieldOffset(0x24), FixedSizeArray] internal FixedSizeArray3<int> _itemCost;
        /// <remarks>Quest</remarks>
        [FieldOffset(0x30)] public int Quest;
        [FieldOffset(0x34), FixedSizeArray] internal FixedSizeArray4<int> _unknown0;
        /// <remarks>Achievement</remarks>
        [FieldOffset(0x44)] public int AchievementUnlock;
        [FieldOffset(0x48)] public int Unknown2;
        [FieldOffset(0x4C), FixedSizeArray] internal FixedSizeArray3<ushort> _collectabilityCost;
        [FieldOffset(0x52)] public ushort PatchNumber;
        [FieldOffset(0x54), FixedSizeArray] internal FixedSizeArray3<byte> _hqCost;
        [FieldOffset(0x57), FixedSizeArray] internal FixedSizeArray6<byte> _unknown1;
        [FieldOffset(0x5D), FixedSizeArray] internal FixedSizeArray2<bool> _receiveHq;
    }
    [Flags]
    public enum BitField169DFlags : byte {
    	Unknown3 = 1 << 0,
    	Unknown4 = 1 << 1,
    }
}
