// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x14F8)]
public unsafe partial struct Story {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray40<StoryParamsStruct> _storyParams;
    [FieldOffset(0x140), FixedSizeArray] internal FixedSizeArray110<StoryDefineStruct> _storyDefine;
    [FieldOffset(0x1270), FixedSizeArray] internal FixedSizeArray80<StoryListenerStruct> _storyListener;
    [FieldOffset(0x14F0)] public int Script_Offset;
    [FieldOffset(0x14F4), FixedSizeArray] internal FixedSizeArray2<ushort> _layerSetTerritoryType;

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public partial struct StoryParamsStruct {
        [FieldOffset(0x00)] public int Instruction_Offset;
        [FieldOffset(0x04)] public uint Argument;
    }
    [GenerateInterop]
    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public partial struct StoryDefineStruct {
        [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray3<uint> _completedQuest;
        [FieldOffset(0x0C), FixedSizeArray] internal FixedSizeArray3<uint> _acceptedQuest;
        [FieldOffset(0x18), FixedSizeArray] internal FixedSizeArray2<uint> _layerSet;
        [FieldOffset(0x20)] public ushort Sequence;
        [FieldOffset(0x22)] public byte CompletedQuestOperator;
        [FieldOffset(0x23)] public byte AcceptedQuestOperator;
        [FieldOffset(0x24), FixedSizeArray] internal FixedSizeArray3<byte> _acceptedQuestSequence;
    }
    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public partial struct StoryListenerStruct {
        /// <remarks>EObjName, ENpcResident</remarks>
        [FieldOffset(0x00)] public uint Listener;
        [FieldOffset(0x04)] public ushort SequenceBegin;
        [FieldOffset(0x06)] public ushort SequenceEnd;
    }
}
