// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct SubmarinePart {
    [FieldOffset(0x00)] public ushort Class;
    [FieldOffset(0x02)] public short Surveillance;
    [FieldOffset(0x04)] public short Retrieval;
    [FieldOffset(0x06)] public short Speed;
    [FieldOffset(0x08)] public short Range;
    [FieldOffset(0x0A)] public short Favor;
    [FieldOffset(0x0C)] public byte Slot;
    [FieldOffset(0x0D)] public byte Rank;
    [FieldOffset(0x0E)] public byte Components;
    [FieldOffset(0x0F)] public byte RepairMaterials;
}
