// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct SubmarineExploration {
    [FieldOffset(0x00)] public int Destination_Offset;
    [FieldOffset(0x04)] public int Location_Offset;
    [FieldOffset(0x08)] public uint ExpReward;
    [FieldOffset(0x0C)] public ushort SurveyDurationmin;
    [FieldOffset(0x0E)] public short X;
    [FieldOffset(0x10)] public short Y;
    [FieldOffset(0x12)] public short Z;
    /// <remarks>SubmarineMap</remarks>
    [FieldOffset(0x14)] public byte Map;
    [FieldOffset(0x15)] public byte Stars;
    [FieldOffset(0x16)] public byte RankReq;
    [FieldOffset(0x17)] public byte CeruleumTankReq;
    [FieldOffset(0x18)] public byte SurveyDistance;
    [FieldOffset(0x19)] public bool StartingPoint;
}
