// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct SystemGraphicPreset {
    [FieldOffset(0x00)] public sbyte Unknown0;
    [FieldOffset(0x01)] public sbyte Unknown1;
    [FieldOffset(0x02)] public sbyte Unknown2;
    [FieldOffset(0x03)] public sbyte Unknown3;
    [FieldOffset(0x04)] public sbyte Unknown4;
    [FieldOffset(0x05)] public sbyte Unknown5;
    [FieldOffset(0x06)] public sbyte Unknown6;
    [FieldOffset(0x07)] public sbyte Unknown7;
    [FieldOffset(0x08)] public sbyte Unknown8;
    [FieldOffset(0x09)] public sbyte Unknown9;
    [FieldOffset(0x0A)] public sbyte Unknown10;
    [FieldOffset(0x0B)] public sbyte Unknown11;
    [FieldOffset(0x0C)] public sbyte Unknown12;
    [FieldOffset(0x0D)] public sbyte Unknown13;
    [FieldOffset(0x0E)] public sbyte Unknown14;
    [FieldOffset(0x0F)] public sbyte Unknown15;
    [FieldOffset(0x10)] public sbyte Unknown16;
    [FieldOffset(0x11)] public sbyte Unknown17;
    [FieldOffset(0x12)] public sbyte Unknown18;
    [FieldOffset(0x13)] public sbyte Unknown19;
    [FieldOffset(0x14)] public sbyte Unknown20;
    [FieldOffset(0x15)] public sbyte Unknown21;
    [FieldOffset(0x16)] public sbyte Unknown22;
    [FieldOffset(0x17)] public sbyte Unknown23;
    [FieldOffset(0x18)] public sbyte Unknown24;
    [FieldOffset(0x19)] public sbyte Unknown25;
    [FieldOffset(0x1A)] public sbyte Unknown26;
    [FieldOffset(0x1B)] public sbyte Unknown27;
    [FieldOffset(0x1C)] public sbyte Unknown28;
    [FieldOffset(0x1D)] public sbyte Unknown29;
    [FieldOffset(0x1E)] public sbyte Unknown30;
    [FieldOffset(0x1F)] public sbyte Unknown31;
    [FieldOffset(0x20)] public sbyte Unknown32;
    [FieldOffset(0x21)] public sbyte Unknown_70_1;
    [FieldOffset(0x22)] public sbyte Unknown_70_2;
    [FieldOffset(0x23)] public sbyte Unknown_70_3;
    [FieldOffset(0x24)] public sbyte Unknown_70_4;
    [FieldOffset(0x25)] public sbyte Unknown_70_5;
    [FieldOffset(0x26)] public sbyte Unknown_70_6;
    [FieldOffset(0x27)] public sbyte Unknown_70_7;
}
