// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x20)]
public unsafe partial struct TextCommand {
    [FieldOffset(0x00)] public int Description_Offset;
    [FieldOffset(0x04)] public int Alias_Offset;
    [FieldOffset(0x08)] public int ShortAlias_Offset;
    [FieldOffset(0x0C)] public int Command_Offset;
    [FieldOffset(0x10)] public int ShortCommand_Offset;
    [FieldOffset(0x14)] public uint Unknown0;
    /// <remarks>TextCommandParam</remarks>
    [FieldOffset(0x18)] public ushort Param;
    [FieldOffset(0x1A)] public byte Unknown1;
    [FieldOffset(0x1B)] public byte Unknown2;
    [FieldOffset(0x1C)] public sbyte Unknown3;
    [FieldOffset(0x1D)] public sbyte Unknown4;
    [FieldOffset(0x1E)] public sbyte Unknown5;
}
