// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x28)]
public unsafe partial struct TofuObject {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public uint Unknown1;
    [FieldOffset(0x08)] public int Unknown2;
    [FieldOffset(0x0C)] public int Unknown3;
    [FieldOffset(0x10)] public int Unknown4;
    [FieldOffset(0x14)] public int Unknown5;
    [FieldOffset(0x18)] public int Unknown6;
    [FieldOffset(0x1C)] public ushort Unknown7;
    [FieldOffset(0x1E)] public ushort Unknown8;
    [FieldOffset(0x20)] public ushort Unknown9;
    [FieldOffset(0x22)] public byte Unknown10;
    [FieldOffset(0x23)] public byte Unknown11;
    [FieldOffset(0x24)] public byte Unknown12;
    [FieldOffset(0x25)] public BitField25Flags BitField25;
    public bool Unknown13 => BitField25.HasFlag(BitField25Flags.Unknown13);
    public bool Unknown14 => BitField25.HasFlag(BitField25Flags.Unknown14);
    public bool Unknown15 => BitField25.HasFlag(BitField25Flags.Unknown15);

    [Flags]
    public enum BitField25Flags : byte {
    	Unknown13 = 1 << 0,
    	Unknown14 = 1 << 1,
    	Unknown15 = 1 << 2,
    }
}
