// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x34)]
public unsafe partial struct TofuPreset {
    [FieldOffset(0x00)] public int Unknown0_Offset;
    [FieldOffset(0x04)] public int Unknown1;
    [FieldOffset(0x08)] public int Unknown2;
    [FieldOffset(0x0C)] public int Unknown3;
    [FieldOffset(0x10)] public int Unknown4;
    [FieldOffset(0x14)] public int Unknown5;
    [FieldOffset(0x18)] public int Unknown6;
    [FieldOffset(0x1C)] public int Unknown7;
    [FieldOffset(0x20)] public int Unknown8;
    [FieldOffset(0x24)] public int Unknown9;
    [FieldOffset(0x28)] public int Unknown10;
    [FieldOffset(0x2C)] public int Unknown11;
    [FieldOffset(0x30)] public ushort Unknown12;
    [FieldOffset(0x32)] public bool Unknown13;
}
