// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct Trait {
    [FieldOffset(0x00)] public int Name_Offset;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x04)] public uint Quest;
    [FieldOffset(0x08)] public int Icon;
    [FieldOffset(0x0C)] public short Value;
    /// <remarks>ClassJob</remarks>
    [FieldOffset(0x0E)] public byte ClassJob;
    [FieldOffset(0x0F)] public byte Unknown_70;
    [FieldOffset(0x10)] public byte Level;
    /// <remarks>ClassJobCategory</remarks>
    [FieldOffset(0x11)] public byte ClassJobCategory;
    [FieldOffset(0x12)] public byte Unknown0;
}
