// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe partial struct TreasureHuntRank {
    [FieldOffset(0x00)] public uint Icon;
    /// <remarks>Item</remarks>
    [FieldOffset(0x04)] public int ItemName;
    /// <remarks>EventItem</remarks>
    [FieldOffset(0x08)] public int KeyItemName;
    /// <remarks>EventItem</remarks>
    [FieldOffset(0x0C)] public int InstanceMap;
    [FieldOffset(0x10)] public ushort Unknown0;
    [FieldOffset(0x12)] public byte Unknown1;
    [FieldOffset(0x13)] public byte MaxPartySize;
    [FieldOffset(0x14)] public byte TreasureHuntTexture;
    [FieldOffset(0x15)] public bool Unknown2;
}
