// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x10)]
public unsafe partial struct Tribe {
    [FieldOffset(0x00)] public int Masculine_Offset;
    [FieldOffset(0x04)] public int Feminine_Offset;
    [FieldOffset(0x08)] public sbyte Hp;
    [FieldOffset(0x09)] public sbyte Mp;
    [FieldOffset(0x0A)] public sbyte STR;
    [FieldOffset(0x0B)] public sbyte VIT;
    [FieldOffset(0x0C)] public sbyte DEX;
    [FieldOffset(0x0D)] public sbyte INT;
    [FieldOffset(0x0E)] public sbyte MND;
    [FieldOffset(0x0F)] public sbyte PIE;
}
