// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct TripleTriadCard {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Unknown0_Offset;
    [FieldOffset(0x08)] public int Description_Offset;
    [FieldOffset(0x0C)] public sbyte Unknown1;
    [FieldOffset(0x0D)] public sbyte Unknown2;
    [FieldOffset(0x0E)] public sbyte StartsWithVowel;
    [FieldOffset(0x0F)] public sbyte Unknown3;
    [FieldOffset(0x10)] public sbyte Unknown4;
    [FieldOffset(0x11)] public sbyte Unknown5;
}
