// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct TripleTriadCardResident {
    [FieldOffset(0x00)] public uint Acquisition;
    [FieldOffset(0x04)] public uint Location;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x08)] public uint Quest;
    [FieldOffset(0x0C)] public ushort Unknown0;
    [FieldOffset(0x0E)] public ushort SaleValue;
    [FieldOffset(0x10)] public ushort Order;
    [FieldOffset(0x12)] public byte Top;
    [FieldOffset(0x13)] public byte Bottom;
    [FieldOffset(0x14)] public byte Left;
    [FieldOffset(0x15)] public byte Right;
    /// <remarks>TripleTriadCardRarity</remarks>
    [FieldOffset(0x16)] public byte TripleTriadCardRarity;
    /// <remarks>TripleTriadCardType</remarks>
    [FieldOffset(0x17)] public byte TripleTriadCardType;
    [FieldOffset(0x18)] public byte SortKey;
    [FieldOffset(0x19)] public byte UIPriority;
    [FieldOffset(0x1A)] public byte AcquisitionType;
    [FieldOffset(0x1B)] public bool Unknown1;
}
