// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct Tutorial {
    [FieldOffset(0x00)] public uint Exp;
    [FieldOffset(0x04)] public uint Gil;
    /// <remarks>Item</remarks>
    [FieldOffset(0x08)] public uint RewardTank;
    /// <remarks>Item</remarks>
    [FieldOffset(0x0C)] public uint RewardMelee;
    /// <remarks>Item</remarks>
    [FieldOffset(0x10)] public uint RewardRanged;
    /// <remarks>InstanceContentTextData</remarks>
    [FieldOffset(0x14)] public uint Objective;
    [FieldOffset(0x18)] public byte Unknown0;
    [FieldOffset(0x19)] public byte Unknown1;
    [FieldOffset(0x1A)] public byte Unknown2;
    [FieldOffset(0x1B)] public byte Unknown3;
}
