// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x24)]
public unsafe partial struct Warp {
    [FieldOffset(0x00)] public int Name_Offset;
    [FieldOffset(0x04)] public int Question_Offset;
    /// <remarks>Level</remarks>
    [FieldOffset(0x08)] public uint PopRange;
    /// <remarks>DefaultTalk</remarks>
    [FieldOffset(0x0C)] public uint ConditionSuccessEvent;
    /// <remarks>DefaultTalk</remarks>
    [FieldOffset(0x10)] public uint ConditionFailEvent;
    /// <remarks>DefaultTalk</remarks>
    [FieldOffset(0x14)] public uint ConfirmEvent;
    /// <remarks>TerritoryType</remarks>
    [FieldOffset(0x18)] public ushort TerritoryType;
    /// <remarks>WarpCondition</remarks>
    [FieldOffset(0x1A)] public ushort WarpCondition;
    /// <remarks>WarpLogic</remarks>
    [FieldOffset(0x1C)] public ushort WarpLogic;
    /// <remarks>Cutscene</remarks>
    [FieldOffset(0x1E)] public ushort StartCutscene;
    /// <remarks>Cutscene</remarks>
    [FieldOffset(0x20)] public ushort EndCutscene;
    [FieldOffset(0x22)] public bool CanSkipCutscene;
}
