// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x14)]
public unsafe partial struct WeddingPlan {
    [FieldOffset(0x00)] public byte Unknown0;
    [FieldOffset(0x01)] public byte Unknown1;
    [FieldOffset(0x02)] public byte Unknown2;
    [FieldOffset(0x03)] public byte Unknown3;
    [FieldOffset(0x04)] public byte Unknown4;
    [FieldOffset(0x05)] public byte Unknown5;
    [FieldOffset(0x06)] public byte Unknown6;
    [FieldOffset(0x07)] public byte Unknown7;
    [FieldOffset(0x08)] public byte Unknown8;
    [FieldOffset(0x09)] public byte Unknown9;
    [FieldOffset(0x0A)] public byte Unknown10;
    [FieldOffset(0x0B)] public byte Unknown11;
    [FieldOffset(0x0C)] public byte Unknown12;
    [FieldOffset(0x0D)] public byte Unknown13;
    [FieldOffset(0x0E)] public byte Unknown14;
    [FieldOffset(0x0F)] public byte Unknown15;
    [FieldOffset(0x10)] public byte Unknown16;
    [FieldOffset(0x11)] public byte Unknown17;
    [FieldOffset(0x12)] public byte Unknown18;
    [FieldOffset(0x13)] public byte Unknown19;
}
