// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
public unsafe partial struct WeeklyBingoRewardData {
    [FieldOffset(0x00)] public uint RewardItem1;
    [FieldOffset(0x04)] public uint RewardItem2;
    [FieldOffset(0x08)] public uint RewardItem3;
    [FieldOffset(0x0C)] public ushort RewardQuantity1;
    [FieldOffset(0x0E)] public ushort RewardQuantity2;
    [FieldOffset(0x10)] public ushort RewardQuantity3;
    [FieldOffset(0x12)] public byte RewardType1;
    [FieldOffset(0x13)] public byte Unknown0;
    [FieldOffset(0x14)] public byte RewardType2;
    [FieldOffset(0x15)] public byte RewardType3;
    [FieldOffset(0x16)] public bool RewardHq2;
    [FieldOffset(0x17)] public bool RewardHq3;
    [FieldOffset(0x18)] public bool RewardHq1;
}
