// <auto-generated/>
namespace FFXIVClientStructs.FFXIV.Component.Excel.Sheets;

[StructLayout(LayoutKind.Explicit, Size = 0x4C)]
public unsafe partial struct ZoneSharedGroup {
    [FieldOffset(0x00)] public uint LGBSharedGroup;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x04)] public uint Quest0;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x08)] public uint Quest1;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x0C)] public uint Quest2;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x10)] public uint Quest3;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x14)] public uint Quest4;
    /// <remarks>Quest</remarks>
    [FieldOffset(0x18)] public uint Quest5;
    [FieldOffset(0x1C)] public uint Unknown0;
    [FieldOffset(0x20)] public uint Seq0;
    [FieldOffset(0x24)] public uint Seq1;
    [FieldOffset(0x28)] public uint Seq2;
    [FieldOffset(0x2C)] public uint Seq3;
    [FieldOffset(0x30)] public uint Seq4;
    [FieldOffset(0x34)] public uint Seq5;
    [FieldOffset(0x38)] public uint Unknown1;
    [FieldOffset(0x3C)] public byte Unknown2;
    [FieldOffset(0x3D)] public byte Unknown3;
    [FieldOffset(0x3E)] public byte Unknown4;
    [FieldOffset(0x3F)] public byte Unknown5;
    [FieldOffset(0x40)] public byte Unknown6;
    [FieldOffset(0x41)] public byte Unknown7;
    [FieldOffset(0x42)] public byte Unknown8;
    [FieldOffset(0x43)] public bool Unknown9;
    [FieldOffset(0x44)] public bool Unknown10;
    [FieldOffset(0x45)] public bool Unknown11;
    [FieldOffset(0x46)] public bool Unknown12;
    [FieldOffset(0x47)] public bool Unknown13;
    [FieldOffset(0x48)] public bool Unknown14;
    [FieldOffset(0x49)] public bool Unknown15;
}
