// Forward References
struct Application::Network::WorkDefinitions::BeastReputationWork;
struct Application::Network::WorkDefinitions::DailyQuestWork;
struct Application::Network::WorkDefinitions::EnterContentInfo;
struct Application::Network::WorkDefinitions::LeveWork;
struct Application::Network::WorkDefinitions::QuestWork;
struct Application::Network::WorkDefinitions::TrackingWork;
struct Client::Game::ActionManager;
struct Client::Game::ComboDetail;
struct Client::Game::Object::GameObjectID;
struct Client::Game::ActionTimelineDriver;
struct Client::Game::ActionTimelineManager;
struct Client::Game::Balloon;
struct Client::System::String::Utf8String;
struct Client::Game::Camera;
struct Client::Game::CameraBase;
struct Client::Graphics::Scene::Camera;
struct Client::Graphics::Scene::Object;
struct Common::Math::Vector3;
struct Common::Math::Quaternion;
struct Common::Math::Matrix4x4;
struct Client::Game::Camera3;
struct Client::Game::Camera4;
struct Client::Game::Character::BattleChara;
struct Client::Game::Character::Character;
struct Client::Game::Character::Data::CharacterData;
struct Client::Game::Character::Character::MountContainer;
struct Client::Game::Character::Character::CompanionContainer;
struct Client::Game::Character::DrawDataContainer;
struct Client::Game::Character::WeaponModelId;
struct Client::Game::Character::DrawObjectData;
struct Client::Game::Character::EquipmentModelId;
struct Client::Game::Character::CustomizeData;

    IconTextClick = 58,
    WindowRollOver = 67,
    WindowRollOut = 68,
    WindowChangeScale = 69
};

enum Component::GUI::AtkLoadState: byte
{
    Unloaded = 0,
    ResourceLoading = 1,
    TexturesLoading = 2,
    Loaded = 3,
    LoadError = 4
};

enum Component::GUI::AtkTooltipManager::AtkTooltipType: byte
{
    Text = 1,
    Item = 2,
    TextItem = 3,
    Action = 4
};

enum Component::GUI::CollisionType: unsigned __int16
{
    Hit = 0,
    Focus = 1,
    Move = 2
};

enum Component::GUI::ComponentType: byte
{
    Base = 0,
    Button = 1,
    Window = 2,
    CheckBox = 3,
    RadioButton = 4,
    GaugeBar = 5,
    Slider = 6,
    TextInput = 7,
    NumericInput = 8,
    List = 9,
    DropDownList = 10,
    Tab = 11,
    TreeList = 12,
    ScrollBar = 13,
    ListItemRenderer = 14,
    Icon = 15,
    IconText = 16,
    DragDrop = 17,
    GuildLeveCard = 18,
    TextNineGrid = 19,
    JournalCanvas = 20,
    Multipurpose = 21,
    Map = 22,
    Preview = 23,
    HoldButton = 24,
    Portrait = 25
};

enum Component::GUI::FontType: byte
{
    Axis = 0,
    MiedingerMed = 1,
    Miedinger = 2,
    TrumpGothic = 3,
    Jupiter = 4,
    JupiterLarge = 5
};

enum Component::GUI::IconComponentFlags: unsigned __int32
{
    None = 0,
    DyeIcon = 8,
    Macro = 16,
    GlamourIcon = 32,
    Moving = 256,
    Casting = 1024,
    InventoryItem = 2048
};

enum Component::GUI::ImageNodeFlags: __int32
{
    FlipH = 1,
    FlipV = 2,
    AutoFit = 128
};

enum Component::GUI::NodeFlags: unsigned __int16
{
    AnchorTop = 1,
    AnchorLeft = 2,
    AnchorBottom = 4,
    AnchorRight = 8,
    Visible = 16,
    Enabled = 32,
    Clip = 64,
    Fill = 128,
    HasCollision = 256,
    RespondToMouse = 512,
    Focusable = 1024,
    Droppable = 2048,
    IsTopNode = 4096,
    EmitsEvents = 8192,
    UseDepthBasedPriority = 16384,
    UnkFlag2 = 32768
};

enum Component::GUI::NodeType: unsigned __int16
{
    Res = 1,
    Image = 2,
    Text = 3,
    NineGrid = 4,
    Counter = 5,
    Collision = 8
};

enum Component::GUI::TextFlags: __int32
{
    AutoAdjustNodeSize = 1,
    Bold = 2,
    Italic = 4,
    Edge = 8,
    Glare = 16,
    Emboss = 32,
    WordWrap = 64,
    MultiLine = 128
};

enum Component::GUI::TextFlags2: __int32
{
    Ellipsis = 4
};

enum Component::GUI::TextInputFlags1: __int32
{
    Capitalize = 1,
    Mask = 2,
    EnableDictionary = 4,
    EnableHistory = 8,
    EnableIME = 16,
    EscapeClears = 32,
    AllowUpperCase = 64,
    AllowLowerCase = 128
};

enum Component::GUI::TextInputFlags2: __int32
{
    AllowNumberInput = 1,
    AllowSymbolInput = 2,
    WordWrap = 4,
    MultiLine = 8,
    AutoMaxWidth = 16
};

enum Component::GUI::TextureType: byte
{
    Resource = 1,
    Crest = 2,
    KernelTexture = 3
};

enum Component::GUI::ValueType: __int32
{
    Bool = 2,
    Int = 3,
    UInt = 4,
    Float = 5,
    String = 6,
    String8 = 8,
    Vector = 9,
    Texture = 10,
    AllocatedString = 38,
    AllocatedVector = 41
};


// Definitions
struct Application::Network::WorkDefinitions::BeastReputationWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Rank;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 Value;
    /*      */ byte _gap_0xC[0x4];
};

struct Application::Network::WorkDefinitions::DailyQuestWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 QuestId;
    /* 0x0A */ byte Flags;
    /*      */ byte _gap_0xB;
    /*      */ byte _gap_0xC[0x4];
};

struct Application::Network::WorkDefinitions::EnterContentInfo /* Size=0x28 */
{
    /* 0x00 */ byte NotifyType;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x10];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ unsigned __int16 ContentFinderConditionId;
    /*      */ byte _gap_0x1E[0x2];
    /*      */ byte _gap_0x20[0x8];
};

struct Application::Network::WorkDefinitions::LeveWork /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 LeveId;
    /* 0x0A */ byte Sequence;
    /*      */ byte _gap_0xB;
    /* 0x0C */ unsigned __int16 Flags;
    /* 0x0E */ unsigned __int16 LeveSeed;
    /* 0x10 */ byte ClearClass;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Application::Network::WorkDefinitions::QuestWork /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 QuestId;
    /* 0x0A */ byte Sequence;
    /* 0x0B */ byte Flags;
    /* 0x0C */ byte Variables[0x6];
    /* 0x12 */ byte AcceptClassJob;
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
};

struct Application::Network::WorkDefinitions::TrackingWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte QuestType;
    /* 0x09 */ byte Index;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Game::ComboDetail /* Size=0x8 */
{
    /* 0x0 */ float Timer;
    /* 0x4 */ unsigned __int32 Action;
};

struct Client::Game::Object::GameObjectID /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectID;
    /* 0x4 */ byte Type;
    /*     */ byte _gap_0x5;
    /*     */ byte _gap_0x6[0x2];
};

struct Client::Game::ActionManager /* Size=0x7F0 */
{
    /*       */ byte _gap_0x0[0x60];
    /* 0x060 */ Client::Game::ComboDetail Combo;
    /* 0x068 */ bool ActionQueued;
    /*       */ byte _gap_0x69;
    /*       */ byte _gap_0x6A[0x2];
    /* 0x06C */ Client::Game::ActionType QueuedActionType;
    /*       */ byte _gap_0x6D;
    /*       */ byte _gap_0x6E[0x2];
    /* 0x070 */ unsigned __int32 QueuedActionId;
    /*       */ byte _gap_0x74[0x4];
    /* 0x078 */ Client::Game::Object::GameObjectID QueuedTargetId;
    /* 0x080 */ unsigned __int32 QueueType;
    /*       */ byte _gap_0x84[0x4];
    /*       */ byte _gap_0x88[0xB0];
    /*       */ byte _gap_0x138[0x4];
    /* 0x13C */ unsigned __int32 BlueMageActions[0x18];
    /*       */ byte _gap_0x19C[0x4];
    /*       */ byte _gap_0x1A0[0x650];
};

struct Client::Game::ActionTimelineDriver /* Size=0x1F0 */
{
    /*       */ byte _gap_0x0[0xE0];
    /* 0x0E0 */ unsigned __int16 TimelineIds[0xD];
    /*       */ byte _gap_0xFA[0x2];
    /*       */ byte _gap_0xFC[0x4];
    /*       */ byte _gap_0x100[0x50];
    /*       */ byte _gap_0x150[0x4];
    /* 0x154 */ float TimelineSpeeds[0xD];
    /*       */ byte _gap_0x188[0x68];
};

struct Client::Game::ActionTimelineManager /* Size=0x340 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ Client::Game::ActionTimelineDriver Driver;
    /*       */ byte _gap_0x200[0xC0];
    /* 0x2C0 */ float OverallSpeed;
    /*       */ byte _gap_0x2C4[0x4];
    /*       */ byte _gap_0x2C8[0x10];
    /*       */ byte _gap_0x2D8[0x4];
    /* 0x2DC */ unsigned __int16 BaseOverride;
    /* 0x2DE */ unsigned __int16 LipsOverride;
    /*       */ byte _gap_0x2E0[0x30];
    /* 0x310 */ unsigned __int16 BannerTimelineRowId;
    /* 0x312 */ byte BannerFacialRowId;
    /*       */ byte _gap_0x313;
    /*       */ byte _gap_0x314[0x4];
    /*       */ byte _gap_0x318[0x10];
    /*       */ byte _gap_0x328[0x4];
    /* 0x32C */ unsigned __int32 BannerTimelineAdditionalData;
    /* 0x330 */ unsigned __int32 BannerTimelineIcon;
    /* 0x334 */ unsigned __int16 BannerTimelineUnlockCondition;
    /* 0x336 */ unsigned __int16 BannerTimelineSortKey;
    /* 0x338 */ byte BannerTimelineType;
    /*       */ byte _gap_0x339;
    /*       */ byte _gap_0x33A[0x2];
    /*       */ byte _gap_0x33C[0x4];
};

struct Client::System::String::Utf8String /* Size=0x68 */
{
    /* 0x00 */ byte* StringPtr;
    /* 0x08 */ __int64 BufSize;
    /* 0x10 */ __int64 BufUsed;
    /* 0x18 */ __int64 StringLength;
    /* 0x20 */ byte IsEmpty;
    /* 0x21 */ byte IsUsingInlineBuffer;
    /* 0x22 */ byte InlineBuffer[0x40];
    /*      */ byte _gap_0x62[0x2];
    /*      */ byte _gap_0x64[0x4];
};

struct Client::Game::Balloon /* Size=0x80 */
{
    /* 0x00 */ unsigned __int16 DefaultBalloonId;
    /* 0x02 */ unsigned __int16 NowPlayingBalloonId;
    /* 0x04 */ float PlayTimer;
    /* 0x08 */ Client::Game::BalloonType Type;
    /* 0x0C */ Client::Game::BalloonState State;
    /* 0x10 */ Client::System::String::Utf8String Text;
    /* 0x78 */ byte UnkBool;
    /*      */ byte _gap_0x79;
    /*      */ byte _gap_0x7A[0x2];
    /*      */ byte _gap_0x7C[0x4];
};

struct Common::Math::Vector3 /* Size=0x10 */
{
    /* 0x00 */ float X;
    /* 0x04 */ float Y;
    /* 0x08 */ float Z;
    /*      */ byte _gap_0xC[0x4];
};

struct Common::Math::Quaternion /* Size=0x10 */
{
    /* 0x00 */ float X;
    /* 0x04 */ float Y;
    /* 0x08 */ float Z;
    /* 0x0C */ float W;
};

struct Client::Graphics::Scene::Object /* Size=0x80 */
{
    /* 0x00 */ Client::Graphics::Scene::Object::ObjectVTable* VTable;
    /*      */ byte _gap_0x8[0x10];
    /* 0x18 */ Client::Graphics::Scene::Object* ParentObject;
    /* 0x20 */ Client::Graphics::Scene::Object* PreviousSiblingObject;
    /* 0x28 */ Client::Graphics::Scene::Object* NextSiblingObject;
    /* 0x30 */ Client::Graphics::Scene::Object* ChildObject;
    /*      */ byte _gap_0x38[0x18];
    /* 0x50 */ Common::Math::Vector3 Position;
    /* 0x60 */ Common::Math::Quaternion Rotation;
    /* 0x70 */ Common::Math::Vector3 Scale;
};

struct Common::Math::Matrix4x4 /* Size=0x40 */
{
    /*      */ byte _gap_0x0[0x40];
};

struct Client::Graphics::Scene::Camera /* Size=0xF0 */
{
    /* 0x00 */ Client::Graphics::Scene::Object Object;
    /* 0x80 */ Common::Math::Vector3 LookAtVector;
    /* 0x90 */ Common::Math::Vector3 Vector_1;
    /* 0xA0 */ Common::Math::Matrix4x4 ViewMatrix;
    /* 0xE0 */ Client::Graphics::Render::Camera* RenderCamera;
    /*      */ byte _gap_0xE8[0x8];
};

struct Client::Game::CameraBase /* Size=0x110 */
{
    /* 0x000 */ void** vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Client::Graphics::Scene::Camera SceneCamera;
    /* 0x100 */ unsigned __int32 UnkUInt;
    /*       */ byte _gap_0x104[0x4];
    /* 0x108 */ unsigned __int32 UnkFlags;
    /*       */ byte _gap_0x10C[0x4];
};

struct Client::Game::Camera /* Size=0x2B0 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /*       */ byte _gap_0x110[0x4];
    /* 0x114 */ float Distance;
    /* 0x118 */ float MinDistance;
    /* 0x11C */ float MaxDistance;
    /* 0x120 */ float FoV;
    /* 0x124 */ float MinFoV;
    /* 0x128 */ float MaxFoV;
    /*       */ byte _gap_0x12C[0x4];
    /*       */ byte _gap_0x130[0x48];
    /*       */ byte _gap_0x178[0x4];
    /* 0x17C */ float InterpDistance;
    /*       */ byte _gap_0x180[0x8];
    /* 0x188 */ float SavedDistance;
    /*       */ byte _gap_0x18C[0x4];
    /*       */ byte _gap_0x190[0x120];
};

struct Client::Game::Camera3 /* Size=0x300 */
{
    /* 0x000 */ Client::Game::Camera Camera;
    /*       */ byte _gap_0x2B0[0x50];
};

struct Client::Game::Camera4 /* Size=0x350 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /* 0x110 */ Client::Graphics::Scene::Camera SceneCamera0;
    /* 0x200 */ Client::Graphics::Scene::Camera SceneCamera1;
    /*       */ byte _gap_0x2F0[0x60];
};

struct Client::Game::Character::Data::CharacterData /* Size=0x48 */
{
    /* 0x00 */ void* VTable;
    /* 0x08 */ float ModelScale;
    /* 0x0C */ __int32 ModelCharaId;
    /* 0x10 */ __int32 ModelSkeletonId;
    /* 0x14 */ __int32 ModelCharaId_2;
    /* 0x18 */ __int32 ModelSkeletonId_2;
    /* 0x1C */ unsigned __int32 Health;
    /* 0x20 */ unsigned __int32 MaxHealth;
    /* 0x24 */ unsigned __int32 Mana;
    /* 0x28 */ unsigned __int32 MaxMana;
    /* 0x2C */ unsigned __int16 GatheringPoints;
    /* 0x2E */ unsigned __int16 MaxGatheringPoints;
    /* 0x30 */ unsigned __int16 CraftingPoints;
    /* 0x32 */ unsigned __int16 MaxCraftingPoints;
    /* 0x34 */ __int16 TransformationId;
    union {
    /* 0x36 */ __int16 StatusEffectVFXId;
    /* 0x36 */ unsigned __int16 TitleID;
    } _union_0x36;
    /*      */ byte _gap_0x38[0x2];
    /* 0x3A */ byte ClassJob;
    /* 0x3B */ byte Level;
    /*      */ byte _gap_0x3C[0x4];
    /*      */ byte _gap_0x40[0x4];
    /*      */ byte _gap_0x44;
    /* 0x45 */ byte ShieldValue;
    /*      */ byte _gap_0x46;
    /* 0x47 */ byte OnlineStatus;
};

struct Client::Game::Character::Character::MountContainer /* Size=0x60 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Character* MountObject;
    /* 0x18 */ unsigned __int16 MountId;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ float DismountTimer;
    /* 0x20 */ byte Flags;
    /*      */ byte _gap_0x21;
    /*      */ byte _gap_0x22[0x2];
    /* 0x24 */ unsigned __int32 MountedObjectIds[0x7];
    /*      */ byte _gap_0x40[0x20];
};

struct Client::Game::Character::Character::CompanionContainer /* Size=0x20 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Companion* CompanionObject;
    /* 0x18 */ unsigned __int16 CompanionId;
    /*      */ byte _gap_0x1A[0x2];
    /*      */ byte _gap_0x1C[0x4];
};

struct Client::Game::Character::WeaponModelId /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::Game::Character::DrawObjectData /* Size=0x44 */
{
    /*      */ byte _gap_0x0[0x40];
    /*      */ byte _gap_0x40[0x4];
};

struct Client::Game::Character::EquipmentModelId /* Size=0x4 */
{
    /*     */ byte _gap_0x0[0x4];
};

struct Client::Game::Character::CustomizeData /* Size=0x1A */
{
    /*      */ byte _gap_0x0[0x18];
    /*      */ byte _gap_0x18[0x2];
};

struct Client::Game::Character::DrawDataContainer /* Size=0x190 */
{
    /* 0x000 */ void** Vtable;
    /* 0x008 */ Client::Game::Character::Character* Parent;
    /* 0x010 */ Client::Game::Character::WeaponModelId MainHandModel;
    /*       */ byte _gap_0x18[0x8];
    /* 0x020 */ Client::Game::Character::DrawObjectData MainHand;
    /*       */ byte _gap_0x64[0x4];
    /*       */ byte _gap_0x68[0x4];
    /* 0x06C */ byte MainHandState;
    /*       */ byte _gap_0x6D;
    /*       */ byte _gap_0x6E[0x2];
    /*       */ byte _gap_0x70[0x2];
    /* 0x072 */ unsigned __int16 MainHandFlags1;
    /* 0x074 */ byte MainHandFlags2;
    /*       */ byte _gap_0x75;
    /*       */ byte _gap_0x76[0x2];
    /* 0x078 */ Client::Game::Character::WeaponModelId OffHandModel;
    /*       */ byte _gap_0x80[0x8];
    /* 0x088 */ Client::Game::Character::DrawObjectData OffHand;
    /*       */ byte _gap_0xCC[0x4];
    /*       */ byte _gap_0xD0[0x4];
    /* 0x0D4 */ byte OffHandState;
    /*       */ byte _gap_0xD5;
    /*       */ byte _gap_0xD6[0x2];
    /*       */ byte _gap_0xD8[0x2];
    /* 0x0DA */ unsigned __int16 OffHandFlags1;
    /* 0x0DC */ byte OffHandFlags2;
    /*       */ byte _gap_0xDD;
    /*       */ byte _gap_0xDE[0x2];
    /* 0x0E0 */ Client::Game::Character::WeaponModelId UnkE0Model;
    /*       */ byte _gap_0xE8[0x8];
    /* 0x0F0 */ Client::Game::Character::DrawObjectData UnkF0;
    /*       */ byte _gap_0x134[0x4];
    /*       */ byte _gap_0x138[0x8];
    /*       */ byte _gap_0x140[0x2];
    /* 0x142 */ unsigned __int16 Unk144Flags1;
    /* 0x144 */ byte Unk144Flags2;
    /*       */ byte _gap_0x145;
    /*       */ byte _gap_0x146[0x2];
    /* 0x148 */ Client::Game::Character::EquipmentModelId Head;
    /* 0x14C */ Client::Game::Character::EquipmentModelId Top;
    /* 0x150 */ Client::Game::Character::EquipmentModelId Arms;
    /* 0x154 */ Client::Game::Character::EquipmentModelId Legs;
    /* 0x158 */ Client::Game::Character::EquipmentModelId Feet;
    /* 0x15C */ Client::Game::Character::EquipmentModelId Ear;
    /* 0x160 */ Client::Game::Character::EquipmentModelId Neck;
    /* 0x164 */ Client::Game::Character::EquipmentModelId Wrist;
    /* 0x168 */ Client::Game::Character::EquipmentModelId RFinger;
    /* 0x16C */ Client::Game::Character::EquipmentModelId LFinger;
    /* 0x170 */ Client::Game::Character::CustomizeData CustomizeData;
    /* 0x18A */ unsigned __int32 Unk18A;
    /* 0x18E */ byte Flags1;
    /* 0x18F */ byte Flags2;
};

struct Client::Game::Character::Character::OrnamentContainer /* Size=0x28 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Ornament* OrnamentObject;
    /* 0x18 */ unsigned __int16 OrnamentId;
    /*      */ byte _gap_0x1A[0x2];
    /*      */ byte _gap_0x1C[0x4];
    /*      */ byte _gap_0x20[0x8];
};

struct Client::Game::Character::Character::ReaperShroudContainer /* Size=0x40 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ void** VfxListenerVTable;
    /* 0x18 */ unsigned __int16 StanceChangeId;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ unsigned __int32 StanceChangeState;
    /* 0x20 */ float Timer;
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ void* CopyObject;
    /* 0x30 */ Client::Graphics::Vfx::VfxData* Vfx;
    /* 0x38 */ Client::Game::Character::Character::ReaperShroudContainer::ShroudFlags Flags;
    /* 0x3C */ unsigned __int16 NpcEquipId;
    /*      */ byte _gap_0x3E[0x2];
};

struct Client::Game::Character::Character /* Size=0x1B40 */
{
    /*        */ byte _gap_0x0[0x1A8];
    /* 0x01A8 */ Client::Game::Character::Data::CharacterData CharacterData;
    /*        */ byte _gap_0x1F0[0x2];
    /* 0x01F2 */ byte StatusFlags;
    /* 0x01F3 */ byte StatusFlags2;
    /*        */ byte _gap_0x1F4[0x4];
    /*        */ byte _gap_0x1F8[0x448];
    /*        */ byte _gap_0x640;
    /* 0x0641 */ byte CPoseState;
    /*        */ byte _gap_0x642[0x2];
    /*        */ byte _gap_0x644[0x4];
    /*        */ byte _gap_0x648[0x18];
    /* 0x0660 */ Client::Game::Character::Character::MountContainer Mount;
    /*        */ byte _gap_0x6C0[0x8];
    /* 0x06C8 */ Client::Game::Character::Character::CompanionContainer Companion;
    /* 0x06E8 */ Client::Game::Character::DrawDataContainer DrawData;
    /* 0x0878 */ Client::Game::Character::Character::OrnamentContainer Ornament;
    /*        */ byte _gap_0x8A0[0x40];
    /* 0x08E0 */ Client::Game::Character::Character::ReaperShroudContainer ReaperShroud;
    /* 0x0920 */ Client::Game::ActionTimelineManager ActionTimelineManager;
    /*        */ byte _gap_0xC60[0x50];
    /* 0x0CB0 */ Client::Game::Object::GameObjectID LookTargetId;
    /*        */ byte _gap_0xCB8[0xB08];
    /* 0x17C0 */ Client::Game::Balloon Balloon;
    /*        */ byte _gap_0x1840[0x188];
    /* 0x19C8 */ Client::Graphics::Vfx::VfxData* VfxData;
    /* 0x19D0 */ Client::Graphics::Vfx::VfxData* VfxData2;
    /*        */ byte _gap_0x19D8[0x20];
    /* 0x19F8 */ Client::Graphics::Vfx::VfxData* Omen;
    /*        */ byte _gap_0x1A00[0x48];
    /*        */ byte _gap_0x1A48[0x4];
    /* 0x1A4C */ float Alpha;
    /*        */ byte _gap_0x1A50[0x30];
    /* 0x1A80 */ Client::Game::Character::Companion* CompanionObject;
    /*        */ byte _gap_0x1A88[0x10];
    /* 0x1A98 */ byte FreeCompanyTag[0x6];
    /*        */ byte _gap_0x1A9E[0x2];
    /*        */ byte _gap_0x1AA0[0x10];
    /* 0x1AB0 */ Client::Game::Object::GameObjectID CombatTaggerId;
    /* 0x1AB8 */ Client::Game::Object::GameObjectID TargetId;
    /* 0x1AC0 */ Client::Game::Object::GameObjectID SoftTargetId;
    /*        */ byte _gap_0x1AC8[0x38];
    /* 0x1B00 */ unsigned __int32 NameID;
    /*        */ byte _gap_0x1B04[0x4];
    /*        */ byte _gap_0x1B08[0x8];
    /* 0x1B10 */ unsigned __int32 CompanionOwnerID;
    /*        */ byte _gap_0x1B14[0x4];
    /*        */ byte _gap_0x1B18[0x4];
    /* 0x1B1C */ unsigned __int16 CurrentWorld;
    /* 0x1B1E */ unsigned __int16 HomeWorld;
    /*        */ byte _gap_0x1B20[0x4];
    /* 0x1B24 */ unsigned __int16 VoiceId;
    union {
    /* 0x1B26 */ byte EventState;
    /* 0x1B26 */ Client::Game::Character::Character::CharacterModes Mode;
    } _union_0x1B26;
    /* 0x1B27 */ byte ModeParam;
    /*        */ byte _gap_0x1B28;
    /* 0x1B29 */ byte Battalion;
    /*        */ byte _gap_0x1B2A[0x2];
    /*        */ byte _gap_0x1B2C[0x4];
    /*        */ byte _gap_0x1B30;
    /* 0x1B31 */ byte CombatTagType;
    /*        */ byte _gap_0x1B32[0x2];
    /*        */ byte _gap_0x1B34[0x4];
    /* 0x1B38 */ byte StatusFlags3;
    /*        */ byte _gap_0x1B39;
    /* 0x1B3A */ byte StatusFlags4;
    /*        */ byte _gap_0x1B3B;
    /*        */ byte _gap_0x1B3C[0x4];
};

struct Client::Game::Character::BattleChara /* Size=0x2D90 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /*        */ byte _gap_0x1B40[0x1250];
};

struct Client::Game::Character::Character::CastInfo /* Size=0x170 */
{
    /* 0x000 */ byte IsCasting;
    /* 0x001 */ byte Interruptible;
    /* 0x002 */ Client::Game::ActionType ActionType;
    /*       */ byte _gap_0x3;
    /* 0x004 */ unsigned __int32 ActionID;
    /* 0x008 */ unsigned __int32 Unk_08;
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ unsigned __int32 CastTargetID;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x8];
    /* 0x020 */ Common::Math::Vector3 CastLocation;
    /* 0x030 */ unsigned __int32 Unk_30;
    /* 0x034 */ float CurrentCastTime;
    /* 0x038 */ float TotalCastTime;
    /* 0x03C */ float AdjustedTotalCastTime;
    /* 0x040 */ unsigned __int32 UsedActionId;
    /* 0x044 */ Client::Game::ActionType UsedActionType;
    /*       */ byte _gap_0x45;
    /*       */ byte _gap_0x46[0x2];
    /*       */ byte _gap_0x48[0x10];
    /* 0x058 */ unsigned __int64 ActionRecipientsObjectIdArray[0x20];
    /* 0x158 */ __int32 ActionRecipientsCount;
    /*       */ byte _gap_0x15C[0x4];
    /*       */ byte _gap_0x160[0x10];
};

struct Client::Game::Character::Character::CharacterVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x278];
    /* 0x278 */ __int64 GetStatusManager;
    /*     */ byte _gap_0x280[0x8];
    /* 0x288 */ __int64 GetCastInfo;
    /*     */ byte _gap_0x290[0x18];
    /* 0x2A8 */ __int64 GetForayInfo;
    /*     */ byte _gap_0x2B0[0x8];
    /* 0x2B8 */ __int64 IsMount;
};

struct Client::Game::Character::Character::ForayInfo /* Size=0x2 */
{
    /* 0x0 */ byte ForayRank;
    /* 0x1 */ Client::Game::Character::Character::EurekaElement Element;
};

struct Client::Game::Character::CharacterManager /* Size=0x338 */
{
    /* 0x000 */ byte BattleCharaList[0x320];
    /* 0x320 */ Client::Game::Character::BattleChara* BattleCharaMemory;
    /* 0x328 */ Client::Game::Character::Companion* CompanionMemory;
    /* 0x330 */ __int32 CompanionClassSize;
    /* 0x334 */ __int32 UpdateIndex;
};

struct Client::Game::Character::Companion /* Size=0x1C00 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /*        */ byte _gap_0x1B40[0xC0];
};

struct Client::Game::Character::Ornament /* Size=0x1B60 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /* 0x1B40 */ unsigned __int32 OrnamentId;
    /* 0x1B44 */ byte AttachmentPoint;
    /*        */ byte _gap_0x1B45;
    /*        */ byte _gap_0x1B46[0x2];
    /*        */ byte _gap_0x1B48[0x18];
};

struct Client::Game::Control::CameraManager /* Size=0x180 */
{
    /* 0x000 */ Client::Game::Camera* Camera;
    /* 0x008 */ Client::Game::LowCutCamera* LowCutCamera;
    /* 0x010 */ Client::Game::LobbyCamera* LobbCamera;
    /* 0x018 */ Client::Game::Camera3* Camera3;
    /* 0x020 */ Client::Game::Camera4* Camera4;
    /*       */ byte _gap_0x28[0x20];
    /* 0x048 */ __int32 ActiveCameraIndex;
    /* 0x04C */ __int32 PreviousCameraIndex;
    /*       */ byte _gap_0x50[0x10];
    /* 0x060 */ Client::Game::CameraBase UnkCamera;
    /*       */ byte _gap_0x170[0x10];
};

struct Client::Game::Control::GameObjectArray /* Size=0x12C0 */
{
    /* 0x0000 */ __int32 Length;
    /*        */ byte _gap_0x4[0x4];
    /* 0x0008 */ unsigned __int64 Objects[0x257];
};

struct Client::Game::Control::TargetSystem /* Size=0x5370 */
{
    /*        */ byte _gap_0x0[0x80];
    /* 0x0080 */ Client::Game::Object::GameObject* Target;
    /* 0x0088 */ Client::Game::Object::GameObject* SoftTarget;
    /*        */ byte _gap_0x90[0x8];
    /* 0x0098 */ Client::Game::Object::GameObject* GPoseTarget;
    /*        */ byte _gap_0xA0[0x30];
    /* 0x00D0 */ Client::Game::Object::GameObject* MouseOverTarget;
    /*        */ byte _gap_0xD8[0x8];
    /* 0x00E0 */ Client::Game::Object::GameObject* MouseOverNameplateTarget;
    /*        */ byte _gap_0xE8[0x10];
    /* 0x00F8 */ Client::Game::Object::GameObject* FocusTarget;
    /*        */ byte _gap_0x100[0x10];
    /* 0x0110 */ Client::Game::Object::GameObject* PreviousTarget;
    /*        */ byte _gap_0x118[0x28];
    /* 0x0140 */ Client::Game::Object::GameObjectID TargetObjectId;
    /* 0x0148 */ Client::Game::Control::GameObjectArray ObjectFilterArray0;
    /*        */ byte _gap_0x1408[0x690];
    /* 0x1A98 */ Client::Game::Control::GameObjectArray ObjectFilterArray1;
    /* 0x2D58 */ Client::Game::Control::GameObjectArray ObjectFilterArray2;
    /* 0x4018 */ Client::Game::Control::GameObjectArray ObjectFilterArray3;
    /*        */ byte _gap_0x52D8[0x98];
};

struct Client::Game::Control::Control /* Size=0x5A60 */
{
    /* 0x0000 */ Client::Game::Control::CameraManager CameraManager;
    /* 0x0180 */ Client::Game::Control::TargetSystem TargetSystem;
    /*        */ byte _gap_0x54F0[0x5F8];
    /* 0x5AE8 */ unsigned __int32 LocalPlayerObjectId;
    /*        */ byte _gap_0x5AEC[0x4];
    /* 0x5AF0 */ Client::Game::Character::BattleChara* LocalPlayer;
};

struct Client::Game::Control::InputManager /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Pointer::ClientGameObjectGameObject /* Size=0x8 */
{
    /* 0x0 */ Client::Game::Object::GameObject* Value;
};

struct StdSet::Node::PointerClientGameObjectGameObject /* Size=0x30 */
{
    /* 0x00 */ StdSet::Node::PointerClientGameObjectGameObject* Left;
    /* 0x08 */ StdSet::Node::PointerClientGameObjectGameObject* Parent;
    /* 0x10 */ StdSet::Node::PointerClientGameObjectGameObject* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ Pointer::ClientGameObjectGameObject Key;
};

struct StdSet::PointerClientGameObjectGameObject /* Size=0x10 */
{
    /* 0x00 */ StdSet::Node::PointerClientGameObjectGameObject* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::Game::Event::EventId /* Size=0x4 */
{
    /*     */ byte _gap_0x0[0x4];
};

struct Client::Game::Event::EventHandlerStructInfo /* Size=0x38 */
{
    /* 0x00 */ Client::Game::Event::EventId EventId;
    /* 0x04 */ byte Flags;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x30];
};

struct Client::Game::Event::EventHandlerStruct /* Size=0x210 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ StdSet::PointerClientGameObjectGameObject EventObjects;
    /* 0x018 */ Client::Game::Event::EventSceneModuleUsualImpl* EventSceneModule;
    /* 0x020 */ Client::Game::Event::EventHandlerStructInfo Info;
    /*       */ byte _gap_0x58[0x70];
    /* 0x0C8 */ Client::System::String::Utf8String UnkString0;
    /*       */ byte _gap_0x130[0x38];
    /* 0x168 */ Client::System::String::Utf8String UnkString1;
    /*       */ byte _gap_0x1D0[0x40];
};

struct Client::Game::Event::LuaEventHandlerStruct /* Size=0x330 */
{
    /* 0x000 */ Client::Game::Event::EventHandlerStruct EventHandler;
    /* 0x210 */ Common::Lua::LuaState* LuaState;
    /*       */ byte _gap_0x218[0x28];
    /* 0x240 */ Client::System::String::Utf8String LuaClass;
    /* 0x2A8 */ Client::System::String::Utf8String LuaKey;
    /*       */ byte _gap_0x310[0x20];
};

struct Client::Game::Event::Director /* Size=0x4B8 */
{
    /* 0x000 */ Client::Game::Event::LuaEventHandlerStruct LuaEventHandler;
    /* 0x330 */ Client::Game::Event::EventHandlerStructInfo* EventHandlerInfo;
    /* 0x338 */ unsigned __int32 ContentId;
    /* 0x33C */ byte ContentFlags;
    /*       */ byte _gap_0x33D;
    /*       */ byte _gap_0x33E[0x2];
    /* 0x340 */ byte Sequence;
    /*       */ byte _gap_0x341;
    /* 0x342 */ byte UnionData[0xA];
    /*       */ byte _gap_0x34C[0x4];
    /* 0x350 */ Client::System::String::Utf8String String0;
    /* 0x3B8 */ Client::System::String::Utf8String String1;
    /* 0x420 */ Client::System::String::Utf8String String2;
    /*       */ byte _gap_0x488[0x30];
};

struct Client::Game::Event::ModuleBase /* Size=0x40 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Common::Lua::LuaState* LuaState;
    /*      */ byte _gap_0x10[0x30];
};

struct Pointer::ClientGameEventDirector /* Size=0x8 */
{
    /* 0x0 */ Client::Game::Event::Director* Value;
};

struct StdVector::PointerClientGameEventDirector /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGameEventDirector* First;
    /* 0x08 */ Pointer::ClientGameEventDirector* Last;
    /* 0x10 */ Pointer::ClientGameEventDirector* End;
};

struct StdPair::SystemIntPtr::SystemIntPtr /* Size=0x10 */
{
    /* 0x00 */ __int64 Item1;
    /* 0x08 */ __int64 Item2;
};

struct StdPair::SystemUInt16::StdPairSystemIntPtrSystemIntPtr /* Size=0x18 */
{
    /* 0x00 */ unsigned __int16 Item1;
    /*      */ byte _gap_0x2[0x2];
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ StdPair::SystemIntPtr::SystemIntPtr Item2;
};

struct StdMap::Node::SystemUInt16::StdPairSystemIntPtrSystemIntPtr /* Size=0x40 */
{
    /* 0x00 */ StdMap::Node::SystemUInt16::StdPairSystemIntPtrSystemIntPtr* Left;
    /* 0x08 */ StdMap::Node::SystemUInt16::StdPairSystemIntPtrSystemIntPtr* Parent;
    /* 0x10 */ StdMap::Node::SystemUInt16::StdPairSystemIntPtrSystemIntPtr* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ StdPair::SystemUInt16::StdPairSystemIntPtrSystemIntPtr KeyValuePair;
};

struct StdMap::SystemUInt16::StdPairSystemIntPtrSystemIntPtr /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::SystemUInt16::StdPairSystemIntPtrSystemIntPtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::Game::Event::DirectorModule /* Size=0xA0 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdVector::PointerClientGameEventDirector DirectorList;
    /* 0x58 */ StdMap::SystemUInt16::StdPairSystemIntPtrSystemIntPtr DirectorFactories;
    /*      */ byte _gap_0x68[0x30];
    /* 0x98 */ Client::Game::InstanceContent::ContentDirector* ActiveContentDirector;
};

struct Pointer::ClientGameEventEventHandlerStruct /* Size=0x8 */
{
    /* 0x0 */ Client::Game::Event::EventHandlerStruct* Value;
};

struct StdPair::SystemUInt32::PointerClientGameEventEventHandlerStruct /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ Pointer::ClientGameEventEventHandlerStruct Item2;
};

struct StdMap::Node::SystemUInt32::PointerClientGameEventEventHandlerStruct /* Size=0x38 */
{
    /* 0x00 */ StdMap::Node::SystemUInt32::PointerClientGameEventEventHandlerStruct* Left;
    /* 0x08 */ StdMap::Node::SystemUInt32::PointerClientGameEventEventHandlerStruct* Parent;
    /* 0x10 */ StdMap::Node::SystemUInt32::PointerClientGameEventEventHandlerStruct* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ StdPair::SystemUInt32::PointerClientGameEventEventHandlerStruct KeyValuePair;
};

struct StdMap::SystemUInt32::PointerClientGameEventEventHandlerStruct /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::SystemUInt32::PointerClientGameEventEventHandlerStruct* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::Game::Event::EventHandlerStructModule /* Size=0xC0 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdMap::SystemUInt32::PointerClientGameEventEventHandlerStruct EventHandlerMap;
    /* 0x50 */ StdMap::SystemUInt16::StdPairSystemIntPtrSystemIntPtr EventHandlerFactories;
    /*      */ byte _gap_0x60[0x60];
};

struct Client::Game::Event::LuaActor /* Size=0x80 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Client::Game::Object::GameObject* Object;
    /* 0x10 */ Client::System::String::Utf8String LuaString;
    /* 0x78 */ Common::Lua::LuaState* LuaState;
};

struct StdPair::SystemInt64::ClientGameEventLuaActor /* Size=0x88 */
{
    /* 0x00 */ __int64 Item1;
    /* 0x08 */ Client::Game::Event::LuaActor Item2;
};

struct StdMap::Node::SystemInt64::ClientGameEventLuaActor /* Size=0xB0 */
{
    /* 0x00 */ StdMap::Node::SystemInt64::ClientGameEventLuaActor* Left;
    /* 0x08 */ StdMap::Node::SystemInt64::ClientGameEventLuaActor* Parent;
    /* 0x10 */ StdMap::Node::SystemInt64::ClientGameEventLuaActor* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ StdPair::SystemInt64::ClientGameEventLuaActor KeyValuePair;
};

struct StdMap::SystemInt64::ClientGameEventLuaActor /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::SystemInt64::ClientGameEventLuaActor* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::Game::Event::LuaActorModule /* Size=0x50 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdMap::SystemInt64::ClientGameEventLuaActor ActorMap;
};

struct Client::Game::Event::EventSceneModuleImplBase /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Client::Game::Event::EventSceneModule* EventSceneModule;
};

struct Client::Game::Event::EventSceneModuleUsualImpl /* Size=0x10 */
{
    /* 0x00 */ Client::Game::Event::EventSceneModuleImplBase ImplBase;
};

struct Client::Game::Event::EventGPoseController /* Size=0x0 */
{
};

struct Client::Game::Event::EventSceneModule /* Size=0x31A0 */
{
    /* 0x0000 */ Client::Game::Event::EventSceneModuleUsualImpl EventSceneModuleUsualImpl;
    /* 0x0010 */ Client::Game::Event::EventSceneModuleImplBase EventSceneModuleImplBase;
    /* 0x0020 */ Client::Game::Event::EventSceneModuleImplBase* EventSceneModuleImpl;
    /*        */ byte _gap_0x28[0x1A8];
    /* 0x01D0 */ Client::Game::Event::EventGPoseController EventGPoseController;
    /*        */ byte _gap_0x1D0[0x2FD0];
};

struct Common::Lua::LuaState /* Size=0x28 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Common::Lua::lua_State* State;
    /* 0x10 */ bool GCEnabled;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
    /* 0x18 */ __int64 LastGCRestart;
    /* 0x20 */ __int64 db_errorfb;
};

struct Common::Lua::LuaThread /* Size=0x28 */
{
    /* 0x00 */ Common::Lua::LuaState LuaState;
};

struct Client::Game::Event::EventState /* Size=0x30 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ Client::Game::Object::GameObjectID ObjectId;
    /*      */ byte _gap_0x18[0x18];
};

struct Client::Game::Event::EventFramework /* Size=0x3BC0 */
{
    /* 0x0000 */ Client::Game::Event::EventHandlerStructModule EventHandlerModule;
    /* 0x00C0 */ Client::Game::Event::DirectorModule DirectorModule;
    /* 0x0160 */ Client::Game::Event::LuaActorModule LuaActorModule;
    /* 0x01B0 */ Client::Game::Event::EventSceneModule EventSceneModule;
    /* 0x3350 */ __int32 LoadState;
    /*        */ byte _gap_0x3354[0x4];
    /* 0x3358 */ Common::Lua::LuaState* LuaState;
    /* 0x3360 */ Common::Lua::LuaThread LuaThread;
    /*        */ byte _gap_0x3388[0x30];
    /* 0x33B8 */ Client::Game::Event::EventState EventState1;
    /*        */ byte _gap_0x33E8[0x30];
    /* 0x3418 */ Client::Game::Event::EventState EventState2;
    /*        */ byte _gap_0x3448[0x778];
};

struct System::Numerics::Vector3 /* Size=0x0 */
{
    /* 0x0 */ float X;
    /* 0x4 */ float Y;
    /* 0x8 */ float Z;
};

struct Client::Game::Fate::FateContext /* Size=0x1040 */
{
    /*        */ byte _gap_0x0[0x18];
    /* 0x0018 */ unsigned __int16 FateId;
    /*        */ byte _gap_0x1A[0x2];
    /*        */ byte _gap_0x1C[0x4];
    /* 0x0020 */ __int32 StartTimeEpoch;
    /*        */ byte _gap_0x24[0x4];
    /* 0x0028 */ __int16 Duration;
    /*        */ byte _gap_0x2A[0x2];
    /*        */ byte _gap_0x2C[0x4];
    /*        */ byte _gap_0x30[0x90];
    /* 0x00C0 */ Client::System::String::Utf8String Name;
    /* 0x0128 */ Client::System::String::Utf8String Description;
    /* 0x0190 */ Client::System::String::Utf8String Objective;
    /*        */ byte _gap_0x1F8[0x1B0];
    /*        */ byte _gap_0x3A8[0x4];
    /* 0x03AC */ byte State;
    /*        */ byte _gap_0x3AD;
    /*        */ byte _gap_0x3AE;
    /* 0x03AF */ byte HandInCount;
    /*        */ byte _gap_0x3B0[0x8];
    /* 0x03B8 */ byte Progress;
    /*        */ byte _gap_0x3B9;
    /*        */ byte _gap_0x3BA[0x2];
    /*        */ byte _gap_0x3BC[0x4];
    /*        */ byte _gap_0x3C0[0x4];
    /* 0x03C4 */ bool IsExpBonus;
    /*        */ byte _gap_0x3C5;
    /*        */ byte _gap_0x3C6[0x2];
    /*        */ byte _gap_0x3C8[0x10];
    /* 0x03D8 */ unsigned __int32 IconId;
    /*        */ byte _gap_0x3DC[0x4];
    /*        */ byte _gap_0x3E0[0x18];
    /*        */ byte _gap_0x3F8;
    /* 0x03F9 */ byte Level;
    /* 0x03FA */ byte MaxLevel;
    /*        */ byte _gap_0x3FB;
    /*        */ byte _gap_0x3FC[0x4];
    /*        */ byte _gap_0x400[0x50];
    /* 0x0450 */ System::Numerics::Vector3 Location;
    /*        */ byte _gap_0x450[0x10];
    /*        */ byte _gap_0x460[0x4];
    /* 0x0464 */ float Radius;
    /*        */ byte _gap_0x468[0x2F8];
    /* 0x0760 */ unsigned __int32 MapIconId;
    /*        */ byte _gap_0x764[0x4];
    /*        */ byte _gap_0x768[0x20];
    /*        */ byte _gap_0x788[0x4];
    /*        */ byte _gap_0x78C[0x2];
    /* 0x078E */ unsigned __int16 TerritoryId;
    /*        */ byte _gap_0x790[0x8B0];
};

struct Client::Game::Fate::FateDirector /* Size=0x4F8 */
{
    /* 0x000 */ Client::Game::Event::Director Director;
    /* 0x4B8 */ byte FateLevel;
    /*       */ byte _gap_0x4B9;
    /*       */ byte _gap_0x4BA[0x2];
    /*       */ byte _gap_0x4BC[0x4];
    /* 0x4C0 */ unsigned __int32 FateNpcObjectId;
    /*       */ byte _gap_0x4C4[0x4];
    /*       */ byte _gap_0x4C8[0x4];
    /* 0x4CC */ unsigned __int16 FateId;
    /*       */ byte _gap_0x4CE[0x2];
    /*       */ byte _gap_0x4D0[0x28];
};

struct StdVector::ClientGameObjectGameObjectID /* Size=0x18 */
{
    /* 0x00 */ Client::Game::Object::GameObjectID* First;
    /* 0x08 */ Client::Game::Object::GameObjectID* Last;
    /* 0x10 */ Client::Game::Object::GameObjectID* End;
};

struct Pointer::ClientGameFateFateContext /* Size=0x8 */
{
    /* 0x0 */ Client::Game::Fate::FateContext* Value;
};

struct StdVector::PointerClientGameFateFateContext /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGameFateFateContext* First;
    /* 0x08 */ Pointer::ClientGameFateFateContext* Last;
    /* 0x10 */ Pointer::ClientGameFateFateContext* End;
};

struct Client::Game::Fate::FateManager /* Size=0xB8 */
{
    /* 0x00 */ StdVector::ClientGameObjectGameObjectID Unk_Vector;
    /* 0x18 */ Client::System::String::Utf8String Unk_String;
    /* 0x80 */ Client::Game::Fate::FateDirector* FateDirector;
    /* 0x88 */ Client::Game::Fate::FateContext* CurrentFate;
    /* 0x90 */ StdVector::PointerClientGameFateFateContext Fates;
    /* 0xA8 */ unsigned __int16 SyncedFateId;
    /*      */ byte _gap_0xAA[0x2];
    /* 0xAC */ byte FateJoined;
    /*      */ byte _gap_0xAD;
    /*      */ byte _gap_0xAE[0x2];
    /*      */ byte _gap_0xB0[0x8];
};

struct Client::Game::JobGaugeManager /* Size=0x60 */
{
    /* 0x00 */ Client::Game::Gauge::JobGauge* CurrentGauge;
    /*      */ byte _gap_0x8[0x50];
    /* 0x58 */ byte ClassJobID;
    /*      */ byte _gap_0x59;
    /*      */ byte _gap_0x5A[0x2];
    /*      */ byte _gap_0x5C[0x4];
};

struct Client::Game::GameMain /* Size=0x58D0 */
{
    /* 0x0000 */ unsigned __int32 ActiveFestivals[0x4];
    /*        */ byte _gap_0x10[0x30];
    /* 0x0040 */ unsigned __int32 QueuedFestivals[0x4];
    /*        */ byte _gap_0x50[0xA88];
    /* 0x0AD8 */ Client::Game::JobGaugeManager JobGaugeManager;
    /*        */ byte _gap_0xB38[0x34D8];
    /* 0x4010 */ unsigned __int32 CurrentTerritoryTypeId;
    /* 0x4014 */ unsigned __int32 CurrentTerritoryIntendedUseId;
    /*        */ byte _gap_0x4018[0x4];
    /* 0x401C */ unsigned __int16 CurrentContentFinderConditionId;
    /*        */ byte _gap_0x401E[0x2];
    /*        */ byte _gap_0x4020[0x8];
    /* 0x4028 */ unsigned __int32 CurrentMapId;
    /*        */ byte _gap_0x402C[0x4];
    /*        */ byte _gap_0x4030[0x18A0];
};

struct Client::Game::Gauge::AstrologianGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 Timer;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC;
    /* 0x0D */ byte Card;
    /* 0x0E */ byte Seals;
    /*      */ byte _gap_0xF;
};

struct Client::Game::Gauge::BardGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 SongTimer;
    /*      */ byte _gap_0xA[0x2];
    /* 0x0C */ byte Repertoire;
    /* 0x0D */ byte SoulVoice;
    /* 0x0E */ Client::Game::Gauge::SongFlags SongFlags;
    /*      */ byte _gap_0xF;
};

struct Client::Game::Gauge::BlackMageGauge /* Size=0x30 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 EnochianTimer;
    /* 0x0A */ __int16 ElementTimeRemaining;
    /* 0x0C */ signed __int8 ElementStance;
    /* 0x0D */ byte UmbralHearts;
    /* 0x0E */ byte PolyglotStacks;
    /* 0x0F */ Client::Game::Gauge::EnochianFlags EnochianFlags;
    /*      */ byte _gap_0x10[0x20];
};

struct Client::Game::Gauge::DancerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Feathers;
    /* 0x09 */ byte Esprit;
    /* 0x0A */ byte DanceSteps[0x4];
    /* 0x0E */ byte StepIndex;
    /*      */ byte _gap_0xF;
};

struct Client::Game::Gauge::DarkKnightGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Blood;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 DarksideTimer;
    /* 0x0C */ byte DarkArtsState;
    /*      */ byte _gap_0xD;
    /* 0x0E */ unsigned __int16 ShadowTimer;
};

struct Client::Game::Gauge::DragoonGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 LotdTimer;
    /* 0x0A */ byte LotdState;
    /* 0x0B */ byte EyeCount;
    /* 0x0C */ byte FirstmindsFocusCount;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::GunbreakerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Ammo;
    /*      */ byte _gap_0x9;
    /* 0x0A */ __int16 MaxTimerDuration;
    /* 0x0C */ byte AmmoComboStep;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::JobGauge /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::Game::Gauge::MachinistGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 OverheatTimeRemaining;
    /* 0x0A */ __int16 SummonTimeRemaining;
    /* 0x0C */ byte Heat;
    /* 0x0D */ byte Battery;
    /* 0x0E */ byte LastSummonBatteryPower;
    /* 0x0F */ byte TimerActive;
};

struct Client::Game::Gauge::MonkGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Chakra;
    /* 0x09 */ Client::Game::Gauge::BeastChakraType BeastChakra1;
    /* 0x0A */ Client::Game::Gauge::BeastChakraType BeastChakra2;
    /* 0x0B */ Client::Game::Gauge::BeastChakraType BeastChakra3;
    /* 0x0C */ Client::Game::Gauge::NadiFlags Nadi;
    /*      */ byte _gap_0xD;
    /* 0x0E */ unsigned __int16 BlitzTimeRemaining;
};

struct Client::Game::Gauge::NinjaGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 HutonTimer;
    /* 0x0A */ byte Ninki;
    /* 0x0B */ byte HutonManualCasts;
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Game::Gauge::PaladinGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte OathGauge;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Game::Gauge::ReaperGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Soul;
    /* 0x09 */ byte Shroud;
    /* 0x0A */ unsigned __int16 EnshroudedTimeRemaining;
    /* 0x0C */ byte LemureShroud;
    /* 0x0D */ byte VoidShroud;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::RedMageGauge /* Size=0x50 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte WhiteMana;
    /* 0x09 */ byte BlackMana;
    /* 0x0A */ byte ManaStacks;
    /*      */ byte _gap_0xB;
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x40];
};

struct Client::Game::Gauge::SageGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 AddersgallTimer;
    /* 0x0A */ byte Addersgall;
    /* 0x0B */ byte Addersting;
    /* 0x0C */ byte Eukrasia;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::SamuraiGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /*      */ byte _gap_0x8[0x2];
    /* 0x0A */ Client::Game::Gauge::KaeshiAction Kaeshi;
    /* 0x0B */ byte Kenki;
    /* 0x0C */ byte MeditationStacks;
    /* 0x0D */ Client::Game::Gauge::SenFlags SenFlags;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::ScholarGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Aetherflow;
    /* 0x09 */ byte FairyGauge;
    /* 0x0A */ __int16 SeraphTimer;
    /* 0x0C */ byte DismissedFairy;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Gauge::SummonerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 SummonTimer;
    /* 0x0A */ unsigned __int16 AttunementTimer;
    /* 0x0C */ byte ReturnSummon;
    /* 0x0D */ byte ReturnSummonGlam;
    /* 0x0E */ byte Attunement;
    /* 0x0F */ Client::Game::Gauge::AetherFlags AetherFlags;
};

struct Client::Game::Gauge::WarriorGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte BeastGauge;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Game::Gauge::WhiteMageGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /*      */ byte _gap_0x8[0x2];
    /* 0x0A */ __int16 LilyTimer;
    /* 0x0C */ byte Lily;
    /* 0x0D */ byte BloodLily;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::Game::Group::GroupManager /* Size=0x3D70 */
{
    /* 0x0000 */ byte PartyMembers[0x1180];
    /* 0x1180 */ byte AllianceMembers[0x2BC0];
    /* 0x3D40 */ unsigned __int32 Unk_3D40;
    /* 0x3D44 */ unsigned __int16 Unk_3D44;
    /*        */ byte _gap_0x3D46[0x2];
    /* 0x3D48 */ __int64 PartyId;
    /* 0x3D50 */ __int64 PartyId_2;
    /* 0x3D58 */ unsigned __int32 PartyLeaderIndex;
    /* 0x3D5C */ byte MemberCount;
    /* 0x3D5D */ byte Unk_3D5D;
    /*        */ byte _gap_0x3D5E;
    /* 0x3D5F */ byte Unk_3D5F;
    /* 0x3D60 */ byte Unk_3D60;
    /* 0x3D61 */ byte AllianceFlags;
    /*        */ byte _gap_0x3D62[0x2];
    /*        */ byte _gap_0x3D64[0x4];
    /*        */ byte _gap_0x3D68[0x8];
};

struct Client::Game::StatusManager /* Size=0x188 */
{
    /* 0x000 */ Client::Game::Character::Character* Owner;
    /* 0x008 */ byte Status[0x168];
    /* 0x170 */ unsigned __int32 Unk_170;
    /* 0x174 */ unsigned __int16 Unk_174;
    /*       */ byte _gap_0x176[0x2];
    /* 0x178 */ __int64 Unk_178;
    /* 0x180 */ byte Unk_180;
    /*       */ byte _gap_0x181;
    /*       */ byte _gap_0x182[0x2];
    /*       */ byte _gap_0x184[0x4];
};

struct Client::Game::Group::PartyMember /* Size=0x230 */
{
    /* 0x000 */ Client::Game::StatusManager StatusManager;
    /*       */ byte _gap_0x188[0x8];
    /* 0x190 */ float X;
    /* 0x194 */ float Y;
    /* 0x198 */ float Z;
    /*       */ byte _gap_0x19C[0x4];
    /* 0x1A0 */ __int64 ContentID;
    /* 0x1A8 */ unsigned __int32 ObjectID;
    /* 0x1AC */ unsigned __int32 Unk_ObjectID_1;
    /* 0x1B0 */ unsigned __int32 Unk_ObjectID_2;
    /* 0x1B4 */ unsigned __int32 CurrentHP;
    /* 0x1B8 */ unsigned __int32 MaxHP;
    /* 0x1BC */ unsigned __int16 CurrentMP;
    /* 0x1BE */ unsigned __int16 MaxMP;
    /* 0x1C0 */ unsigned __int16 TerritoryType;
    /* 0x1C2 */ unsigned __int16 HomeWorld;
    /* 0x1C4 */ byte Name[0x40];
    /* 0x204 */ byte Sex;
    /* 0x205 */ byte ClassJob;
    /* 0x206 */ byte Level;
    /*       */ byte _gap_0x207;
    /* 0x208 */ byte Unk_Struct_208__0;
    /*       */ byte _gap_0x209;
    /*       */ byte _gap_0x20A[0x2];
    /* 0x20C */ unsigned __int32 Unk_Struct_208__4;
    /* 0x210 */ unsigned __int16 Unk_Struct_208__8;
    /*       */ byte _gap_0x212[0x2];
    /* 0x214 */ unsigned __int32 Unk_Struct_208__C;
    /* 0x218 */ unsigned __int16 Unk_Struct_208__10;
    /* 0x21A */ unsigned __int16 Unk_Struct_208__14;
    /*       */ byte _gap_0x21C[0x4];
    /* 0x220 */ byte Flags;
    /*       */ byte _gap_0x221;
    /*       */ byte _gap_0x222[0x2];
    /*       */ byte _gap_0x224[0x4];
    /*       */ byte _gap_0x228[0x8];
};

struct Client::Game::Housing::HousingManager /* Size=0xE0 */
{
    /* 0x00 */ Client::Game::Housing::HousingTerritory* CurrentTerritory;
    /* 0x08 */ Client::Game::Housing::HousingOutdoorTerritory* HousingOutdoorTerritory;
    /* 0x10 */ Client::Game::Housing::HousingTerritory* IndoorTerritory;
    /* 0x18 */ Client::Game::Housing::HousingWorkshopTerritory* WorkshopTerritory;
    /*      */ byte _gap_0x20[0xC0];
};

struct Client::Game::Housing::HousingTerritory /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x96A0];
    /* 0x96A0 */ unsigned __int32 HouseID;
};

struct Client::Game::Housing::HousingOutdoorTerritory /* Size=0xAE30 */
{
    /* 0x0000 */ Client::Game::Housing::HousingTerritory HousingTerritory;
    /*        */ byte _gap_0x0[0x96B8];
    /* 0x96B8 */ byte Plot[0x3C0];
    /* 0x9A78 */ byte ApartmentBuilding[0x2];
    /*        */ byte _gap_0x9A7A[0x2];
    /*        */ byte _gap_0x9A7C[0x4];
    /*        */ byte _gap_0x9A80[0x13B0];
};

struct Client::Game::Housing::HousingWorkshopAirshipData /* Size=0x28F8 */
{
    /* 0x0000 */ byte DataList[0x700];
    /*        */ byte _gap_0x700[0x70];
    /* 0x0770 */ byte ActiveAirshipId;
    /* 0x0771 */ byte AirshipCount;
    /*        */ byte _gap_0x772[0x2];
    /*        */ byte _gap_0x774[0x4];
    /* 0x0778 */ byte AirshipLogList[0x2150];
    /*        */ byte _gap_0x28C8[0x30];
};

struct Client::Game::Housing::HousingWorkshopAirshipGathered /* Size=0x38 */
{
    /* 0x00 */ unsigned __int32 ExpGained;
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x4];
    /* 0x0C */ unsigned __int32 ItemIdPrimary;
    /* 0x10 */ unsigned __int32 ItemIdAdditional;
    /* 0x14 */ unsigned __int16 ItemCountPrimary;
    /* 0x16 */ unsigned __int16 ItemCountAdditional;
    /* 0x18 */ unsigned __int32 Unk1Primary;
    /* 0x1C */ unsigned __int32 Unk1Additional;
    /* 0x20 */ unsigned __int32 Unk2Primary;
    /* 0x24 */ unsigned __int32 Unk2Additional;
    /* 0x28 */ unsigned __int32 Unk3Primary;
    /* 0x2C */ unsigned __int32 Unk3Additional;
    /*      */ byte _gap_0x30[0x2];
    /* 0x32 */ bool AirshipItemValidPrimary;
    /* 0x33 */ bool AirshipItemValidAdditional;
    /*      */ byte _gap_0x34[0x4];
};

struct Client::Game::Housing::HousingWorkshopAirshipSubData /* Size=0x1C0 */
{
    /*       */ byte _gap_0x0[0x4];
    /* 0x004 */ unsigned __int32 RegisterTime;
    /*       */ byte _gap_0x8[0x4];
    /* 0x00C */ byte RankId;
    /*       */ byte _gap_0xD;
    /*       */ byte _gap_0xE[0x2];
    /* 0x010 */ unsigned __int32 ReturnTime;
    /* 0x014 */ unsigned __int32 CurrentExp;
    /* 0x018 */ unsigned __int32 NextLevelExp;
    /*       */ byte _gap_0x1C[0x4];
    /* 0x020 */ unsigned __int16 HullId;
    /* 0x022 */ unsigned __int16 SternId;
    /* 0x024 */ unsigned __int16 BowId;
    /* 0x026 */ unsigned __int16 BridgeId;
    /* 0x028 */ unsigned __int16 Surveillance;
    /* 0x02A */ unsigned __int16 Retrieval;
    /* 0x02C */ unsigned __int16 Speed;
    /* 0x02E */ unsigned __int16 Range;
    /* 0x030 */ unsigned __int16 Favor;
    /*       */ byte _gap_0x32[0x2];
    /*       */ byte _gap_0x34[0x2];
    /*       */ byte _gap_0x36;
    /* 0x037 */ byte Name[0x14];
    /*       */ byte _gap_0x4B;
    /*       */ byte _gap_0x4C[0x4];
    /*       */ byte _gap_0x50[0x4];
    /* 0x054 */ byte GatheredData[0x118];
    /*       */ byte _gap_0x16C[0x4];
    /*       */ byte _gap_0x170[0x30];
    /* 0x1A0 */ Client::System::String::Utf8String* Log;
    /*       */ byte _gap_0x1A8[0x18];
};

struct Client::Game::Housing::HousingWorkshopSubmarineGathered /* Size=0x38 */
{
    /* 0x00 */ byte Point;
    /* 0x01 */ Client::Game::Housing::SubmarineRating PointRating;
    /* 0x02 */ byte UnlockedPoint;
    /* 0x03 */ bool FirstExploration;
    /* 0x04 */ bool AdditionalSubmarineUnlocked;
    /* 0x05 */ bool DoubleDip;
    /* 0x06 */ unsigned __int16 UnknownUshort;
    /* 0x08 */ unsigned __int32 FavorLine;
    /* 0x0C */ unsigned __int32 ExpGained;
    /* 0x10 */ unsigned __int32 ItemIdPrimary;
    /* 0x14 */ unsigned __int32 ItemIdAdditional;
    /* 0x18 */ unsigned __int16 ItemCountPrimary;
    /* 0x1A */ unsigned __int16 ItemCountAdditional;
    /* 0x1C */ bool ItemHQPrimary;
    /* 0x1D */ bool ItemHQAdditional;
    /* 0x1E */ byte UnknownPrimary;
    /* 0x1F */ byte UnknownAdditional;
    /* 0x20 */ unsigned __int32 SurveyLinePrimary;
    /* 0x24 */ unsigned __int32 SurveyLineAdditional;
    /* 0x28 */ unsigned __int32 YieldLinePrimary;
    /* 0x2C */ unsigned __int32 YieldLineAdditional;
    /* 0x30 */ unsigned __int32 DiscoveredLinePrimary;
    /* 0x34 */ unsigned __int32 DiscoveredLineAdditional;
};

struct Client::Game::Housing::HousingWorkshopSubmersibleData /* Size=0x8F40 */
{
    /* 0x0000 */ byte DataList[0x8C80];
    /* 0x8C80 */ byte DataPointerList[0x28];
    /*        */ byte _gap_0x8CA8[0x298];
};

struct Client::Game::Housing::HousingWorkshopSubmersibleSubData /* Size=0x2320 */
{
    /* 0x0000 */ Client::Game::Housing::HousingWorkshopSubmersibleData* Parent;
    /*        */ byte _gap_0x8[0x4];
    /*        */ byte _gap_0xC[0x2];
    /* 0x000E */ byte RankId;
    /*        */ byte _gap_0xF;
    /* 0x0010 */ unsigned __int32 RegisterTime;
    /* 0x0014 */ unsigned __int32 ReturnTime;
    /* 0x0018 */ unsigned __int32 CurrentExp;
    /* 0x001C */ unsigned __int32 NextLevelExp;
    /*        */ byte _gap_0x20[0x2];
    /* 0x0022 */ byte Name[0x14];
    /*        */ byte _gap_0x36[0x2];
    /*        */ byte _gap_0x38[0x2];
    /* 0x003A */ unsigned __int16 HullId;
    /* 0x003C */ unsigned __int16 SternId;
    /* 0x003E */ unsigned __int16 BowId;
    /* 0x0040 */ unsigned __int16 BridgeId;
    /* 0x0042 */ byte CurrentExplorationPoints[0x5];
    /*        */ byte _gap_0x47;
    /*        */ byte _gap_0x48[0x2];
    /* 0x004A */ unsigned __int16 SurveillanceBase;
    /* 0x004C */ unsigned __int16 RetrievalBase;
    /* 0x004E */ unsigned __int16 SpeedBase;
    /* 0x0050 */ unsigned __int16 RangeBase;
    /* 0x0052 */ unsigned __int16 FavorBase;
    /* 0x0054 */ unsigned __int16 SurveillanceBonus;
    /* 0x0056 */ unsigned __int16 RetrievalBonus;
    /* 0x0058 */ unsigned __int16 SpeedBonus;
    /* 0x005A */ unsigned __int16 RangeBonus;
    /* 0x005C */ unsigned __int16 FavorBonus;
    /*        */ byte _gap_0x5E[0x2];
    /* 0x0060 */ Client::Game::Housing::SubmarineRating SubmarineRating;
    /*        */ byte _gap_0x61;
    /* 0x0062 */ unsigned __int16 LogSpeed;
    /* 0x0064 */ byte GatheredData[0x118];
    /*        */ byte _gap_0x17C[0x4];
    /*        */ byte _gap_0x180[0x30];
    /* 0x01B0 */ byte LogList[0x2150];
    /*        */ byte _gap_0x2300[0x20];
};

struct Client::Game::Housing::HousingWorkshopTerritory /* Size=0xB8C0 */
{
    /*        */ byte _gap_0x0[0x68];
    /* 0x0068 */ Client::Game::Housing::HousingWorkshopAirshipData Airship;
    /* 0x2960 */ Client::Game::Housing::HousingWorkshopSubmersibleData Submersible;
    /*        */ byte _gap_0xB8A0[0x20];
};

struct Client::Game::Housing::PlotDetail /* Size=0x10 */
{
    /* 0x00 */ Client::Game::Housing::PlotState State;
    /* 0x01 */ Client::Game::Housing::PlotSize Size;
    /* 0x02 */ bool IsOpen;
    /* 0x03 */ bool Unk03;
    /* 0x04 */ Client::Game::Housing::PlotOwnerType OwnerType;
    /*      */ byte _gap_0x8[0x8];
};

struct Client::Game::InstanceContent::ContentDirector /* Size=0xC40 */
{
    /* 0x000 */ Client::Game::Event::Director Director;
    /*       */ byte _gap_0x4B8[0x750];
    /* 0xC08 */ float ContentTimeLeft;
    /*       */ byte _gap_0xC0C[0x4];
    /*       */ byte _gap_0xC10[0x30];
};

struct Client::Game::InstanceContent::InstanceContentDirector /* Size=0x1CA8 */
{
    /* 0x0000 */ Client::Game::InstanceContent::ContentDirector ContentDirector;
    /*        */ byte _gap_0xC40[0x98];
    /*        */ byte _gap_0xCD8[0x4];
    /* 0x0CDC */ Client::Game::InstanceContent::InstanceContentType InstanceContentType;
    /*        */ byte _gap_0xCDD;
    /*        */ byte _gap_0xCDE[0x2];
    /*        */ byte _gap_0xCE0[0xFC8];
};

struct Client::Game::InstanceContent::InstanceContentDeepDungeon /* Size=0x27D8 */
{
    /* 0x0000 */ Client::Game::InstanceContent::InstanceContentDirector InstanceContentDirector;
    /*        */ byte _gap_0x1CA8[0x98];
    /* 0x1D40 */ byte Party[0x20];
    /* 0x1D60 */ byte Items[0x30];
    /* 0x1D90 */ byte Chests[0x20];
    /*        */ byte _gap_0x1DB0[0x10];
    /* 0x1DC0 */ unsigned __int32 BonusLootItemId;
    /* 0x1DC4 */ byte Floor;
    /* 0x1DC5 */ byte ReturnProgress;
    /* 0x1DC6 */ byte PassageProgress;
    /*        */ byte _gap_0x1DC7;
    /* 0x1DC8 */ byte WeaponLevel;
    /* 0x1DC9 */ byte ArmorLevel;
    /*        */ byte _gap_0x1DCA;
    /* 0x1DCB */ byte HoardCount;
    /*        */ byte _gap_0x1DCC[0x4];
    /*        */ byte _gap_0x1DD0[0xA08];
};

struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonChestInfo /* Size=0x2 */
{
    /* 0x0 */ byte ChestType;
    /* 0x1 */ signed __int8 RoomIndex;
};

struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonItemInfo /* Size=0x3 */
{
    /* 0x0 */ byte ItemId;
    /* 0x1 */ byte Count;
    /* 0x2 */ byte Flags;
};

struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonPartyInfo /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectId;
    /* 0x4 */ signed __int8 RoomIndex;
    /*     */ byte _gap_0x5;
    /*     */ byte _gap_0x6[0x2];
};

struct Client::Game::InstanceContent::InstanceContentOceanFishing /* Size=0x22F8 */
{
    /* 0x0000 */ Client::Game::InstanceContent::InstanceContentDirector InstanceContentDirector;
    /*        */ byte _gap_0x1CA8[0x20];
    /* 0x1CC8 */ unsigned __int32 CurrentRoute;
    /*        */ byte _gap_0x1CCC[0x4];
    /* 0x1CD0 */ byte CurrentZone;
    /*        */ byte _gap_0x1CD1;
    /*        */ byte _gap_0x1CD2[0x2];
    /*        */ byte _gap_0x1CD4[0x4];
    /* 0x1CD8 */ unsigned __int32 TimeOffset;
    /*        */ byte _gap_0x1CDC[0x4];
    /* 0x1CE0 */ bool SpectralCurrentActive;
    /*        */ byte _gap_0x1CE1;
    /*        */ byte _gap_0x1CE2[0x2];
    /*        */ byte _gap_0x1CE4[0x4];
    /*        */ byte _gap_0x1CE8[0x5F0];
    /* 0x22D8 */ unsigned __int32 Mission1Type;
    /* 0x22DC */ unsigned __int32 Mission2Type;
    /* 0x22E0 */ unsigned __int32 Mission3Type;
    /* 0x22E4 */ unsigned __int16 Mission1Progress;
    /* 0x22E6 */ unsigned __int16 Mission2Progress;
    /* 0x22E8 */ unsigned __int16 Mission3Progress;
    /*        */ byte _gap_0x22EA[0x2];
    /*        */ byte _gap_0x22EC[0x4];
    /*        */ byte _gap_0x22F0[0x8];
};

struct Client::Game::InstanceContent::PublicContentDirector /* Size=0x1088 */
{
    /* 0x0000 */ Client::Game::InstanceContent::ContentDirector ContentDirector;
    /*        */ byte _gap_0xC40[0x448];
};

struct Client::Game::InventoryContainer /* Size=0x18 */
{
    /* 0x00 */ Client::Game::InventoryItem* Items;
    /* 0x08 */ Client::Game::InventoryType Type;
    /* 0x0C */ unsigned __int32 Size;
    /* 0x10 */ byte Loaded;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Client::Game::InventoryItem /* Size=0x38 */
{
    /* 0x00 */ Client::Game::InventoryType Container;
    /* 0x04 */ __int16 Slot;
    /*      */ byte _gap_0x6[0x2];
    /* 0x08 */ unsigned __int32 ItemID;
    /* 0x0C */ unsigned __int32 Quantity;
    /* 0x10 */ unsigned __int16 Spiritbond;
    /* 0x12 */ unsigned __int16 Condition;
    /* 0x14 */ Client::Game::InventoryItem::ItemFlags Flags;
    /*      */ byte _gap_0x15;
    /*      */ byte _gap_0x16[0x2];
    /* 0x18 */ unsigned __int64 CrafterContentID;
    /* 0x20 */ unsigned __int16 Materia[0x5];
    /* 0x2A */ byte MateriaGrade[0x5];
    /* 0x2F */ byte Stain;
    /* 0x30 */ unsigned __int32 GlamourID;
    /*      */ byte _gap_0x34[0x4];
};

struct Client::Game::InventoryManager /* Size=0x3620 */
{
    /*        */ byte _gap_0x0[0x1E08];
    /* 0x1E08 */ Client::Game::InventoryContainer* Inventories;
    /*        */ byte _gap_0x1E10[0x1810];
};

struct Client::Game::LobbyCamera /* Size=0x300 */
{
    /* 0x000 */ Client::Game::Camera Camera;
    /*       */ byte _gap_0x2B0[0x48];
    /* 0x2F8 */ void* LobbyExcelSheet;
};

struct Client::Game::LowCutCamera /* Size=0x2E0 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /*       */ byte _gap_0x110[0x1D0];
};

struct Client::Game::MirageManager /* Size=0x1478 */
{
    /* 0x0000 */ bool IsApplyingGlamourPlate;
    /*        */ byte _gap_0x1;
    /*        */ byte _gap_0x2[0x2];
    /* 0x0004 */ unsigned __int32 PrismBoxItemIds[0x320];
    /* 0x0C84 */ byte PrismBoxStainIds[0x320];
    /* 0x0FA4 */ bool PrismBoxRequested;
    /* 0x0FA5 */ bool PrismBoxLoaded;
    /*        */ byte _gap_0xFA6[0x2];
    /* 0x0FA8 */ byte GlamourPlates[0x4B0];
    /* 0x1458 */ bool GlamourPlatesRequested;
    /* 0x1459 */ bool GlamourPlatesLoaded;
    /*        */ byte _gap_0x145A[0x2];
    /*        */ byte _gap_0x145C[0x4];
    /*        */ byte _gap_0x1460[0x18];
};

struct Client::Game::MirageManager::GlamourPlate /* Size=0x3C */
{
    /* 0x00 */ unsigned __int32 ItemIds[0xC];
    /* 0x30 */ byte StainIds[0xC];
};

struct Client::Game::MJI::MJIFarmPasture /* Size=0x4 */
{
    /* 0x0 */ byte Level;
    /* 0x1 */ byte HoursToCompletion;
    /*     */ byte _gap_0x2[0x2];
    /* 0x4 */ bool UnderConstruction;
    /*     */ byte _gap_0x5;
    /*     */ byte _gap_0x6[0x2];
    /* 0x8 */ byte UNK_0x4;
};

struct Client::Game::MJI::IslandState /* Size=0xD0 */
{
    /* 0x00 */ bool CanEditIsland;
    /* 0x01 */ byte CurrentRank;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 CurrentXP;
    /* 0x08 */ byte CurrentProgress;
    /* 0x09 */ byte VillageDevelopmentLevel;
    /* 0x0A */ byte PathsGlamourId;
    /* 0x0B */ byte GroundsGlamourId;
    /* 0x0C */ byte SlopesGlamourId;
    /* 0x0D */ byte UnlockedKeyItems[0x3];
    /* 0x10 */ byte UnlockedRecipes[0x3];
    /* 0x13 */ byte LockedPouchItems[0x5C];
    /* 0x6F */ Client::Game::MJI::MJIFarmPasture Farm;
    /* 0x73 */ Client::Game::MJI::MJIFarmPasture Pasture;
    /* 0x77 */ bool PastureUnderCare;
    /* 0x78 */ unsigned __int16 PastureDailyCareFee;
    /* 0x7A */ unsigned __int16 FarmDailyCareFee;
    /* 0x7C */ byte LandmarkHoursToCompletion[0x5];
    /* 0x81 */ byte LandmarkIds[0x5];
    /* 0x86 */ byte LandmarkUnderConstruction[0x5];
    /*      */ byte _gap_0x8B;
    /*      */ byte _gap_0x8C[0x4];
    /*      */ byte _gap_0x90[0x40];
};

struct Client::Game::MJI::MJIAnimal /* Size=0x34 */
{
    /* 0x00 */ byte SlotId;
    /* 0x01 */ byte Nickname[0x18];
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ unsigned __int32 BNPCNameId;
    /* 0x20 */ unsigned __int32 ObjectId;
    /* 0x24 */ byte AnimalType;
    /* 0x25 */ byte FoodLevel;
    /* 0x26 */ byte Mood;
    /* 0x27 */ unsigned __int16 Leavings;
    /*      */ byte _gap_0x29;
    /*      */ byte _gap_0x2A[0x2];
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x4];
};

struct Client::Game::MJI::MJIBuildingPlacement /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ unsigned __int32 PlaceId;
    /* 0x08 */ unsigned __int16 SgbId;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Game::MJI::MJIFarmPasturePlacement /* Size=0xC */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ byte SgbId;
    /*     */ byte _gap_0x9;
    /*     */ byte _gap_0xA[0x2];
};

struct Client::Game::MJI::MJIFarmState /* Size=0x148 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ void* vtbl2;
    /*       */ byte _gap_0x10[0x10];
    /* 0x020 */ byte SeedType[0x14];
    /* 0x034 */ byte GrowthLevel[0x14];
    /* 0x048 */ byte WaterLevel[0x14];
    /* 0x05C */ byte GardenerYield[0x14];
    /* 0x070 */ byte FarmSlotFlags[0x14];
    /*       */ byte _gap_0x84[0x4];
    /*       */ byte _gap_0x88[0xC0];
};

struct Client::Game::MJI::MJIGranaries /* Size=0x12 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ byte PlaceId[0x2];
    /* 0x0A */ byte GlamourLevel[0x2];
    /* 0x0C */ byte HoursToCompletion[0x2];
    /* 0x0E */ byte BuildingLevel[0x2];
    /* 0x10 */ byte UnderConstruction[0x2];
};

struct Client::Game::MJI::MJILandmarkPlacement /* Size=0xC */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ byte HoursToCompletion;
    /* 0x9 */ byte LandmarkId;
    /* 0xA */ unsigned __int16 UnderConstruction;
};

struct Client::Game::MJI::MJIManager /* Size=0x3F4 */
{
    /*       */ byte _gap_0x0[0x4];
    /*       */ byte _gap_0x4[0x2];
    /* 0x006 */ byte IsPlayerInSanctuary;
    /*       */ byte _gap_0x7;
    /* 0x008 */ Client::Game::MJI::MJIAllowedVisitors AllowedVisitors;
    /*       */ byte _gap_0x9;
    /*       */ byte _gap_0xA[0x2];
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ unsigned __int32 CurrentMode;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x4];
    /* 0x01C */ unsigned __int32 CurrentModeItem;
    /*       */ byte _gap_0x20[0x8];
    /* 0x028 */ Client::Game::MJI::IslandState IslandState;
    /*       */ byte _gap_0xF8[0x18];
    /* 0x110 */ Client::Game::MJI::MJIPastureHandler* PastureHandler;
    /* 0x118 */ Client::Game::MJI::MJIFarmState* FarmState;
    /*       */ byte _gap_0x120[0x90];
    /*       */ byte _gap_0x1B0[0x4];
    /* 0x1B4 */ byte LandmarkPlacements[0x3C];
    /* 0x1F0 */ byte BuildingPlacements[0x60];
    /* 0x250 */ Client::Game::MJI::MJIBuildingPlacement CabinPlacement;
    /* 0x260 */ byte FarmPlacements[0x24];
    /* 0x284 */ byte PasturePlacements[0x24];
    /*       */ byte _gap_0x2A8[0x10];
    /* 0x2B8 */ byte CurrentPopularity;
    /* 0x2B9 */ byte NextPopularity;
    /* 0x2BA */ byte SupplyAndDemandShifts[0x51];
    /*       */ byte _gap_0x30B;
    /*       */ byte _gap_0x30C[0x4];
    /*       */ byte _gap_0x310[0x58];
    /* 0x368 */ byte CurrentCycleDay;
    /* 0x369 */ byte CraftworksRestDays[0x4];
    /*       */ byte _gap_0x36D;
    /*       */ byte _gap_0x36E[0x2];
    /*       */ byte _gap_0x370[0x40];
    /*       */ byte _gap_0x3B0[0x4];
    /*       */ byte _gap_0x3B4[0x2];
    /* 0x3B6 */ unsigned __int32 CurrentGroove;
    /*       */ byte _gap_0x3BA[0x2];
    /*       */ byte _gap_0x3BC[0x4];
    /*       */ byte _gap_0x3C0[0x30];
    /*       */ byte _gap_0x3F0[0x4];
};

struct Client::Game::MJI::MJIMinionSlot /* Size=0xC */
{
    /* 0x0 */ byte SlotId;
    /*     */ byte _gap_0x1;
    /*     */ byte _gap_0x2[0x2];
    /* 0x4 */ unsigned __int32 ObjectId;
    /* 0x8 */ unsigned __int16 MinionId;
    /* 0xA */ byte PopAreaId;
    /*     */ byte _gap_0xB;
};

struct Client::Game::MJI::MJIPastureHandler /* Size=0xAE0 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x2E0];
    /* 0x2E8 */ byte MJIAnimals[0x410];
    /* 0x6F8 */ byte RoamingMinions[0x1F0];
    /* 0x8E8 */ byte MinionSlots[0x258];
};

struct Client::Game::MJI::MJIWorkshops /* Size=0x1C */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ byte PlaceId[0x4];
    /* 0x0C */ byte GlamourLevel[0x4];
    /* 0x10 */ byte HoursToCompletion[0x4];
    /* 0x14 */ byte BuildingLevel[0x4];
    /* 0x18 */ byte UnderConstruction[0x4];
};

struct Client::Game::MonsterNoteManager /* Size=0x460 */
{
    /* 0x000 */ byte RankDataArray[0x300];
    /*       */ byte _gap_0x300[0x160];
};

struct Client::Game::MonsterNoteRankInfo /* Size=0x40 */
{
    /* 0x00 */ byte RankDataArray[0x28];
    /* 0x28 */ __int64 Flags;
    /* 0x30 */ __int32 Rank;
    /* 0x34 */ __int32 Unknown2;
    /* 0x38 */ __int32 Index;
    /* 0x3C */ __int32 Unknown3;
};

struct Client::Game::Object::ClientObjectManager /* Size=0x0 */
{
};

struct Client::Game::Object::GameObject /* Size=0x1A0 */
{
    /* 0x000 */ Client::Game::Object::GameObject::GameObjectVTable* VTable;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Common::Math::Vector3 DefaultPosition;
    /* 0x020 */ float DefaultRotation;
    /*       */ byte _gap_0x24[0x4];
    /*       */ byte _gap_0x28[0x8];
    /* 0x030 */ byte Name[0x40];
    /*       */ byte _gap_0x70[0x4];
    /* 0x074 */ unsigned __int32 ObjectID;
    /*       */ byte _gap_0x78[0x8];
    /* 0x080 */ unsigned __int32 DataID;
    /* 0x084 */ unsigned __int32 OwnerID;
    /* 0x088 */ unsigned __int16 ObjectIndex;
    /*       */ byte _gap_0x8A[0x2];
    /* 0x08C */ byte ObjectKind;
    /* 0x08D */ byte SubKind;
    /* 0x08E */ byte Gender;
    /*       */ byte _gap_0x8F;
    /* 0x090 */ byte YalmDistanceFromPlayerX;
    /* 0x091 */ byte TargetStatus;
    /* 0x092 */ byte YalmDistanceFromPlayerZ;
    /*       */ byte _gap_0x93;
    /*       */ byte _gap_0x94;
    /* 0x095 */ Client::Game::Object::ObjectTargetableFlags TargetableStatus;
    /*       */ byte _gap_0x96[0x2];
    /*       */ byte _gap_0x98[0x18];
    /* 0x0B0 */ Common::Math::Vector3 Position;
    /* 0x0C0 */ float Rotation;
    /* 0x0C4 */ float Scale;
    /* 0x0C8 */ float Height;
    /* 0x0CC */ float VfxScale;
    /* 0x0D0 */ float HitboxRadius;
    /*       */ byte _gap_0xD4[0x4];
    /*       */ byte _gap_0xD8[0x8];
    /* 0x0E0 */ Common::Math::Vector3 DrawOffset;
    /*       */ byte _gap_0xF0[0x4];
    /* 0x0F4 */ Client::Game::Event::EventId EventId;
    /* 0x0F8 */ unsigned __int32 FateId;
    /*       */ byte _gap_0xFC[0x4];
    /* 0x100 */ Client::Graphics::Scene::DrawObject* DrawObject;
    /*       */ byte _gap_0x108[0x8];
    /* 0x110 */ unsigned __int32 NamePlateIconId;
    /* 0x114 */ __int32 RenderFlags;
    /*       */ byte _gap_0x118[0x40];
    /* 0x158 */ Client::Game::Event::LuaActor* LuaActor;
    /*       */ byte _gap_0x160[0x40];
};

struct Client::Game::Object::GameObject::GameObjectVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ __int64 GetObjectID;
    /* 0x10 */ __int64 GetObjectKind;
    /*     */ byte _gap_0x18[0x8];
    /* 0x20 */ __int64 GetIsTargetable;
    /*     */ byte _gap_0x28[0x8];
    /* 0x30 */ __int64 GetName;
    /* 0x38 */ __int64 GetRadius;
    /* 0x40 */ __int64 GetHeight;
    /*     */ byte _gap_0x48[0x38];
    /* 0x80 */ __int64 EnableDraw;
    /* 0x88 */ __int64 DisableDraw;
    /*     */ byte _gap_0x90[0x48];
    /* 0xD8 */ __int64 GetDrawObject;
    /*     */ byte _gap_0xE0[0x10];
    /* 0xF0 */ __int64 Highlight;
    /*     */ byte _gap_0xF8[0x80];
    /* 0x178 */ __int64 GetNpcID;
    /*     */ byte _gap_0x180[0x48];
    /* 0x1C8 */ __int64 IsDead;
    /* 0x1D0 */ __int64 IsNotMounted;
    /*     */ byte _gap_0x1D8[0x10];
    /* 0x1E8 */ __int64 IsCharacter;
};

struct Client::Game::Object::GameObjectManager /* Size=0x3888 */
{
    /*        */ byte _gap_0x0[0x4];
    /* 0x0004 */ byte Active;
    /*        */ byte _gap_0x5;
    /*        */ byte _gap_0x6[0x2];
    /*        */ byte _gap_0x8[0x10];
    /* 0x0018 */ __int64 ObjectList[0x257];
    /* 0x12D0 */ __int64 ObjectListFiltered[0x257];
    /* 0x2588 */ __int64 ObjectList3[0x257];
    /* 0x3840 */ __int32 ObjectListFilteredCount;
    /* 0x3844 */ __int32 ObjectList3Count;
    /*        */ byte _gap_0x3848[0x40];
};

struct Client::Game::QuestManager /* Size=0xF40 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ byte NormalQuests[0x2D0];
    /*       */ byte _gap_0x2E0[0x2D8];
    /* 0x5B8 */ byte DailyQuests[0xC0];
    /*       */ byte _gap_0x678[0x30];
    /* 0x6A8 */ byte TrackedQuests[0x50];
    /*       */ byte _gap_0x6F8[0x4D0];
    /* 0xBC8 */ byte BeastReputation[0x110];
    /* 0xCD8 */ byte LeveQuests[0x180];
    /* 0xE58 */ byte NumLeveAllowances;
    /*       */ byte _gap_0xE59;
    /*       */ byte _gap_0xE5A[0x2];
    /*       */ byte _gap_0xE5C[0x4];
    /*       */ byte _gap_0xE60[0xE0];
    /* 0xF40 */ byte NumAcceptedQuests;
    /*       */ byte _gap_0xF41;
    /*       */ byte _gap_0xF42[0x2];
    /*       */ byte _gap_0xF44[0x4];
    /*       */ byte _gap_0xF48[0x8];
    /* 0xF50 */ byte NumAcceptedLeveQuests;
};

struct Client::Game::RaceChocoboManager /* Size=0x26 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte MaximumSpeed;
    /* 0x09 */ byte Acceleration;
    /* 0x0A */ byte Endurance;
    /* 0x0B */ byte Stamina;
    /* 0x0C */ byte Cunning;
    /* 0x0D */ byte Parameters;
    /* 0x0E */ __int16 Father;
    /* 0x10 */ __int16 Mother;
    /* 0x12 */ byte AbilityHereditary;
    /* 0x13 */ byte AbilityLearned;
    /*      */ byte _gap_0x14[0x2];
    /* 0x16 */ __int16 NameFirst;
    /* 0x18 */ __int16 NameLast;
    /* 0x1A */ byte Rank;
    /*      */ byte _gap_0x1B;
    /* 0x1C */ __int16 ExperienceCurrent;
    /* 0x1E */ __int16 ExperienceMax;
    /* 0x20 */ byte Color;
    /* 0x21 */ byte GearHead;
    /* 0x22 */ byte GearBody;
    /* 0x23 */ byte GearLegs;
    /* 0x24 */ byte SessionsAvailable;
    /*      */ byte _gap_0x25;
};

struct Client::Game::RankData /* Size=0x4 */
{
    /* 0x0 */ byte Counts[0x4];
};

struct Client::Game::RecastDetail /* Size=0x14 */
{
    /* 0x00 */ byte IsActive;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 ActionID;
    /* 0x08 */ float Elapsed;
    /* 0x0C */ float Total;
    /*      */ byte _gap_0x10[0x4];
};

struct Client::Game::ReconstructionBoxData /* Size=0xA8 */
{
    /*      */ byte _gap_0x0[0xA0];
    /* 0xA0 */ unsigned __int16 Donated;
    /*      */ byte _gap_0xA2[0x2];
    /*      */ byte _gap_0xA4[0x2];
    /* 0xA6 */ unsigned __int16 Allowance;
};

struct Client::Game::ReconstructionBoxManager /* Size=0x10 */
{
    /* 0x00 */ Client::Game::ReconstructionBoxData* ReconstructionBoxData;
    /* 0x08 */ void* UnknownDataPointer;
};

struct Client::Game::RetainerManager /* Size=0x2E8 */
{
    /* 0x000 */ byte Retainers[0x2D0];
    /* 0x2D0 */ byte DisplayOrder[0xA];
    /* 0x2DA */ byte Ready;
    /* 0x2DB */ byte MaxRetainerEntitlement;
    /*       */ byte _gap_0x2DC[0x4];
    /* 0x2E0 */ unsigned __int64 LastSelectedRetainerId;
    /* 0x2E8 */ unsigned __int32 RetainerObjectId;
};

struct Client::Game::RetainerManager::Retainer /* Size=0x48 */
{
    /* 0x00 */ unsigned __int64 RetainerID;
    /* 0x08 */ byte Name[0x20];
    /* 0x28 */ bool Available;
    /* 0x29 */ byte ClassJob;
    /* 0x2A */ byte Level;
    /* 0x2B */ byte ItemCount;
    /* 0x2C */ unsigned __int32 Gil;
    /* 0x30 */ Client::Game::RetainerManager::RetainerTown Town;
    /* 0x31 */ byte MarkerItemCount;
    /*      */ byte _gap_0x32[0x2];
    /* 0x34 */ unsigned __int32 MarketExpire;
    /* 0x38 */ unsigned __int32 VentureID;
    /* 0x3C */ unsigned __int32 VentureComplete;
    /*      */ byte _gap_0x40[0x8];
};

struct Client::Game::SatisfactionSupplyManager /* Size=0x31F */
{
    /*       */ byte _gap_0x0[0x10];
    /*       */ byte _gap_0x10[0x4];
    /* 0x014 */ byte SatisfactionRankArray[0x9];
    /* 0x01D */ byte UsedAllowanceArray[0x9];
    /*       */ byte _gap_0x26[0x2];
    /*       */ byte _gap_0x28[0x2F0];
    /*       */ byte _gap_0x318[0x4];
    /*       */ byte _gap_0x31C[0x2];
    /*       */ byte _gap_0x31E;
};

struct Client::Game::SavedAppearanceManager /* Size=0x9EB8 */
{
    /* 0x0000 */ Client::Game::SavedAppearanceManager::SavedAppearanceManagerVTable* VTable;
    /* 0x0008 */ byte Slot[0x3200];
    /*        */ byte _gap_0x3208[0x6CB0];
};

struct Client::Game::SavedAppearanceManager::SavedAppearanceManagerVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ __int64 IsSlotCreated;
    /* 0x10 */ __int64 GetSlot;
    /*     */ byte _gap_0x18[0x18];
    /* 0x30 */ __int64 GetSlotCount;
};

struct Client::Game::SavedAppearanceSlot /* Size=0x140 */
{
    /* 0x000 */ unsigned __int32 Magic;
    /* 0x004 */ unsigned __int32 Version;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Client::Game::Character::CustomizeData CustomizeData;
    /*       */ byte _gap_0x2A[0x2];
    /*       */ byte _gap_0x2C[0x4];
    /* 0x030 */ byte LabelBytes[0x40];
    /*       */ byte _gap_0x70[0xC0];
    /*       */ byte _gap_0x130[0x4];
    /* 0x134 */ bool IsCreated;
    /*       */ byte _gap_0x135;
    /*       */ byte _gap_0x136[0x2];
    /*       */ byte _gap_0x138[0x4];
    /* 0x13C */ byte SlotIndex;
    /*       */ byte _gap_0x13D;
    /*       */ byte _gap_0x13E[0x2];
};

struct Client::Game::Status /* Size=0xC */
{
    /* 0x0 */ unsigned __int16 StatusID;
    /*     */ byte _gap_0x2[0x2];
    /* 0x4 */ float RemainingTime;
    /* 0x8 */ unsigned __int32 SourceID;
};

struct Client::Game::UI::Achievement /* Size=0x550 */
{
    /* 0x000 */ void** VTable;
    /* 0x008 */ Client::Game::UI::Achievement::AchievementState State;
    /* 0x00C */ byte CompletedAchievements[0x1AC];
    /*       */ byte _gap_0x1B8[0x20];
    /*       */ byte _gap_0x1D8[0x4];
    /* 0x1DC */ Client::Game::UI::Achievement::AchievementState ProgressRequestState;
    /* 0x1E0 */ unsigned __int32 ProgressAchievementId;
    /* 0x1E4 */ unsigned __int32 ProgressCurrent;
    /* 0x1E8 */ unsigned __int32 ProgressMax;
    /*       */ byte _gap_0x1EC[0x4];
    /*       */ byte _gap_0x1F0[0x360];
};

struct Client::Game::UI::AreaInstance /* Size=0x28 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ void* vtbl;
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ __int32 Instance;
    /*      */ byte _gap_0x24[0x4];
};

struct Client::Game::UI::Buddy::BuddyMember /* Size=0x198 */
{
    /* 0x000 */ unsigned __int32 ObjectID;
    /* 0x004 */ unsigned __int32 CurrentHealth;
    /* 0x008 */ unsigned __int32 MaxHealth;
    /* 0x00C */ byte DataID;
    /* 0x00D */ byte Synced;
    /*       */ byte _gap_0xE[0x2];
    /* 0x010 */ Client::Game::StatusManager StatusManager;
};

struct Client::Game::UI::Buddy /* Size=0xED8 */
{
    /* 0x000 */ Client::Game::UI::Buddy::BuddyMember Companion;
    /* 0x198 */ Client::Game::UI::Buddy::BuddyMember Pet;
    /* 0x330 */ byte BattleBuddies[0xB28];
    /* 0xE58 */ Client::Game::UI::Buddy::BuddyMember* CompanionPtr;
    /* 0xE60 */ float TimeLeft;
    /*       */ byte _gap_0xE64[0x4];
    /*       */ byte _gap_0xE68[0x8];
    /*       */ byte _gap_0xE70[0x2];
    /*       */ byte _gap_0xE72;
    /* 0xE73 */ byte Name[0x15];
    /* 0xE88 */ unsigned __int32 CurrentXP;
    /* 0xE8C */ byte Rank;
    /* 0xE8D */ byte Stars;
    /* 0xE8E */ byte SkillPoints;
    /* 0xE8F */ byte DefenderLevel;
    /* 0xE90 */ byte AttackerLevel;
    /* 0xE91 */ byte HealerLevel;
    /* 0xE92 */ byte ActiveCommand;
    /* 0xE93 */ byte FavoriteFeed;
    /* 0xE94 */ byte CurrentColorStainId;
    /* 0xE95 */ byte Mounted;
    /*       */ byte _gap_0xE96[0x2];
    /*       */ byte _gap_0xE98[0x8];
    /* 0xEA0 */ Client::Game::UI::Buddy::BuddyMember* PetPtr;
    /*       */ byte _gap_0xEA8[0x8];
    /* 0xEB0 */ Client::Game::UI::Buddy::BuddyMember* SquadronTrustPtr;
    /*       */ byte _gap_0xEB8[0x20];
};

struct Client::Game::UI::Cabinet /* Size=0x48 */
{
    /* 0x00 */ Client::Game::UI::Cabinet::CabinetState State;
    /* 0x04 */ byte UnlockedItems[0x41];
    /*      */ byte _gap_0x45;
    /*      */ byte _gap_0x46[0x2];
};

struct Client::Game::UI::Chain /* Size=0x8 */
{
    /* 0x0 */ float RemainingTime;
    /* 0x4 */ float MaxTime;
};

struct Client::Game::UI::ContentsFinder /* Size=0xB0 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x10];
    /* 0x18 */ Client::Game::UI::ContentsFinder::LootRule LootRules;
    /* 0x19 */ bool IsUnrestrictedParty;
    /* 0x1A */ bool IsMinimalIL;
    /* 0x1B */ bool IsSilenceEcho;
    /* 0x1C */ bool IsExplorerMode;
    /* 0x1D */ bool IsLevelSync;
    /* 0x1E */ bool IsLimitedLevelingRoulette;
    /*      */ byte _gap_0x1F;
    /*      */ byte _gap_0x20[0x40];
    /* 0x60 */ __int32 EnteredQueueTimestamp;
    /*      */ byte _gap_0x64[0x4];
    /*      */ byte _gap_0x68[0x10];
    /*      */ byte _gap_0x78[0x4];
    /* 0x7C */ byte PositionInQueue;
    /*      */ byte _gap_0x7D;
    /*      */ byte _gap_0x7E[0x2];
    /*      */ byte _gap_0x80[0x4];
    /*      */ byte _gap_0x84[0x2];
    /*      */ byte _gap_0x86;
    /* 0x87 */ byte AverageWaitTime;
    /*      */ byte _gap_0x88[0x28];
};

struct Client::Game::UI::ContentsNote /* Size=0xA8 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte CompletionFlags[0xB];
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ byte SelectedTab;
    /* 0x1D */ byte DisplayCount;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ __int32 DisplayID[0x11];
    /* 0x64 */ __int32 DisplayStatus[0x11];
};

struct Client::Game::UI::ExtraInspectDataEntry /* Size=0x8 */
{
    /* 0x0 */ __int32 Key;
    /* 0x4 */ __int32 Value;
};

struct Client::Game::UI::FieldMarker /* Size=0x20 */
{
    /* 0x00 */ System::Numerics::Vector3 Position;
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ __int32 X;
    /* 0x14 */ __int32 Y;
    /* 0x18 */ __int32 Z;
    /* 0x1C */ bool Active;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
};

struct Client::Game::UI::Hate /* Size=0x108 */
{
    /* 0x000 */ byte HateArray[0x100];
    /* 0x100 */ __int32 HateArrayLength;
    /* 0x104 */ unsigned __int32 HateTargetId;
};

struct Client::Game::UI::HateInfo /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectId;
    /* 0x4 */ __int32 Enmity;
};

struct Client::Game::UI::Hater /* Size=0x908 */
{
    /* 0x000 */ byte HaterArray[0x900];
    /* 0x900 */ __int32 HaterArrayLength;
    /*       */ byte _gap_0x904[0x4];
};

struct Client::Game::UI::HaterInfo /* Size=0x48 */
{
    /* 0x00 */ byte Name[0x40];
    /* 0x40 */ unsigned __int32 ObjectId;
    /* 0x44 */ __int32 Enmity;
};

struct Client::Game::UI::Hotbar /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::Game::UI::Inspect /* Size=0x268 */
{
    /*       */ byte _gap_0x0[0x8];
    /*       */ byte _gap_0x8[0x4];
    /* 0x00C */ unsigned __int32 ObjectID;
    /* 0x010 */ byte Type;
    /*       */ byte _gap_0x11;
    /* 0x012 */ __int16 WorldId;
    /* 0x014 */ byte Name[0x40];
    /* 0x054 */ byte PSNOnlineID[0x11];
    /*       */ byte _gap_0x65;
    /* 0x066 */ byte ClassJobId;
    /* 0x067 */ byte Level;
    /* 0x068 */ byte SyncedLevel;
    /*       */ byte _gap_0x69;
    /* 0x06A */ unsigned __int16 AverageItemLevel;
    /* 0x06C */ unsigned __int16 TitleId;
    /* 0x06E */ byte GrandCompanyIndex;
    /* 0x06F */ byte GrandCompanyRank;
    /* 0x070 */ Client::Game::Character::CustomizeData CustomizeData;
    /* 0x08A */ byte BuddyEquipTop;
    /* 0x08B */ byte BuddyEquipBody;
    /* 0x08C */ byte BuddyEquipLegs;
    /*       */ byte _gap_0x8D;
    /*       */ byte _gap_0x8E[0x2];
    /*       */ byte _gap_0x90[0x38];
    /* 0x0C8 */ unsigned __int32 BaseParams[0x4A];
    /*       */ byte _gap_0x1F0[0x2];
    /* 0x1F2 */ byte GearVisibilityFlag;
    /*       */ byte _gap_0x1F3;
    /*       */ byte _gap_0x1F4[0x4];
    /*       */ byte _gap_0x1F8[0x8];
    /*       */ byte _gap_0x200;
    /* 0x201 */ byte BuddyOwnerName[0x40];
    /* 0x241 */ byte BuddyRank;
    /* 0x242 */ byte BuddyStain;
    /* 0x243 */ byte BuddyDefenderLevel;
    /* 0x244 */ byte BuddyAttackerLevel;
    /* 0x245 */ byte BuddyHealerLevel;
    /*       */ byte _gap_0x246[0x2];
    /*       */ byte _gap_0x248[0x4];
    /* 0x24C */ byte ExtraInspectData[0x18];
    /*       */ byte _gap_0x264[0x4];
};

struct Client::Game::UI::LimitBreakController /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte BarCount;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 CurrentValue;
    /* 0x0C */ unsigned __int32 BarValue;
};

struct Client::Game::UI::Loot /* Size=0x6A0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ byte ItemArray[0x400];
    /* 0x410 */ __int32 SelectedIndex;
    /*       */ byte _gap_0x414[0x4];
    /* 0x418 */ unsigned __int32 UnkObjectId;
    /*       */ byte _gap_0x41C[0x4];
    /*       */ byte _gap_0x420[0x258];
    /* 0x678 */ unsigned __int32 UnkObjectId2;
    /*       */ byte _gap_0x67C[0x4];
    /*       */ byte _gap_0x680[0x20];
};

struct Client::Game::UI::LootItem /* Size=0x40 */
{
    /* 0x00 */ unsigned __int32 ChestObjectId;
    /* 0x04 */ unsigned __int32 ChestItemIndex;
    /* 0x08 */ unsigned __int32 ItemId;
    /* 0x0C */ unsigned __int16 ItemCount;
    /*      */ byte _gap_0xE[0x2];
    /*      */ byte _gap_0x10[0x10];
    /* 0x20 */ Client::Game::UI::RollState RollState;
    /* 0x24 */ Client::Game::UI::RollResult RollResult;
    /* 0x28 */ unsigned __int32 RollValue;
    /* 0x2C */ float Time;
    /* 0x30 */ float MaxTime;
    /*      */ byte _gap_0x34[0x4];
    /* 0x38 */ Client::Game::UI::LootMode LootMode;
    /*      */ byte _gap_0x3C[0x4];
};

struct StdVector::ClientGameUIMapMarkerData /* Size=0x18 */
{
    /* 0x00 */ Client::Game::UI::MapMarkerData* First;
    /* 0x08 */ Client::Game::UI::MapMarkerData* Last;
    /* 0x10 */ Client::Game::UI::MapMarkerData* End;
};

struct Client::Game::UI::MapMarkerContainer /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerContainer::LinkedList* List;
    /* 0x8 */ __int32 Size;
};

struct Client::Game::UI::SimpleMapMarkerContainer /* Size=0x0 */
{
    /* 0x0 */ unsigned __int64 CurrentSize;
    /* 0x8 */ __int64 InternalPointer;
    /* 0x10 */ Client::Game::UI::SimpleMapMarkerData** DataArray;
    /* 0x18 */ unsigned __int64 MaxSize;
};

struct Client::Game::UI::Map /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x90];
    /* 0x90 */ byte QuestData[0x10E0];
    /* 0x1170 */ byte LevequestData[0x900];
    /*     */ byte _gap_0x1A70[0x78];
    /* 0x1AE8 */ StdVector::ClientGameUIMapMarkerData ActiveLevequestMarkerData;
    /*     */ byte _gap_0x1B00[0x10];
    /* 0x1B10 */ Client::Game::UI::MapMarkerContainer QuestMarkerData;
    /*     */ byte _gap_0x1B10[0x8];
    /* 0x1B18 */ Client::Game::UI::SimpleMapMarkerContainer SimpleQuestMarkerData;
    /*     */ byte _gap_0x1B18[0x40];
    /* 0x1B58 */ Client::Game::UI::MapMarkerContainer GuildLeveAssignmentMapMarkerData;
    /*     */ byte _gap_0x1B58[0x48];
    /* 0x1BA0 */ Client::Game::UI::MapMarkerContainer GuildOrderGuideMarkerData;
    /*     */ byte _gap_0x1BA0[0x22F0];
    /* 0x3E90 */ Client::Game::UI::MapMarkerContainer TripleTriadMarkerData;
    /*     */ byte _gap_0x3E90[0x10];
    /* 0x3EA0 */ Client::Game::UI::MapMarkerContainer CustomTalkMarkerData;
    /*     */ byte _gap_0x3EA0[0x8];
    /* 0x3EA8 */ Client::Game::UI::SimpleMapMarkerContainer SimpleCustomTalkMarkerData;
    /*     */ byte _gap_0x3EA8[0xA0];
    /* 0x3F48 */ Client::Game::UI::MapMarkerContainer GemstoneTraderMarkerData;
    /*     */ byte _gap_0x3F48[0x8];
    /* 0x3F50 */ Client::Game::UI::SimpleMapMarkerContainer SimpleGemstoneTraderMarkerData;
};

struct Client::Game::UI::MapMarkerContainer::LinkedList /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerNode* First;
    /* 0x8 */ Client::Game::UI::MapMarkerNode* Last;
};

struct Client::Game::UI::MapMarkerData /* Size=0x48 */
{
    /* 0x00 */ unsigned __int32 LevelId;
    /* 0x04 */ unsigned __int32 ObjectiveId;
    /* 0x08 */ Client::System::String::Utf8String* TooltipString;
    /* 0x10 */ unsigned __int32 IconId;
    /*      */ byte _gap_0x14[0x4];
    /* 0x18 */ float X;
    /* 0x1C */ float Y;
    /* 0x20 */ float Z;
    /* 0x24 */ float Radius;
    /*      */ byte _gap_0x28[0x10];
    /*      */ byte _gap_0x38[0x4];
    /* 0x3C */ unsigned __int16 RecommendedLevel;
    /*      */ byte _gap_0x3E[0x2];
    /*      */ byte _gap_0x40[0x8];
};

struct Client::Game::UI::MarkerInfo /* Size=0x90 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ unsigned __int32 ObjectiveId;
    /* 0x08 */ Client::System::String::Utf8String Label;
    /* 0x70 */ StdVector::ClientGameUIMapMarkerData MarkerData;
    /*      */ byte _gap_0x88[0x2];
    /*      */ byte _gap_0x8A;
    /* 0x8B */ bool ShouldRender;
    /*      */ byte _gap_0x8C[0x4];
};

struct Client::Game::UI::MapMarkerNode /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerNode* Next;
    /* 0x8 */ Client::Game::UI::MapMarkerNode* Previous;
    /* 0x10 */ Client::Game::UI::MarkerInfo Data;
};

struct Client::Game::UI::MarkingController /* Size=0x2E0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ __int64 MarkerArray[0x11];
    /* 0x098 */ unsigned __int32 LetterMarkerArray[0x1A];
    /* 0x100 */ __int64 MarkerTimeArray[0x11];
    /*       */ byte _gap_0x188[0x58];
    /* 0x1E0 */ byte FieldMarkerArray[0x100];
};

struct Client::Game::UI::MobHunt /* Size=0x198 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ byte AvailableMarkId[0x12];
    /* 0x01A */ byte ObtainedMarkId[0x12];
    /* 0x02C */ byte CurrentKills[0x168];
    /* 0x194 */ __int32 ObtainedFlags;
};

struct Client::Game::UI::MobHunt::KillCounts /* Size=0x14 */
{
    /* 0x00 */ __int32 Counts[0x5];
};

struct Client::Game::UI::PlayerState /* Size=0x7E8 */
{
    /* 0x000 */ byte IsLoaded;
    /* 0x001 */ byte CharacterName[0x40];
    /* 0x041 */ byte PSNOnlineID[0x11];
    /*       */ byte _gap_0x52[0x2];
    /* 0x054 */ unsigned __int32 ObjectId;
    /* 0x058 */ unsigned __int64 ContentId;
    /* 0x060 */ unsigned __int32 PenaltyTimestamps[0x2];
    /*       */ byte _gap_0x68;
    /* 0x069 */ byte MaxLevel;
    /* 0x06A */ byte MaxExpansion;
    /* 0x06B */ byte Sex;
    /* 0x06C */ byte Race;
    /* 0x06D */ byte Tribe;
    /* 0x06E */ byte CurrentClassJobId;
    /*       */ byte _gap_0x6F;
    /*       */ byte _gap_0x70[0x8];
    /* 0x078 */ __int16 CurrentLevel;
    /* 0x07A */ __int16 ClassJobLevelArray[0x1E];
    /*       */ byte _gap_0xB6[0x2];
    /* 0x0B8 */ __int32 ClassJobExpArray[0x1E];
    /* 0x130 */ __int16 SyncedLevel;
    /* 0x132 */ byte IsLevelSynced;
    /* 0x133 */ bool HasPremiumSaddlebag;
    /*       */ byte _gap_0x134[0x2];
    /* 0x136 */ byte GuardianDeity;
    /* 0x137 */ byte BirthMonth;
    /* 0x138 */ byte BirthDay;
    /* 0x139 */ byte FirstClass;
    /* 0x13A */ byte StartTown;
    /* 0x13B */ byte QuestSpecialFlags;
    /*       */ byte _gap_0x13C[0x4];
    /*       */ byte _gap_0x140[0x10];
    /*       */ byte _gap_0x150[0x4];
    /* 0x154 */ __int32 BaseStrength;
    /* 0x158 */ __int32 BaseDexterity;
    /* 0x15C */ __int32 BaseVitality;
    /* 0x160 */ __int32 BaseIntelligence;
    /* 0x164 */ __int32 BaseMind;
    /* 0x168 */ __int32 BasePiety;
    /* 0x16C */ __int32 Attributes[0x4A];
    /* 0x294 */ byte GrandCompany;
    /* 0x295 */ byte GCRankMaelstrom;
    /* 0x296 */ byte GCRankTwinAdders;
    /* 0x297 */ byte GCRankImmortalFlames;
    /* 0x298 */ byte HomeAetheryteId;
    /* 0x299 */ byte FavouriteAetheryteCount;
    /* 0x29A */ byte FavouriteAetheryteArray[0x4];
    /* 0x29E */ byte FreeAetheryteId;
    /*       */ byte _gap_0x29F;
    /* 0x2A0 */ unsigned __int32 BaseRestedExperience;
    /*       */ byte _gap_0x2A4[0x4];
    /*       */ byte _gap_0x2A8[0x40];
    /* 0x2E8 */ byte NumOwnedMounts;
    /*       */ byte _gap_0x2E9;
    /*       */ byte _gap_0x2EA[0x2];
    /*       */ byte _gap_0x2EC[0x4];
    /*       */ byte _gap_0x2F0[0x148];
    /* 0x438 */ unsigned __int32 NumFishCaught;
    /* 0x43C */ unsigned __int32 FishingBait;
    /*       */ byte _gap_0x440[0x28];
    /*       */ byte _gap_0x468[0x4];
    /* 0x46C */ unsigned __int32 NumSpearfishCaught;
    /*       */ byte _gap_0x470[0x4];
    /* 0x474 */ byte ContentRouletteCompletion[0xC];
    /* 0x480 */ __int16 PlayerCommendations;
    /* 0x482 */ byte SelectedPoses[0x7];
    /* 0x489 */ byte PlayerStateFlags1;
    /* 0x48A */ byte PlayerStateFlags2;
    /* 0x48B */ byte PlayerStateFlags3;
    /*       */ byte _gap_0x48C[0x4];
    /*       */ byte _gap_0x490[0x78];
    /*       */ byte _gap_0x508;
    /* 0x509 */ byte UnlockFlags[0x2C];
    /*       */ byte _gap_0x535;
    /*       */ byte _gap_0x536[0x2];
    /*       */ byte _gap_0x538;
    /* 0x539 */ byte DeliveryLevel;
    /*       */ byte _gap_0x53A;
    /* 0x53B */ byte MeisterFlag;
    /*       */ byte _gap_0x53C[0x4];
    /* 0x540 */ unsigned __int32 SquadronMissionCompletionTimestamp;
    /* 0x544 */ unsigned __int32 SquadronTrainingCompletionTimestamp;
    /* 0x548 */ unsigned __int16 ActiveGcArmyExpedition;
    /* 0x54A */ unsigned __int16 ActiveGcArmyTraining;
    /*       */ byte _gap_0x54C[0x4];
    /*       */ byte _gap_0x550[0x108];
    /* 0x658 */ byte WeeklyBingoOrderData[0x10];
    /* 0x668 */ byte WeeklyBingoRewardData[0x4];
    /*       */ byte _gap_0x66C[0x4];
    /*       */ byte _gap_0x670[0x8];
    /* 0x678 */ byte WeeklyBingoRequestOpenBingoNo;
    /*       */ byte _gap_0x679;
    /*       */ byte _gap_0x67A[0x2];
    /*       */ byte _gap_0x67C[0x4];
    /*       */ byte _gap_0x680[0x30];
    /*       */ byte _gap_0x6B0[0x4];
    /* 0x6B4 */ byte WeeklyBingoExpMultiplier;
    /* 0x6B5 */ bool WeeklyBingoUnk63;
    /*       */ byte _gap_0x6B6[0x2];
    /*       */ byte _gap_0x6B8[0x90];
    /*       */ byte _gap_0x748[0x4];
    /* 0x74C */ byte MentorVersion;
    /*       */ byte _gap_0x74D;
    /*       */ byte _gap_0x74E[0x2];
    /* 0x750 */ unsigned __int32 DesynthesisLevels[0x8];
    /*       */ byte _gap_0x770[0x78];
};

struct Client::Game::UI::PvPProfile /* Size=0x7C */
{
    /* 0x00 */ byte IsLoaded;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 ExperienceMaelstrom;
    /* 0x08 */ unsigned __int32 ExperienceTwinAdder;
    /* 0x0C */ unsigned __int32 ExperienceImmortalFlames;
    /* 0x10 */ byte RankMaelstrom;
    /* 0x11 */ byte RankTwinAdder;
    /* 0x12 */ byte RankImmortalFlames;
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x4];
    /*      */ byte _gap_0x1C[0x2];
    /* 0x1E */ byte Series;
    /* 0x1F */ byte SeriesCurrentRank;
    /* 0x20 */ byte SeriesClaimedRank;
    /*      */ byte _gap_0x21;
    /* 0x22 */ unsigned __int16 SeriesExperience;
    /* 0x24 */ byte PreviousSeriesClaimedRank;
    /* 0x25 */ byte PreviousSeriesRank;
    /*      */ byte _gap_0x26[0x2];
    /* 0x28 */ unsigned __int32 FrontlineTotalMatches;
    /* 0x2C */ unsigned __int32 FrontlineTotalFirstPlace;
    /* 0x30 */ unsigned __int32 FrontlineTotalSecondPlace;
    /* 0x34 */ unsigned __int32 FrontlineTotalThirdPlace;
    /* 0x38 */ unsigned __int16 FrontlineWeeklyMatches;
    /* 0x3A */ unsigned __int16 FrontlineWeeklyFirstPlace;
    /* 0x3C */ unsigned __int16 FrontlineWeeklySecondPlace;
    /* 0x3E */ unsigned __int16 FrontlineWeeklyThirdPlace;
    /*      */ byte _gap_0x40;
    /* 0x41 */ byte CrystallineConflictSeason;
    /* 0x42 */ unsigned __int16 CrystallineConflictCasualMatches;
    /* 0x44 */ unsigned __int16 CrystallineConflictCasualMatchesWon;
    /* 0x46 */ unsigned __int16 CrystallineConflictRankedMatches;
    /* 0x48 */ unsigned __int16 CrystallineConflictRankedMatchesWon;
    /*      */ byte _gap_0x4A[0x2];
    /*      */ byte _gap_0x4C[0x2];
    /* 0x4E */ unsigned __int16 CrystallineConflictCurrentCrystalCredit;
    /* 0x50 */ unsigned __int16 CrystallineConflictHighestCrystalCredit;
    /*      */ byte _gap_0x52[0x2];
    /* 0x54 */ byte CrystallineConflictCurrentRank;
    /* 0x55 */ byte CrystallineConflictHighestRank;
    /* 0x56 */ byte CrystallineConflictCurrentRiser;
    /* 0x57 */ byte CrystallineConflictHighestRiser;
    /* 0x58 */ byte CrystallineConflictCurrentRisingStars;
    /* 0x59 */ byte CrystallineConflictHighestRisingStars;
    /*      */ byte _gap_0x5A[0x2];
    /*      */ byte _gap_0x5C[0x4];
    /*      */ byte _gap_0x60[0x8];
    /*      */ byte _gap_0x68[0x4];
    /* 0x6C */ unsigned __int32 RivalWingsTotalMatches;
    /* 0x70 */ unsigned __int32 RivalWingsTotalMatchesWon;
    /* 0x74 */ unsigned __int32 RivalWingsWeeklyMatches;
    /* 0x78 */ unsigned __int32 RivalWingsWeeklyMatchesWon;
};

struct Client::Game::UI::RecipeNote /* Size=0x610 */
{
    /* 0x000 */ unsigned __int32 Jobs[0x8];
    /*       */ byte _gap_0x20[0x98];
    /* 0x0B8 */ Client::Game::UI::RecipeNote::RecipeData* RecipeList;
    /*       */ byte _gap_0xC0[0x550];
};

struct Client::Game::UI::RecipeNote::RecipeData /* Size=0x3B0 */
{
    /* 0x000 */ Client::Game::UI::RecipeNote::RecipeEntry* Recipes;
    /*       */ byte _gap_0x8[0x3A0];
    /* 0x3A8 */ unsigned __int16 SelectedIndex;
    /*       */ byte _gap_0x3AA[0x2];
    /*       */ byte _gap_0x3AC[0x4];
};

struct Client::Game::UI::RecipeNote::RecipeEntry /* Size=0x4F8 */
{
    /*       */ byte _gap_0x0[0x4C0];
    /*       */ byte _gap_0x4C0[0x2];
    /* 0x4C2 */ unsigned __int16 RecipeId;
    /*       */ byte _gap_0x4C4[0x4];
    /*       */ byte _gap_0x4C8[0x18];
    /*       */ byte _gap_0x4E0[0x4];
    /*       */ byte _gap_0x4E4[0x2];
    /*       */ byte _gap_0x4E6;
    /* 0x4E7 */ byte CraftType;
    /*       */ byte _gap_0x4E8[0x10];
};

struct Client::Game::UI::RelicNote /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte RelicID;
    /* 0x09 */ byte RelicNoteID;
    /* 0x0A */ byte MonsterProgress[0xA];
    /* 0x14 */ __int32 ObjectiveProgress;
};

struct Component::GUI::AtkEventInterface /* Size=0x8 */
{
    /* 0x0 */ void** vtbl;
};

struct Client::Game::UI::Revive /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AtkEventInterface AtkEventInterface;
    /*      */ byte _gap_0x8[0x8];
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ float Timer;
    /*      */ byte _gap_0x18[0x8];
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ byte ReviveState;
    /*      */ byte _gap_0x25;
    /*      */ byte _gap_0x26[0x2];
    /*      */ byte _gap_0x28[0x8];
};

struct Client::Game::UI::RouletteController /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x70];
};

struct Client::Game::UI::SelectUseTicketInvoker /* Size=0x28 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ Client::Game::UI::Telepo* Telepo;
    /*      */ byte _gap_0x18[0x10];
};

struct Client::Game::UI::SimpleMapMarkerData /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 IconId;
    /* 0x04 */ unsigned __int32 LevelId;
    /* 0x08 */ unsigned __int32 ObjectiveId;
    /* 0x0C */ __int32 Flags;
};

struct StdVector::ClientGameUITeleportInfo /* Size=0x18 */
{
    /* 0x00 */ Client::Game::UI::TeleportInfo* First;
    /* 0x08 */ Client::Game::UI::TeleportInfo* Last;
    /* 0x10 */ Client::Game::UI::TeleportInfo* End;
};

struct Client::Game::UI::Telepo /* Size=0x58 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ StdVector::ClientGameUITeleportInfo TeleportList;
    /* 0x28 */ Client::Game::UI::SelectUseTicketInvoker UseTicketInvoker;
    /*      */ byte _gap_0x50[0x8];
};

struct Client::Game::UI::TeleportInfo /* Size=0x20 */
{
    /* 0x00 */ unsigned __int32 AetheryteId;
    /* 0x04 */ unsigned __int32 GilCost;
    /* 0x08 */ unsigned __int16 TerritoryId;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x8];
    /* 0x18 */ byte Ward;
    /* 0x19 */ byte Plot;
    /* 0x1A */ byte SubIndex;
    /* 0x1B */ byte IsFavourite;
    /*      */ byte _gap_0x1C[0x4];
};

struct Client::Game::UI::TerritoryInfo /* Size=0x60 */
{
    /*      */ byte _gap_0x0[0x18];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ __int32 InSanctuary;
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ unsigned __int32 AreaPlaceNameID;
    /* 0x28 */ unsigned __int32 SubAreaPlaceNameID;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x30];
};

struct Client::Game::UI::WeaponState /* Size=0x18 */
{
    /* 0x00 */ bool IsUnsheathed;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ float SheatheCooldown;
    /* 0x08 */ float AutoSheathTimer;
    /* 0x0C */ bool AutoSheatheState;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
    /* 0x10 */ bool IsAutoAttacking;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Client::Game::UI::UIState /* Size=0x16BAC */
{
    /* 0x00000 */ Client::Game::UI::Hotbar Hotbar;
    /* 0x00008 */ Client::Game::UI::Hate Hate;
    /* 0x00110 */ Client::Game::UI::Hater Hater;
    /* 0x00A18 */ Client::Game::UI::Chain Chain;
    /* 0x00A20 */ Client::Game::UI::WeaponState WeaponState;
    /* 0x00A38 */ Client::Game::UI::PlayerState PlayerState;
    /* 0x01220 */ Client::Game::UI::Revive Revive;
    /* 0x01250 */ Client::Game::UI::Inspect Inspect;
    /* 0x014B8 */ Client::Game::UI::Telepo Telepo;
    /* 0x01510 */ Client::Game::UI::Cabinet Cabinet;
    /*         */ byte _gap_0x1558[0x8];
    /* 0x01560 */ Client::Game::UI::Achievement Achievement;
    /* 0x01AB0 */ Client::Game::UI::Buddy Buddy;
    /*         */ byte _gap_0x2988[0x4];
    /* 0x0298C */ Client::Game::UI::PvPProfile PvPProfile;
    /*         */ byte _gap_0x2A08[0x8];
    /* 0x02A10 */ Client::Game::UI::ContentsNote ContentsNote;
    /* 0x02AB8 */ Client::Game::UI::RelicNote RelicNote;
    /*         */ byte _gap_0x2AD0[0x48];
    /* 0x02B18 */ Client::Game::UI::AreaInstance AreaInstance;
    /*         */ byte _gap_0x2B40[0x4A0];
    /* 0x02FE0 */ Client::Game::UI::Loot Loot;
    /*         */ byte _gap_0x3680[0x600];
    /* 0x03C80 */ Client::Game::UI::RecipeNote RecipeNote;
    /*         */ byte _gap_0x4290[0x6570];
    /* 0x0A800 */ Client::Game::Event::Director* ActiveDirector;
    /*         */ byte _gap_0xA808[0x140];
    /* 0x0A948 */ Client::Game::Fate::FateDirector* FateDirector;
    /*         */ byte _gap_0xA950[0x140];
    /* 0x0AA90 */ Client::Game::UI::Map Map;
    /*         */ byte _gap_0xAA90[0x3FF0];
    /* 0x0EA80 */ Client::Game::UI::MarkingController MarkingController;
    /* 0x0ED60 */ Client::Game::UI::LimitBreakController LimitBreakController;
    /*         */ byte _gap_0xED70[0x2CB8];
    /* 0x11A28 */ Client::Game::UI::RouletteController RouletteController;
    /*         */ byte _gap_0x11A98[0x60];
    /* 0x11AF8 */ Client::Game::UI::ContentsFinder ContentsFinder;
    /*         */ byte _gap_0x11BA8[0x68];
    /* 0x11C10 */ Client::Game::UI::MobHunt MobHunt;
    /*         */ byte _gap_0x11DA8[0x4D48];
    /*         */ byte _gap_0x16AF0[0x4];
    /* 0x16AF4 */ byte UnlockLinkBitmask[0x40];
    /* 0x16B34 */ byte UnlockedAetherytesBitmask[0x19];
    /*         */ byte _gap_0x16B4D;
    /* 0x16B4E */ byte UnlockedHowtoBitmask[0x24];
    /* 0x16B72 */ byte UnlockedCompanionsBitmask[0x3E];
    /* 0x16BB0 */ byte ChocoboTaxiStandsBitmask[0x27];
};

struct Client::Graphics::Animation::AnimationResourceHandle /* Size=0x0 */
{
};

struct Client::Graphics::ByteColor /* Size=0x4 */
{
    /* 0x0 */ byte R;
    /* 0x1 */ byte G;
    /* 0x2 */ byte B;
    /* 0x3 */ byte A;
};

struct Client::Graphics::Environment::EnvState /* Size=0x258 */
{
    /*       */ byte _gap_0x0[0x128];
    /*       */ byte _gap_0x128[0x4];
    /* 0x12C */ float Rain;
    /*       */ byte _gap_0x130[0x128];
};

struct Client::Graphics::Environment::EnvSoundState /* Size=0x68 */
{
    /*      */ byte _gap_0x0[0x68];
};

struct Client::Graphics::Environment::EnvSimulator /* Size=0x310 */
{
    /*       */ byte _gap_0x0[0x310];
};

struct Client::Graphics::ReferencedClassBase /* Size=0x10 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ unsigned __int32 RefCount;
    /*      */ byte _gap_0xC[0x4];
};

struct Client::Graphics::Render::Camera /* Size=0x130 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /*       */ byte _gap_0x10[0x40];
    /* 0x050 */ Common::Math::Matrix4x4 ProjectionMatrix;
    /*       */ byte _gap_0x90[0x10];
    /*       */ byte _gap_0xA0[0x4];
    /* 0x0A4 */ float FoV;
    /* 0x0A8 */ float AspectRatio;
    /* 0x0AC */ float NearPlane;
    /* 0x0B0 */ float FarPlane;
    /*       */ byte _gap_0xB4[0x4];
    /*       */ byte _gap_0xB8[0x78];
};

struct Client::Graphics::Render::ShadowCamera /* Size=0x150 */
{
    /* 0x000 */ Client::Graphics::Render::Camera Camera;
    /*       */ byte _gap_0x130[0x20];
};

struct Client::Graphics::Environment::EnvManager /* Size=0x900 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ Client::Graphics::Scene::EnvScene* EnvScene;
    /* 0x010 */ float DayTimeSeconds;
    /* 0x014 */ float ActiveTransitionTime;
    /* 0x018 */ float CurrentTransitionTime;
    /* 0x01C */ float TransitionProgress;
    /*       */ byte _gap_0x20[0x4];
    /*       */ byte _gap_0x24[0x2];
    /*       */ byte _gap_0x26;
    /* 0x027 */ byte ActiveWeather;
    /* 0x028 */ float TransitionTime;
    /*       */ byte _gap_0x2C[0x4];
    /* 0x030 */ Client::Graphics::Scene::EnvSpace* EnvSpace;
    /*       */ byte _gap_0x38[0x18];
    /* 0x050 */ Client::Graphics::Environment::EnvState EnvState;
    /*       */ byte _gap_0x2A8[0xE0];
    /* 0x388 */ Client::Graphics::Environment::EnvSoundState EnvSoundState;
    /*       */ byte _gap_0x3F0[0x10];
    /* 0x400 */ Client::Graphics::Environment::EnvSimulator EnvSimulator;
    /*       */ byte _gap_0x710[0x40];
    /* 0x750 */ Client::Graphics::Render::ShadowCamera ShadowCamera;
    /*       */ byte _gap_0x8A0[0x50];
    /*       */ byte _gap_0x8F0[0x4];
    /* 0x8F4 */ unsigned __int32 UnkFlags;
    /*       */ byte _gap_0x8F8[0x8];
};

struct Client::Graphics::Kernel::ConstantBuffer /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x20];
    /* 0x20 */ __int32 ByteSize;
    /* 0x24 */ __int32 Flags;
    /* 0x28 */ void* UnsafeSourcePointer;
    /*      */ byte _gap_0x30[0x40];
};

struct Client::Graphics::Kernel::ConstantBufferPointer; /* Size=unknown due to generic type with parameters */
struct Client::Graphics::Kernel::CVector; /* Size=unknown due to generic type with parameters */
struct Client::Graphics::Kernel::Device /* Size=0x258 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ void* ContextArray;
    /* 0x010 */ void* RenderThread;
    /*       */ byte _gap_0x18[0x58];
    /* 0x070 */ Client::Graphics::Kernel::SwapChain* SwapChain;
    /*       */ byte _gap_0x78[0x2];
    /* 0x07A */ byte RequestResolutionChange;
    /*       */ byte _gap_0x7B;
    /*       */ byte _gap_0x7C[0x4];
    /*       */ byte _gap_0x80[0x8];
    /* 0x088 */ unsigned __int32 Width;
    /* 0x08C */ unsigned __int32 Height;
    /* 0x090 */ float AspectRatio;
    /* 0x094 */ float GammaCorrection;
    /* 0x098 */ __int32 ColorFilter;
    /* 0x09C */ float ColorFilterRange;
    /*       */ byte _gap_0xA0[0x120];
    /* 0x1C0 */ unsigned __int32 NewWidth;
    /* 0x1C4 */ unsigned __int32 NewHeight;
    /*       */ byte _gap_0x1C8[0x58];
    /* 0x220 */ __int32 D3DFeatureLevel;
    /*       */ byte _gap_0x224[0x4];
    /* 0x228 */ void* DXGIFactory;
    /* 0x230 */ void* DXGIOutput;
    /* 0x238 */ void* D3D11Forwarder;
    /* 0x240 */ void* D3D11DeviceContext;
    /*       */ byte _gap_0x248[0x8];
    /* 0x250 */ void* ImmediateContext;
};

struct Client::Graphics::Kernel::Notifier /* Size=0x18 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::Graphics::Kernel::Notifier* Next;
    /* 0x10 */ Client::Graphics::Kernel::Notifier* Prev;
};

struct Client::Graphics::Kernel::PixelShader /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::Graphics::Kernel::ShaderNode /* Size=0x38 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::Graphics::Kernel::ShaderPackage* OwnerPackage;
    /* 0x10 */ unsigned __int32 PassNum;
    /* 0x14 */ byte PassIndices[0x10];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ Client::Graphics::Kernel::ShaderNode::ShaderPass* Passes;
    /* 0x30 */ unsigned __int32* ShaderKeys;
};

struct Client::Graphics::Kernel::ShaderNode::ShaderPass /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 VertexShader;
    /* 0x4 */ unsigned __int32 PixelShader;
};

struct Pointer::ClientGraphicsKernelVertexShader /* Size=0x8 */
{
    /* 0x0 */ Client::Graphics::Kernel::VertexShader* Value;
};

struct StdVector::PointerClientGraphicsKernelVertexShader /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGraphicsKernelVertexShader* First;
    /* 0x08 */ Pointer::ClientGraphicsKernelVertexShader* Last;
    /* 0x10 */ Pointer::ClientGraphicsKernelVertexShader* End;
};

struct Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelVertexShader /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVector::PointerClientGraphicsKernelVertexShader Vector;
};

struct Pointer::ClientGraphicsKernelPixelShader /* Size=0x8 */
{
    /* 0x0 */ Client::Graphics::Kernel::PixelShader* Value;
};

struct StdVector::PointerClientGraphicsKernelPixelShader /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGraphicsKernelPixelShader* First;
    /* 0x08 */ Pointer::ClientGraphicsKernelPixelShader* Last;
    /* 0x10 */ Pointer::ClientGraphicsKernelPixelShader* End;
};

struct Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelPixelShader /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVector::PointerClientGraphicsKernelPixelShader Vector;
};

struct Pointer::ClientGraphicsKernelShaderNode /* Size=0x8 */
{
    /* 0x0 */ Client::Graphics::Kernel::ShaderNode* Value;
};

struct StdVector::PointerClientGraphicsKernelShaderNode /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGraphicsKernelShaderNode* First;
    /* 0x08 */ Pointer::ClientGraphicsKernelShaderNode* Last;
    /* 0x10 */ Pointer::ClientGraphicsKernelShaderNode* End;
};

struct Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelShaderNode /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVector::PointerClientGraphicsKernelShaderNode Vector;
};

struct Client::Graphics::Kernel::ShaderPackage /* Size=0x408 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x010 */ Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelVertexShader VertexShaders;
    /* 0x030 */ Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelPixelShader PixelShaders;
    /* 0x050 */ Client::Graphics::Kernel::CVector::PointerClientGraphicsKernelShaderNode ShaderNodes;
    /* 0x070 */ unsigned __int16 MaterialConstantBufferSize;
    /*       */ byte _gap_0x72[0x2];
    /* 0x074 */ unsigned __int16 MaterialElementCount;
    /*       */ byte _gap_0x76[0x2];
    /* 0x078 */ unsigned __int16 ConstantCount;
    /*       */ byte _gap_0x7A[0x2];
    /* 0x07C */ unsigned __int16 SamplerCount;
    /*       */ byte _gap_0x7E[0x2];
    /* 0x080 */ unsigned __int16 UnkCount;
    /*       */ byte _gap_0x82[0x2];
    /* 0x084 */ unsigned __int16 SystemKeyCount;
    /*       */ byte _gap_0x86[0x2];
    /* 0x088 */ unsigned __int16 SceneKeyCount;
    /*       */ byte _gap_0x8A[0x2];
    /* 0x08C */ unsigned __int16 MaterialKeyCount;
    /*       */ byte _gap_0x8E[0x2];
    /* 0x090 */ Client::Graphics::Kernel::ShaderPackage::MaterialElement* MaterialElements;
    /* 0x098 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Constants;
    /* 0x0A0 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Samplers;
    /* 0x0A8 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Unknowns;
    /* 0x0B0 */ unsigned __int32* SystemKeys;
    /* 0x0B8 */ unsigned __int32* SceneKeys;
    /* 0x0C0 */ unsigned __int32* MaterialKeys;
    /* 0x0C8 */ unsigned __int32* SystemValues;
    /* 0x0D0 */ unsigned __int32* SceneValues;
    /* 0x0D8 */ unsigned __int32* MaterialValues;
    /* 0x0E0 */ unsigned __int32 SubviewValue1;
    /* 0x0E4 */ unsigned __int32 SubviewValue2;
    /* 0x0E8 */ void* ShaderNodeTreeVtbl;
    /*       */ byte _gap_0xF0[0x318];
};

struct Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown /* Size=0xC */
{
    /* 0x0 */ unsigned __int32 CRC;
    /* 0x4 */ unsigned __int32 Id;
    /*     */ byte _gap_0x8[0x2];
    /* 0xA */ unsigned __int16 Slot;
};

struct Client::Graphics::Kernel::ShaderPackage::MaterialElement /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 CRC;
    /* 0x4 */ unsigned __int16 Offset;
    /* 0x6 */ unsigned __int16 Size;
};

struct Client::Graphics::Kernel::SwapChain /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x38];
    /* 0x38 */ unsigned __int32 Width;
    /* 0x3C */ unsigned __int32 Height;
    /*      */ byte _gap_0x40[0x18];
    /* 0x58 */ Client::Graphics::Kernel::Texture* BackBuffer;
    /* 0x60 */ Client::Graphics::Kernel::Texture* DepthStencil;
    /* 0x68 */ void* DXGISwapChain;
};

struct Client::Graphics::Kernel::Texture /* Size=0xC0 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ Client::Graphics::Kernel::Texture::TextureVTable* VTable;
    } _union_0x0;
    /*      */ byte _gap_0x8[0x18];
    /* 0x20 */ Client::Graphics::Kernel::Notifier Notifier;
    /* 0x38 */ unsigned __int32 Width;
    /* 0x3C */ unsigned __int32 Height;
    /* 0x40 */ unsigned __int32 Width2;
    /* 0x44 */ unsigned __int32 Height2;
    /* 0x48 */ unsigned __int32 Width3;
    /* 0x4C */ unsigned __int32 Height3;
    /* 0x50 */ unsigned __int32 Depth;
    /* 0x54 */ byte MipLevel;
    /* 0x55 */ byte Unk_55;
    /* 0x56 */ byte Unk_56;
    /* 0x57 */ byte Unk_57;
    /* 0x58 */ Client::Graphics::Kernel::TextureFormat TextureFormat;
    /* 0x5C */ unsigned __int32 Flags;
    /* 0x60 */ byte ArraySize;
    /*      */ byte _gap_0x61;
    /*      */ byte _gap_0x62[0x2];
    /*      */ byte _gap_0x64[0x4];
    /* 0x68 */ void* D3D11Texture2D;
    /* 0x70 */ void* D3D11ShaderResourceView;
    /*      */ byte _gap_0x78[0x48];
};

struct Client::Graphics::Kernel::Texture::TextureVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /* 0x10 */ __int64 IncRef;
    /* 0x18 */ __int64 DecRef;
};

struct Client::Graphics::Kernel::VertexShader /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Pointer::ClientGraphicsPhysicsBoneSimulator /* Size=0x8 */
{
    /* 0x0 */ Client::Graphics::Physics::BoneSimulator* Value;
};

struct StdVector::PointerClientGraphicsPhysicsBoneSimulator /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientGraphicsPhysicsBoneSimulator* First;
    /* 0x08 */ Pointer::ClientGraphicsPhysicsBoneSimulator* Last;
    /* 0x10 */ Pointer::ClientGraphicsPhysicsBoneSimulator* End;
};

struct Client::Graphics::Physics::BoneSimulators /* Size=0x78 */
{
    /* 0x00 */ StdVector::PointerClientGraphicsPhysicsBoneSimulator BoneSimulator_1;
    /* 0x18 */ StdVector::PointerClientGraphicsPhysicsBoneSimulator BoneSimulator_2;
    /* 0x30 */ StdVector::PointerClientGraphicsPhysicsBoneSimulator BoneSimulator_3;
    /* 0x48 */ StdVector::PointerClientGraphicsPhysicsBoneSimulator BoneSimulator_4;
    /* 0x60 */ StdVector::PointerClientGraphicsPhysicsBoneSimulator BoneSimulator_5;
};

struct Client::Graphics::Physics::BonePhysicsModule /* Size=0x1C0 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Common::Math::Matrix4x4 SkeletonWorldMatrix;
    /* 0x050 */ Common::Math::Matrix4x4 SkeletonInvWorldMatrix;
    /* 0x090 */ float WindScale;
    /* 0x094 */ float WindVariation;
    /* 0x098 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x0A0 */ Client::Graphics::Physics::BoneSimulators BoneSimulators;
    /*       */ byte _gap_0x118[0xA8];
};

struct Client::Graphics::Physics::BoneSimulator /* Size=0x100 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ unsigned __int32 PhysicsGroup;
    /*       */ byte _gap_0x14[0x4];
    /* 0x018 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x020 */ Common::Math::Vector3 CharacterPosition;
    /* 0x030 */ Common::Math::Vector3 Gravity;
    /* 0x040 */ Common::Math::Vector3 Wind;
    /*       */ byte _gap_0x50[0xB0];
};

struct Client::Graphics::Ray /* Size=0x20 */
{
    /* 0x00 */ Common::Math::Vector3 Origin;
    /* 0x10 */ Common::Math::Vector3 Direction;
};

struct Client::Graphics::Render::Manager /* Size=0x2D730 */
{
    /* 0x00000 */ void* Vtbl;
    /* 0x00008 */ byte ViewArray[0xB400];
    /*         */ byte _gap_0xB408[0x22328];
};

struct Client::Graphics::Render::Material /* Size=0x40 */
{
    /* 0x00 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x10 */ Client::System::Resource::Handle::MaterialResourceHandle* MaterialResourceHandle;
    /* 0x18 */ unsigned __int32 ShaderFlags;
    /*      */ byte _gap_0x1C[0x4];
    /* 0x20 */ unsigned __int32* ShaderKeyValues;
    /* 0x28 */ Client::Graphics::Kernel::ConstantBuffer* MaterialParameterCBuffer;
    /* 0x30 */ Client::Graphics::Render::Material::TextureEntry* Textures;
    /* 0x38 */ unsigned __int16 TextureCount;
    /*      */ byte _gap_0x3A[0x2];
    /*      */ byte _gap_0x3C[0x4];
};

struct Client::Graphics::Render::Material::TextureEntry /* Size=0x18 */
{
    /* 0x00 */ unsigned __int32 Id;
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ Client::System::Resource::Handle::TextureResourceHandle* Texture;
    /* 0x10 */ unsigned __int32 SamplerFlags;
    /*      */ byte _gap_0x14[0x4];
};

struct Client::Graphics::Render::Model /* Size=0xF0 */
{
    /* 0x00 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /*      */ byte _gap_0x10[0x8];
    /* 0x18 */ Client::Graphics::Render::Model* Previous;
    /* 0x20 */ Client::Graphics::Render::Model* Next;
    /*      */ byte _gap_0x28[0x8];
    /* 0x30 */ Client::System::Resource::Handle::ModelResourceHandle* ModelResourceHandle;
    /*      */ byte _gap_0x38[0x8];
    /* 0x40 */ Client::Graphics::Render::Skeleton* Skeleton;
    /*      */ byte _gap_0x48[0x10];
    /* 0x58 */ void** BoneList;
    /* 0x60 */ __int32 BoneCount;
    /*      */ byte _gap_0x64[0x4];
    /*      */ byte _gap_0x68[0x30];
    /* 0x98 */ Client::Graphics::Render::Material** Materials;
    /* 0xA0 */ __int32 MaterialCount;
    /*      */ byte _gap_0xA4[0x4];
    /*      */ byte _gap_0xA8[0x40];
    /* 0xE8 */ unsigned __int32 SlotIndex;
    /*      */ byte _gap_0xEC[0x4];
};

struct Client::Graphics::Render::OffscreenRenderingManager /* Size=0x190 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ void* JobSystem_vtbl;
    /*       */ byte _gap_0x10[0xB8];
    /* 0x0C8 */ void* Camera_1;
    /* 0x0D0 */ void* Camera_2;
    /* 0x0D8 */ void* Camera_3;
    /* 0x0E0 */ void* Camera_4;
    /*       */ byte _gap_0xE8[0xA8];
};

struct Client::Graphics::Render::PartialSkeleton /* Size=0x1C0 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x18];
    /* 0x020 */ byte Jobs[0x100];
    /* 0x120 */ __int16 ConnectedParentBoneIndex;
    /* 0x122 */ __int16 ConnectedBoneIndex;
    /*       */ byte _gap_0x124[0x4];
    /*       */ byte _gap_0x128[0x8];
    /* 0x130 */ unsigned __int64 HavokAnimatedSkeleton[0x2];
    /* 0x140 */ unsigned __int64 HavokPoses[0x4];
    /* 0x160 */ Client::Graphics::Render::Skeleton* Skeleton;
    /*       */ byte _gap_0x168[0x18];
    /* 0x180 */ void* SkeletonParameterResourceHandle;
    /* 0x188 */ Client::System::Resource::Handle::SkeletonResourceHandle* SkeletonResourceHandle;
    /*       */ byte _gap_0x190[0x30];
};

struct Client::Graphics::Render::RenderTargetManager /* Size=0x4A0 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ Client::Graphics::Kernel::Notifier Notifier;
    /* 0x020 */ byte RenderTargetArray[0x208];
    /*       */ byte _gap_0x228[0x20];
    /* 0x248 */ unsigned __int32 Resolution_Width;
    /* 0x24C */ unsigned __int32 Resolution_Height;
    /* 0x250 */ unsigned __int32 ShadowMap_Width;
    /* 0x254 */ unsigned __int32 ShadowMap_Height;
    /* 0x258 */ unsigned __int32 NearShadowMap_Width;
    /* 0x25C */ unsigned __int32 NearShadowMap_Height;
    /* 0x260 */ unsigned __int32 FarShadowMap_Width;
    /* 0x264 */ unsigned __int32 FarShadowMap_Height;
    /* 0x268 */ bool UnkBool_1;
    /*       */ byte _gap_0x269;
    /*       */ byte _gap_0x26A[0x2];
    /*       */ byte _gap_0x26C[0x4];
    /* 0x270 */ byte RenderTargetArray2[0x188];
    /*       */ byte _gap_0x3F8[0xA8];
};

struct Client::Graphics::Transform /* Size=0x30 */
{
    /* 0x00 */ Common::Math::Vector3 Position;
    /* 0x10 */ Common::Math::Quaternion Rotation;
    /* 0x20 */ Common::Math::Vector3 Scale;
};

struct Client::Graphics::Render::Skeleton /* Size=0x100 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x010 */ Client::Graphics::Render::Skeleton* LinkedListPrevious;
    /* 0x018 */ Client::Graphics::Render::Skeleton* LinkedListNext;
    /* 0x020 */ Client::Graphics::Transform Transform;
    /* 0x050 */ unsigned __int16 PartialSkeletonCount;
    /*       */ byte _gap_0x52[0x2];
    /*       */ byte _gap_0x54[0x4];
    /* 0x058 */ Client::System::Resource::Handle::SkeletonResourceHandle** SkeletonResourceHandles;
    /* 0x060 */ Client::Graphics::Animation::AnimationResourceHandle** AnimationResourceHandles;
    /* 0x068 */ Client::Graphics::Render::PartialSkeleton* PartialSkeletons;
    /*       */ byte _gap_0x70[0x48];
    /* 0x0B8 */ Client::Graphics::Scene::CharacterBase* Owner;
    /*       */ byte _gap_0xC0[0x40];
};

struct Common::Math::Rectangle /* Size=0x10 */
{
    /* 0x00 */ float Left;
    /* 0x04 */ float Top;
    /* 0x08 */ float Right;
    /* 0x0C */ float Bottom;
};

struct Client::Graphics::Render::SubView /* Size=0x58 */
{
    /* 0x00 */ void* Vtbl;
    /* 0x08 */ unsigned __int32 Flags;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ Common::Math::Rectangle ViewportRegion;
    /* 0x20 */ void* Camera;
    /* 0x28 */ Client::Graphics::Kernel::Texture* RenderTarget_1;
    /* 0x30 */ Client::Graphics::Kernel::Texture* RenderTarget_2;
    /* 0x38 */ Client::Graphics::Kernel::Texture* RenderTarget_3;
    /* 0x40 */ Client::Graphics::Kernel::Texture* RenderTarget_4;
    /* 0x48 */ unsigned __int32 RenderTargetUsedCount;
    /*      */ byte _gap_0x4C[0x4];
    /* 0x50 */ Client::Graphics::Kernel::Texture* DepthStencil;
};

struct Client::Graphics::Render::View /* Size=0x5A0 */
{
    /* 0x000 */ void* Vtbl;
    /* 0x008 */ unsigned __int32 Flags;
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ Common::Math::Rectangle CanvasRegion;
    /* 0x020 */ byte SubViewArray[0x580];
};

struct Client::Graphics::Scene::CameraManager /* Size=0x120 */
{
    /*       */ byte _gap_0x0[0x50];
    /* 0x050 */ __int32 CameraIndex;
    /*       */ byte _gap_0x54[0x4];
    /* 0x058 */ byte CameraArray[0x70];
    /*       */ byte _gap_0xC8[0x58];
};

struct Client::Graphics::Scene::CharacterBase /* Size=0x8F0 */
{
    /*       */ byte _gap_0x0[0x90];
    /* 0x090 */ byte UnkFlags_01;
    /* 0x091 */ byte UnkFlags_02;
    /* 0x092 */ byte UnkFlags_03;
    /*       */ byte _gap_0x93;
    /*       */ byte _gap_0x94[0x4];
    /* 0x098 */ __int32 SlotCount;
    /*       */ byte _gap_0x9C[0x4];
    /* 0x0A0 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x0A8 */ Client::Graphics::Render::Model** Models;
    /*       */ byte _gap_0xB0[0x98];
    /* 0x148 */ void* PostBoneDeformer;
    /* 0x150 */ Client::Graphics::Physics::BonePhysicsModule* BonePhysicsModule;
    /*       */ byte _gap_0x158[0xC8];
    /*       */ byte _gap_0x220[0x4];
    /* 0x224 */ float VfxScale;
    /*       */ byte _gap_0x228[0x18];
    /* 0x240 */ Client::Graphics::Kernel::ConstantBuffer* CharacterDataCBuffer;
    /*       */ byte _gap_0x248[0x10];
    /* 0x258 */ Client::Graphics::Kernel::Texture** ColorTableTextures;
    /*       */ byte _gap_0x260[0x50];
    /* 0x2B0 */ float WeatherWetness;
    /* 0x2B4 */ float SwimmingWetness;
    /* 0x2B8 */ float WetnessDepth;
    /* 0x2BC */ float ForcedWetness;
    /*       */ byte _gap_0x2C0[0x8];
    /* 0x2C8 */ unsigned __int32 HasModelInSlotLoaded;
    /* 0x2CC */ unsigned __int32 HasModelFilesInSlotLoaded;
    /* 0x2D0 */ void* TempData;
    /* 0x2D8 */ void* TempSlotData;
    /*       */ byte _gap_0x2E0[0x8];
    /* 0x2E8 */ Client::Graphics::Render::Material** Materials;
    /* 0x2F0 */ void* EID;
    /* 0x2F8 */ void** IMCArray;
    /*       */ byte _gap_0x300[0x5F0];
};

struct Client::Graphics::Scene::CharacterBase::CharacterBaseVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x190];
    /* 0x190 */ __int64 GetModelType;
    /*     */ byte _gap_0x198[0x80];
    /* 0x218 */ __int64 FlagSlotForUpdate;
};

struct Client::Graphics::Scene::CharacterUtility /* Size=0x0 */
{
    /* 0x0 */ void* VTable;
    /* 0x8 */ byte ResourceHandles[0x2B8];
    /*     */ byte _gap_0x2C0[0x38];
    /* 0x2F8 */ Client::Graphics::Kernel::ConstantBuffer* LegacyBodyDecalColorCBuffer;
    /* 0x300 */ Client::Graphics::Kernel::ConstantBuffer* FreeCompanyCrestColorCBuffer;
};

struct Client::Graphics::Scene::Demihuman /* Size=0x978 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /*       */ byte _gap_0x8F0[0x88];
};

struct Client::Graphics::Scene::DrawObject /* Size=0x90 */
{
    /* 0x00 */ Client::Graphics::Scene::Object Object;
    /*      */ byte _gap_0x80[0x8];
    /* 0x88 */ byte Flags;
    /*      */ byte _gap_0x89;
    /*      */ byte _gap_0x8A[0x2];
    /*      */ byte _gap_0x8C[0x4];
};

struct Client::Graphics::Scene::EnvLocation /* Size=0xC0 */
{
    /* 0x00 */ Client::Graphics::Scene::DrawObject DrawObject;
    /*      */ byte _gap_0x90[0x30];
};

struct Client::Graphics::Scene::EnvScene /* Size=0x790 */
{
    /*       */ byte _gap_0x0[0xB0];
    /* 0x0B0 */ byte EnvSpaces[0x680];
    /*       */ byte _gap_0x730[0x60];
};

struct Client::Graphics::Scene::EnvSpace /* Size=0xD0 */
{
    /* 0x00 */ Client::Graphics::Scene::DrawObject DrawObject;
    /*      */ byte _gap_0x90[0x20];
    /* 0xB0 */ Client::Graphics::Scene::EnvLocation* EnvLocation;
    /*      */ byte _gap_0xB8[0x18];
};

struct Client::Graphics::Scene::Human /* Size=0xA80 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /* 0x8F0 */ Client::Game::Character::CustomizeData Customize;
    /*       */ byte _gap_0x90A[0x2];
    /* 0x90C */ unsigned __int32 SlotNeedsUpdateBitfield;
    /* 0x910 */ Client::Game::Character::EquipmentModelId Head;
    /* 0x914 */ Client::Game::Character::EquipmentModelId Top;
    /* 0x918 */ Client::Game::Character::EquipmentModelId Arms;
    /* 0x91C */ Client::Game::Character::EquipmentModelId Legs;
    /* 0x920 */ Client::Game::Character::EquipmentModelId Feet;
    /* 0x924 */ Client::Game::Character::EquipmentModelId Ear;
    /* 0x928 */ Client::Game::Character::EquipmentModelId Neck;
    /* 0x92C */ Client::Game::Character::EquipmentModelId Wrist;
    /* 0x930 */ Client::Game::Character::EquipmentModelId RFinger;
    /* 0x934 */ Client::Game::Character::EquipmentModelId LFinger;
    /* 0x938 */ unsigned __int16 RaceSexId;
    /* 0x93A */ unsigned __int16 HairId;
    /* 0x93C */ unsigned __int16 FaceId;
    /* 0x93E */ unsigned __int16 TailEarId;
    /* 0x940 */ unsigned __int16 FurId;
    /*       */ byte _gap_0x942[0x2];
    /*       */ byte _gap_0x944[0x4];
    /*       */ byte _gap_0x948[0x38];
    /* 0x980 */ Client::Graphics::Kernel::Texture* HeadDecal;
    /* 0x988 */ Client::Graphics::Kernel::Texture* TopDecal;
    /* 0x990 */ Client::Graphics::Kernel::Texture* ArmsDecal;
    /* 0x998 */ Client::Graphics::Kernel::Texture* LegsDecal;
    /* 0x9A0 */ Client::Graphics::Kernel::Texture* FeetDecal;
    /* 0x9A8 */ Client::Graphics::Kernel::Texture* EarDecal;
    /* 0x9B0 */ Client::Graphics::Kernel::Texture* NeckDecal;
    /* 0x9B8 */ Client::Graphics::Kernel::Texture* WristDecal;
    /* 0x9C0 */ Client::Graphics::Kernel::Texture* RFingerDecal;
    /* 0x9C8 */ Client::Graphics::Kernel::Texture* LFingerDecal;
    /*       */ byte _gap_0x9D0[0x8];
    /* 0x9D8 */ Client::Graphics::Kernel::ConstantBuffer* CustomizeParameterCBuffer;
    /* 0x9E0 */ Client::Graphics::Kernel::ConstantBuffer* DecalColorCBuffer;
    /* 0x9E8 */ Client::System::Resource::Handle::TextureResourceHandle* Decal;
    /* 0x9F0 */ Client::System::Resource::Handle::TextureResourceHandle* LegacyBodyDecal;
    /* 0x9F8 */ Client::Graphics::Kernel::Texture* FreeCompanyCrest;
    /* 0xA00 */ unsigned __int32 SlotFreeCompanyCrestBitfield;
    /*       */ byte _gap_0xA04[0x4];
    /*       */ byte _gap_0xA08[0x30];
    /* 0xA38 */ byte* ChangedEquipData;
    /*       */ byte _gap_0xA40[0x40];
};

struct Client::Graphics::Scene::Monster /* Size=0x900 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /*       */ byte _gap_0x8F0[0x10];
};

struct Client::Graphics::Scene::Object::ObjectVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /* 0x10 */ __int64 GetObjectType;
};

struct Client::Graphics::Scene::Object::SiblingEnumerator /* Size=0x0 */
{
};

struct Client::Graphics::Scene::ResidentResourceManager /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /*     */ byte _gap_0x10[0x4];
    /* 0x14 */ unsigned __int32 ResourceCount;
    /* 0x18 */ Client::System::Resource::Handle::ResourceHandle** ResourceList;
};

struct Client::Graphics::Scene::Weapon /* Size=0x920 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /* 0x8F0 */ unsigned __int16 ModelSetId;
    /* 0x8F2 */ unsigned __int16 SecondaryId;
    /* 0x8F4 */ unsigned __int16 Variant;
    /* 0x8F6 */ unsigned __int16 ModelUnknown;
    /*       */ byte _gap_0x8F8[0x2];
    /* 0x8FA */ byte MaterialId;
    /* 0x8FB */ byte DecalId;
    /*       */ byte _gap_0x8FC[0x2];
    /* 0x8FE */ byte VfxId;
    /*       */ byte _gap_0x8FF;
    /*       */ byte _gap_0x900[0x20];
};

struct Client::Graphics::Scene::World /* Size=0x160 */
{
    /* 0x000 */ Client::Graphics::Scene::Object Object;
    /*       */ byte _gap_0x80[0xE0];
};

struct Client::Graphics::Vfx::VfxData /* Size=0x1D0 */
{
    /*       */ byte _gap_0x0[0x1D0];
};

struct Client::LayoutEngine::IndoorFloorLayoutData /* Size=0x0 */
{
    /* 0x0 */ __int32 Part0;
    /* 0x4 */ __int32 Part1;
    /* 0x8 */ __int32 Part2;
    /* 0xC */ __int32 Part3;
    /* 0x10 */ __int32 Part4;
};

struct Client::LayoutEngine::IndoorAreaLayoutData /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x28];
    /* 0x28 */ Client::LayoutEngine::IndoorFloorLayoutData Floor0;
    /*     */ byte _gap_0x28[0x10];
    /*     */ byte _gap_0x38[0x4];
    /* 0x3C */ Client::LayoutEngine::IndoorFloorLayoutData Floor1;
    /*     */ byte _gap_0x3C[0x4];
    /*     */ byte _gap_0x40[0x10];
    /* 0x50 */ Client::LayoutEngine::IndoorFloorLayoutData Floor2;
    /*     */ byte _gap_0x50[0x30];
    /* 0x80 */ float LightLevel;
};

struct Client::LayoutEngine::LayoutManager /* Size=0x98 */
{
    /*      */ byte _gap_0x0[0x20];
    /* 0x20 */ unsigned __int32 TerritoryTypeId;
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x10];
    /* 0x38 */ unsigned __int32 FestivalStatus;
    /*      */ byte _gap_0x3C[0x4];
    /* 0x40 */ unsigned __int32 ActiveFestivals[0x4];
    /*      */ byte _gap_0x50[0x30];
    /* 0x80 */ void* HousingController;
    /*      */ byte _gap_0x88[0x8];
    /* 0x90 */ Client::LayoutEngine::IndoorAreaLayoutData* IndoorAreaData;
};

struct Pointer::SystemByte /* Size=0x8 */
{
    /* 0x0 */ byte* Value;
};

struct StdPair::ClientSystemStringUtf8String::PointerSystemByte /* Size=0x70 */
{
    /* 0x00 */ Client::System::String::Utf8String Item1;
    /* 0x68 */ Pointer::SystemByte Item2;
};

struct StdMap::Node::ClientSystemStringUtf8String::PointerSystemByte /* Size=0x98 */
{
    /* 0x00 */ StdMap::Node::ClientSystemStringUtf8String::PointerSystemByte* Left;
    /* 0x08 */ StdMap::Node::ClientSystemStringUtf8String::PointerSystemByte* Parent;
    /* 0x10 */ StdMap::Node::ClientSystemStringUtf8String::PointerSystemByte* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ StdPair::ClientSystemStringUtf8String::PointerSystemByte KeyValuePair;
};

struct StdMap::ClientSystemStringUtf8String::PointerSystemByte /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::ClientSystemStringUtf8String::PointerSystemByte* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::LayoutEngine::LayoutWorld /* Size=0x228 */
{
    /*       */ byte _gap_0x0[0x20];
    /* 0x020 */ Client::LayoutEngine::LayoutManager* ActiveLayout;
    /*       */ byte _gap_0x28[0x1F0];
    /* 0x218 */ StdMap::ClientSystemStringUtf8String::PointerSystemByte* RsvMap;
    /*       */ byte _gap_0x220[0x8];
};

struct Common::Configuration::ConfigBase /* Size=0x110 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ Common::Configuration::ChangeEventInterface* Listener;
    /*       */ byte _gap_0x10[0x4];
    /* 0x014 */ unsigned __int32 ConfigCount;
    /* 0x018 */ Common::Configuration::ConfigEntry* ConfigEntry;
    /*       */ byte _gap_0x20[0x30];
    /* 0x050 */ Client::System::String::Utf8String UnkString;
    /*       */ byte _gap_0xB8[0x58];
};

struct Common::Configuration::DevConfig /* Size=0x110 */
{
    /* 0x000 */ Common::Configuration::ConfigBase ConfigBase;
};

struct Client::System::Configuration::DevConfig /* Size=0x110 */
{
    /* 0x000 */ Common::Configuration::DevConfig CommonDevConfig;
};

struct Common::Configuration::SystemConfig /* Size=0x450 */
{
    /* 0x000 */ Common::Configuration::ConfigBase ConfigBase;
    /*       */ byte _gap_0x110[0x8];
    /* 0x118 */ Common::Configuration::ConfigBase UiConfig;
    /* 0x228 */ Common::Configuration::ConfigBase UiControlConfig;
    /* 0x338 */ Common::Configuration::ConfigBase UiControlGamepadConfig;
    /*       */ byte _gap_0x448[0x8];
};

struct Client::System::Configuration::SystemConfig /* Size=0x450 */
{
    /* 0x000 */ Common::Configuration::SystemConfig CommonSystemConfig;
};

struct Client::System::File::FileDescriptor /* Size=0x278 */
{
    /* 0x000 */ Client::System::File::FileMode FileMode;
    /*       */ byte _gap_0x4[0x4];
    /* 0x008 */ byte* FileBuffer;
    /* 0x010 */ unsigned __int64 FileLength;
    /* 0x018 */ unsigned __int64 CurrentFileOffset;
    /*       */ byte _gap_0x20[0x10];
    /* 0x030 */ void* FileInterface;
    /*       */ byte _gap_0x38[0x28];
    /* 0x060 */ Client::System::File::FileDescriptor* Previous;
    /* 0x068 */ Client::System::File::FileDescriptor* Next;
    /* 0x070 */ byte Utf16FilePath[0x208];
};

struct Client::System::Framework::TaskManagerOsData /* Size=0x4C */
{
    /*      */ byte _gap_0x0[0x40];
    /* 0x40 */ __int64 Handle;
    /*      */ byte _gap_0x48[0x4];
};

struct Client::System::Framework::TaskManager /* Size=0x70 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::System::Framework::TaskManagerOsData OsData;
    /*      */ byte _gap_0x54[0x4];
    /* 0x58 */ Client::System::Framework::RootTask* TaskList;
    /* 0x60 */ unsigned __int32 TaskCount;
    /*      */ byte _gap_0x64[0x4];
    /* 0x68 */ void* UserData;
};

struct Client::System::Framework::GameVersion /* Size=0x900 */
{
    /*       */ byte _gap_0x0[0x900];
};

struct Client::System::Framework::Framework /* Size=0x35C8 */
{
    /*        */ byte _gap_0x0[0x10];
    /* 0x0010 */ Client::System::Configuration::SystemConfig SystemConfig;
    /* 0x0460 */ Client::System::Configuration::DevConfig DevConfig;
    /* 0x0570 */ Client::Game::SavedAppearanceManager* SavedAppearanceData;
    /*        */ byte _gap_0x578[0x1100];
    /* 0x1678 */ bool IsNetworkModuleInitialized;
    /* 0x1679 */ bool EnableNetworking;
    /*        */ byte _gap_0x167A[0x2];
    /*        */ byte _gap_0x167C[0x4];
    /* 0x1680 */ __int64 ServerTime;
    /*        */ byte _gap_0x1688[0x30];
    /* 0x16B8 */ float FrameDeltaTime;
    /*        */ byte _gap_0x16BC[0x4];
    /*        */ byte _gap_0x16C0[0x8];
    /* 0x16C8 */ unsigned __int32 FrameCounter;
    /*        */ byte _gap_0x16CC[0x4];
    /*        */ byte _gap_0x16D0[0x28];
    /* 0x16F8 */ Client::System::Framework::TaskManager TaskManager;
    /*        */ byte _gap_0x1768[0x8];
    /* 0x1770 */ __int64 EorzeaTime;
    /*        */ byte _gap_0x1778[0x20];
    /* 0x1798 */ __int64 EorzeaTimeOverride;
    /* 0x17A0 */ bool IsEorzeaTimeOverridden;
    /*        */ byte _gap_0x17A1;
    /*        */ byte _gap_0x17A2[0x2];
    /*        */ byte _gap_0x17A4[0x4];
    /*        */ byte _gap_0x17A8[0x18];
    /*        */ byte _gap_0x17C0[0x4];
    /* 0x17C4 */ float FrameRate;
    /*        */ byte _gap_0x17C8[0x8];
    /* 0x17D0 */ bool WindowInactive;
    /*        */ byte _gap_0x17D1;
    /*        */ byte _gap_0x17D2[0x2];
    /*        */ byte _gap_0x17D4[0x4];
    /*        */ byte _gap_0x17D8[0x1358];
    /* 0x2B30 */ Component::Excel::ExcelModuleInterface* ExcelModuleInterface;
    /* 0x2B38 */ Component::Exd::ExdModule* ExdModule;
    /*        */ byte _gap_0x2B40[0x10];
    /* 0x2B50 */ Common::Component::BGCollision::BGCollisionModule* BGCollisionModule;
    /*        */ byte _gap_0x2B58[0x8];
    /* 0x2B60 */ Client::UI::UIModule* UIModule;
    /*        */ byte _gap_0x2B68[0x60];
    /* 0x2BC8 */ Common::Lua::LuaState LuaState;
    /* 0x2BF0 */ Client::System::Framework::GameVersion GameVersion;
    /*        */ byte _gap_0x34F0[0xD8];
};

struct Client::System::Framework::Task /* Size=0x38 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ Client::System::Framework::Task::TaskVTable* VTable;
    } _union_0x0;
    /* 0x08 */ void* Runner;
    /* 0x10 */ Client::System::Framework::Framework* Framework;
    /* 0x18 */ void* Func;
    /*      */ byte _gap_0x20[0x8];
    /* 0x28 */ Client::System::Framework::Task* Previous;
    /* 0x30 */ Client::System::Framework::Task* Next;
};

struct Client::System::Framework::RootTask /* Size=0x78 */
{
    /* 0x00 */ Client::System::Framework::Task Task;
    /* 0x38 */ Client::System::Framework::Task UnkTask;
    /*      */ byte _gap_0x70[0x8];
};

struct Client::System::Framework::Task::TaskVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ __int64 Execute;
};

struct Client::System::Memory::IMemorySpace /* Size=0x0 */
{
    /* 0x0 */ Client::System::Memory::IMemorySpace::IMemorySpaceVTable* VTable;
};

struct Client::System::Memory::IMemorySpace::IMemorySpaceVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x18];
    /* 0x18 */ __int64 Malloc;
};

struct StdString /* Size=0x20 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ unsigned __int64 Length;
    /* 0x18 */ unsigned __int64 Capacity;
};

struct Client::System::Resource::Handle::ResourceHandle /* Size=0xB0 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ void** vfunc;
    /* 0x00 */ Client::System::Resource::Handle::ResourceHandle::ResourceHandleVTable* VTable;
    } _union_0x0;
    /* 0x08 */ Client::System::Resource::ResourceCategory Category;
    /* 0x0A */ byte Unknown0A;
    /* 0x0B */ byte Expansion;
    /* 0x0C */ unsigned __int32 FileType;
    /* 0x10 */ unsigned __int32 Id;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x10];
    /* 0x28 */ unsigned __int32 FileSize;
    /* 0x2C */ unsigned __int32 FileSize2;
    /*      */ byte _gap_0x30[0x4];
    /* 0x34 */ unsigned __int32 FileSize3;
    /*      */ byte _gap_0x38[0x10];
    /* 0x48 */ StdString FileName;
    /*      */ byte _gap_0x68[0x4];
    /* 0x6C */ byte UserData;
    /*      */ byte _gap_0x6D;
    /*      */ byte _gap_0x6E[0x2];
    /*      */ byte _gap_0x70[0x38];
    /*      */ byte _gap_0xA8;
    /* 0xA9 */ byte LoadState;
    /*      */ byte _gap_0xAA[0x2];
    /* 0xAC */ unsigned __int32 RefCount;
};

struct Client::System::Resource::Handle::MaterialResourceHandle /* Size=0x108 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x10];
    /* 0x0C0 */ Client::Graphics::Render::Material* Material;
    /* 0x0C8 */ Client::System::Resource::Handle::ShaderPackageResourceHandle* ShaderPackageResourceHandle;
    /* 0x0D0 */ Client::System::Resource::Handle::MaterialResourceHandle::TextureEntry* Textures;
    /*       */ byte _gap_0xD8[0x8];
    /* 0x0E0 */ byte* Strings;
    /*       */ byte _gap_0xE8[0x10];
    /* 0x0F8 */ unsigned __int16 ShpkNameOffset;
    /* 0x0FA */ byte TextureCount;
    /*       */ byte _gap_0xFB;
    /*       */ byte _gap_0xFC[0x4];
    /*       */ byte _gap_0x100[0x8];
};

struct Client::System::Resource::Handle::MaterialResourceHandle::TextureEntry /* Size=0x10 */
{
    /* 0x00 */ Client::System::Resource::Handle::TextureResourceHandle* TextureResourceHandle;
    /* 0x08 */ unsigned __int16 PathOffset;
    /* 0x0A */ unsigned __int16 Flags;
    /*      */ byte _gap_0xC[0x4];
};

struct StdPair::PointerSystemByte::SystemInt16 /* Size=0x10 */
{
    /* 0x00 */ Pointer::SystemByte Item1;
    /* 0x08 */ __int16 Item2;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

struct StdMap::Node::PointerSystemByte::SystemInt16 /* Size=0x38 */
{
    /* 0x00 */ StdMap::Node::PointerSystemByte::SystemInt16* Left;
    /* 0x08 */ StdMap::Node::PointerSystemByte::SystemInt16* Parent;
    /* 0x10 */ StdMap::Node::PointerSystemByte::SystemInt16* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ StdPair::PointerSystemByte::SystemInt16 KeyValuePair;
};

struct StdMap::PointerSystemByte::SystemInt16 /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::PointerSystemByte::SystemInt16* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::System::Resource::Handle::ModelResourceHandle /* Size=0x260 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x158];
    /* 0x208 */ StdMap::PointerSystemByte::SystemInt16 Attributes;
    /*       */ byte _gap_0x218[0x10];
    /* 0x228 */ StdMap::PointerSystemByte::SystemInt16 Shapes;
    /*       */ byte _gap_0x238[0x28];
};

struct Client::System::Resource::Handle::ResourceHandle::ResourceHandleVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x30];
    /* 0x30 */ __int64 GetUserData;
    /*     */ byte _gap_0x38[0x50];
    /* 0x88 */ __int64 GetLength;
    /*     */ byte _gap_0x90[0x28];
    /* 0xB8 */ __int64 GetData;
    /*     */ byte _gap_0xC0[0x38];
    /* 0xF8 */ __int64 LoadIntoKernel;
    /*     */ byte _gap_0x100[0x8];
    /* 0x108 */ __int64 Load;
};

struct Client::System::Resource::Handle::ShaderPackageResourceHandle /* Size=0x0 */
{
    /* 0x0 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /* 0xB0 */ Client::Graphics::Kernel::ShaderPackage* ShaderPackage;
};

struct Client::System::Resource::Handle::SkeletonResourceHandle::SkeletonHeader /* Size=0x30 */
{
    /* 0x00 */ unsigned __int32 SklbMagic;
    /* 0x04 */ unsigned __int32 SklbVersion;
    /* 0x08 */ unsigned __int32 LayerOffset;
    /* 0x0C */ unsigned __int32 SklbOffset;
    /* 0x10 */ unsigned __int16 ConnectBoneIndex;
    /*      */ byte _gap_0x12[0x2];
    /* 0x14 */ unsigned __int32 CharacterId;
    /* 0x18 */ unsigned __int32 SkeletonMappers[0x4];
    /* 0x28 */ unsigned __int16 ConnectBoneIds[0x4];
};

struct Client::System::Resource::Handle::SkeletonResourceHandle /* Size=0x0 */
{
    /* 0x0 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*     */ byte _gap_0xB0[0x18];
    /* 0xC8 */ unsigned __int32 BoneCount;
    /*     */ byte _gap_0xCC[0x4];
    /*     */ byte _gap_0xD0[0x28];
    /* 0xF8 */ Common::Math::Matrix4x4* InverseBoneMatrix;
    /*     */ byte _gap_0x100[0x8];
    /* 0x108 */ Client::System::Resource::Handle::SkeletonResourceHandle::SkeletonHeader SkeletonData;
};

struct Client::System::Resource::Handle::TextureResourceHandle /* Size=0x140 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x68];
    /* 0x118 */ Client::Graphics::Kernel::Texture* Texture;
    /*       */ byte _gap_0x120[0x20];
};

struct Client::System::Resource::ResourceGraph /* Size=0xC80 */
{
    /*       */ byte _gap_0x0[0xC80];
};

struct Client::System::Resource::ResourceGraph::CategoryContainer /* Size=0xA0 */
{
    /*      */ byte _gap_0x0[0xA0];
};

struct Client::System::Resource::ResourceManager /* Size=0x1728 */
{
    /*        */ byte _gap_0x0[0x8];
    /* 0x0008 */ Client::System::Resource::ResourceGraph* ResourceGraph;
    /*        */ byte _gap_0x10[0x1718];
};

struct Client::System::Scheduler::Base::SchedulerState /* Size=0x18 */
{
    /* 0x00 */ void** VTable;
    /*      */ byte _gap_0x8[0x10];
};

struct Client::System::Scheduler::Base::SchedulerTimeline /* Size=0x280 */
{
    /*       */ byte _gap_0x0[0x188];
    /*       */ byte _gap_0x188[0x4];
    /* 0x18C */ unsigned __int32 OwningGameObjectIndex;
    /*       */ byte _gap_0x190[0xF0];
};

struct Client::System::Scheduler::Base::SchedulerTimeline::SchedulerTimelineVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0xE0];
    /* 0xE0 */ __int64 GetOwningGameObjectIndex;
};

struct Client::System::Scheduler::Base::TimelineController /* Size=0x80 */
{
    /* 0x00 */ Client::System::Scheduler::Base::SchedulerState SchedulerState;
    /*      */ byte _gap_0x18[0x68];
};

struct Client::System::Scheduler::Resource::SchedulerResource::ResourceName /* Size=0x40 */
{
    /* 0x00 */ void** VTable;
    /* 0x08 */ byte* DataPointer;
    /* 0x10 */ unsigned __int16 Unk1;
    /* 0x12 */ byte Buffer[0x2E];
};

struct Client::System::Scheduler::Resource::SchedulerResource /* Size=0x88 */
{
    /* 0x00 */ void** VTable;
    /* 0x08 */ Client::System::Scheduler::Resource::SchedulerResource* Next;
    /* 0x10 */ Client::System::Scheduler::Resource::SchedulerResource* Previous;
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ Client::System::Resource::Handle::ResourceHandle* Resource;
    /*      */ byte _gap_0x28[0x10];
    /* 0x38 */ Client::System::Scheduler::Resource::SchedulerResource::ResourceName Name;
    /* 0x78 */ unsigned __int32 Unk1;
    /* 0x7C */ unsigned __int32 Consumers;
    /*      */ byte _gap_0x80[0x8];
};

struct Client::System::Scheduler::Resource::SchedulerResourceManagement /* Size=0x58 */
{
    /* 0x00 */ void** VTable;
    /* 0x08 */ Client::System::Scheduler::Resource::SchedulerResource* Begin;
    /* 0x10 */ void* Unknown;
    /* 0x18 */ unsigned __int64 NumResources;
    /*      */ byte _gap_0x20[0x38];
};

struct Client::UI::ActionBarSlot /* Size=0xC8 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ __int32 ActionId;
    /*      */ byte _gap_0x8[0x88];
    /* 0x90 */ Component::GUI::AtkComponentNode* Icon;
    /* 0x98 */ Component::GUI::AtkTextNode* ControlHintTextNode;
    /* 0xA0 */ Component::GUI::AtkResNode* IconFrame;
    /* 0xA8 */ Component::GUI::AtkImageNode* ChargeIcon;
    /* 0xB0 */ Component::GUI::AtkResNode* RecastOverlayContainer;
    /* 0xB8 */ byte* PopUpHelpTextPtr;
    /*      */ byte _gap_0xC0[0x8];
};

struct Client::UI::ActionInfo /* Size=0x38 */
{
    /* 0x00 */ byte* ActionText;
    /* 0x08 */ byte* TooltipText;
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ unsigned __int32 ActionId;
    /* 0x18 */ unsigned __int32 IconId;
    /*      */ byte _gap_0x1C[0x4];
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ unsigned __int32 ActionCategory;
    /*      */ byte _gap_0x28[0x10];
};

struct Client::UI::AddonActionBarBase /* Size=0x248 */
{
    /*       */ byte _gap_0x0[0x220];
    /* 0x220 */ Client::UI::ActionBarSlot* ActionBarSlots;
    /*       */ byte _gap_0x228[0x10];
    /* 0x238 */ __int16 CurrentPulsingSlots;
    /*       */ byte _gap_0x23A[0x2];
    /* 0x23C */ byte RaptureHotbarId;
    /*       */ byte _gap_0x23D;
    /* 0x23E */ byte SlotCount;
    /*       */ byte _gap_0x23F;
    /* 0x240 */ bool IsSharedHotbar;
    /*       */ byte _gap_0x241;
    /*       */ byte _gap_0x242[0x2];
    /*       */ byte _gap_0x244[0x4];
};

struct Client::UI::AddonActionBarX /* Size=0x298 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase AddonActionBarBase;
    /*       */ byte _gap_0x248[0x28];
    /* 0x270 */ Client::UI::ActionBarLayout ActionBarLayout;
    /*       */ byte _gap_0x271;
    /*       */ byte _gap_0x272[0x2];
    /*       */ byte _gap_0x274[0x4];
    /*       */ byte _gap_0x278[0x20];
};

struct Client::UI::AddonActionBar /* Size=0x2B8 */
{
    /* 0x000 */ Client::UI::AddonActionBarX AddonActionBarX;
    /*       */ byte _gap_0x298[0x20];
};

struct Client::UI::AddonActionBarBase::AddonActionBarBaseVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x268];
    /* 0x268 */ __int64 PulseActionBarSlot;
};

struct Client::UI::AddonActionCross /* Size=0x710 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase ActionBarBase;
    /*       */ byte _gap_0x248[0x4A0];
    /* 0x6E8 */ __int32 ExpandedHoldControlsLTRT;
    /* 0x6EC */ __int32 ExpandedHoldControlsRTLT;
    /*       */ byte _gap_0x6F0[0x20];
};

struct Client::UI::AddonActionDoubleCrossBase /* Size=0x2F8 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase ActionBarBase;
    /*       */ byte _gap_0x248[0x98];
    /*       */ byte _gap_0x2E0;
    /* 0x2E1 */ byte ShowDPadSlots;
    /*       */ byte _gap_0x2E2[0x2];
    /*       */ byte _gap_0x2E4[0x4];
    /* 0x2E8 */ byte BarTarget;
    /*       */ byte _gap_0x2E9;
    /*       */ byte _gap_0x2EA[0x2];
    /* 0x2EC */ byte UseLeftSide;
    /* 0x2ED */ byte MergedPositioning;
    /*       */ byte _gap_0x2EE[0x2];
    /*       */ byte _gap_0x2F0[0x8];
};

struct Component::GUI::AtkEventListener /* Size=0x8 */
{
    union {
    /* 0x0 */ void* vtbl;
    /* 0x0 */ void** vfunc;
    } _union_0x0;
};

struct Pointer::ComponentGUIAtkUldManagerDuplicateObjectList /* Size=0x8 */
{
    /* 0x0 */ Component::GUI::AtkUldManager::DuplicateObjectList* Value;
};

struct StdLinkedList::Node::PointerComponentGUIAtkUldManagerDuplicateObjectList /* Size=0x18 */
{
    /* 0x00 */ Pointer::ComponentGUIAtkUldManagerDuplicateObjectList Value;
    /* 0x08 */ StdLinkedList::Node::PointerComponentGUIAtkUldManagerDuplicateObjectList* Next;
    /* 0x10 */ StdLinkedList::Node::PointerComponentGUIAtkUldManagerDuplicateObjectList* Previous;
};

struct StdLinkedList::PointerComponentGUIAtkUldManagerDuplicateObjectList /* Size=0x18 */
{
    /* 0x00 */ StdLinkedList::Node::PointerComponentGUIAtkUldManagerDuplicateObjectList* End;
    /* 0x08 */ StdLinkedList::Node::PointerComponentGUIAtkUldManagerDuplicateObjectList* Start;
    /* 0x10 */ unsigned __int32 Count;
    /*      */ byte _gap_0x14[0x4];
};

struct Component::GUI::AtkUldManager /* Size=0x90 */
{
    /* 0x00 */ Component::GUI::AtkUldAsset* Assets;
    /* 0x08 */ Component::GUI::AtkUldPartsList* PartsList;
    /* 0x10 */ Component::GUI::AtkUldObjectInfo* Objects;
    /* 0x18 */ Component::GUI::AtkUldComponentDataBase* ComponentData;
    /* 0x20 */ unsigned __int16 AssetCount;
    /* 0x22 */ unsigned __int16 PartsListCount;
    /* 0x24 */ unsigned __int16 ObjectCount;
    /* 0x26 */ unsigned __int16 DuplicateObjectCount;
    /* 0x28 */ Client::System::Resource::Handle::ResourceHandle* UldResourceHandle;
    /* 0x30 */ Component::GUI::AtkUldManager::DuplicateNodeInfo* DuplicateNodeInfoList;
    /* 0x38 */ Component::GUI::AtkTimelineManager* TimelineManager;
    /* 0x40 */ unsigned __int16 Unk40;
    /* 0x42 */ unsigned __int16 NodeListCount;
    /*      */ byte _gap_0x44[0x4];
    /* 0x48 */ void* AtkResourceRendererManager;
    /* 0x50 */ Component::GUI::AtkResNode** NodeList;
    /* 0x58 */ StdLinkedList::PointerComponentGUIAtkUldManagerDuplicateObjectList DuplicateObjectsList;
    /*      */ byte _gap_0x70[0x8];
    /* 0x78 */ Component::GUI::AtkResNode* RootNode;
    /* 0x80 */ unsigned __int16 RootNodeWidth;
    /* 0x82 */ unsigned __int16 RootNodeHeight;
    /* 0x84 */ unsigned __int16 NodeListSize;
    /* 0x86 */ byte Flags1;
    /*      */ byte _gap_0x87;
    /*      */ byte _gap_0x88;
    /* 0x89 */ Component::GUI::AtkLoadState LoadedState;
    /*      */ byte _gap_0x8A[0x2];
    /*      */ byte _gap_0x8C[0x4];
};

struct Component::GUI::AtkUnitBase /* Size=0x220 */
{
    union {
    /* 0x000 */ Component::GUI::AtkEventListener AtkEventListener;
    /* 0x000 */ Component::GUI::AtkUnitBase::AtkUnitBaseVTable* VTable;
    } _union_0x0;
    /* 0x008 */ byte Name[0x20];
    /* 0x028 */ Component::GUI::AtkUldManager UldManager;
    /*       */ byte _gap_0xB8[0x10];
    /* 0x0C8 */ Component::GUI::AtkResNode* RootNode;
    /* 0x0D0 */ Component::GUI::AtkCollisionNode* WindowCollisionNode;
    /* 0x0D8 */ Component::GUI::AtkCollisionNode* WindowHeaderCollisionNode;
    /* 0x0E0 */ Component::GUI::AtkResNode* CursorTarget;
    /*       */ byte _gap_0xE8[0x20];
    /* 0x108 */ Component::GUI::AtkComponentNode* WindowNode;
    /*       */ byte _gap_0x110[0x50];
    /* 0x160 */ Component::GUI::AtkValue* AtkValues;
    /*       */ byte _gap_0x168[0x18];
    /*       */ byte _gap_0x180[0x2];
    /* 0x182 */ byte Flags;
    /*       */ byte _gap_0x183;
    /*       */ byte _gap_0x184[0x4];
    /*       */ byte _gap_0x188[0x20];
    /*       */ byte _gap_0x1A8[0x4];
    /* 0x1AC */ float Scale;
    /*       */ byte _gap_0x1B0[0x4];
    /*       */ byte _gap_0x1B4[0x2];
    /* 0x1B6 */ byte VisibilityFlags;
    /*       */ byte _gap_0x1B7;
    /*       */ byte _gap_0x1B8[0x4];
    /* 0x1BC */ __int16 X;
    /* 0x1BE */ __int16 Y;
    /*       */ byte _gap_0x1C0[0x8];
    /*       */ byte _gap_0x1C8[0x2];
    /* 0x1CA */ unsigned __int16 AtkValuesCount;
    /* 0x1CC */ unsigned __int16 ID;
    /* 0x1CE */ unsigned __int16 ParentID;
    /* 0x1D0 */ unsigned __int16 UnknownID;
    /* 0x1D2 */ unsigned __int16 ContextMenuParentID;
    /*       */ byte _gap_0x1D4;
    /* 0x1D5 */ byte Alpha;
    /* 0x1D6 */ byte ShowHideFlags;
    /*       */ byte _gap_0x1D7;
    /* 0x1D8 */ Component::GUI::AtkResNode** CollisionNodeList;
    /* 0x1E0 */ unsigned __int32 CollisionNodeListCount;
    /*       */ byte _gap_0x1E4[0x4];
    /*       */ byte _gap_0x1E8[0x38];
};

struct Client::UI::AddonActionMenu /* Size=0x1720 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x0220 */ Component::GUI::AtkComponentList* ActionList;
    /* 0x0228 */ Component::GUI::AtkComponentList* TraitList;
    /* 0x0230 */ Component::GUI::AtkComponentRadioButton* ActionsRadioButton;
    /* 0x0238 */ Component::GUI::AtkComponentRadioButton* TraitsRadioButton;
    /* 0x0240 */ Component::GUI::AtkComponentRadioButton* GathererRoleRadioButton;
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* GeneralRadioButton;
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* OrdersRadioButton;
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* MainCommandsRadioButton;
    /* 0x0260 */ Component::GUI::AtkComponentRadioButton* PerformanceRadioButton;
    /* 0x0268 */ Component::GUI::AtkComponentRadioButton* ExtrasRadioButton;
    /* 0x0270 */ Component::GUI::AtkComponentRadioButton* RoleRadioButton;
    /*        */ byte _gap_0x278[0xA0];
    /* 0x0318 */ byte ActionArray[0x1180];
    /*        */ byte _gap_0x1498[0x10];
    /* 0x14A8 */ Component::GUI::AtkResNode* SidebarContainer;
    /* 0x14B0 */ Component::GUI::AtkResNode* ContentsContainer;
    /* 0x14B8 */ Component::GUI::AtkResNode* ActionsFooterContainer;
    /* 0x14C0 */ Component::GUI::AtkComponentButton* HelpButton;
    /* 0x14C8 */ Component::GUI::AtkComponentButton* CompactModeToggleButton;
    /* 0x14D0 */ Component::GUI::AtkResNode* LevelTextContainer;
    /* 0x14D8 */ Component::GUI::AtkImageNode* JobIcon;
    /* 0x14E0 */ Component::GUI::AtkTextNode* JobText;
    /*        */ byte _gap_0x14E8[0x28];
    /* 0x1510 */ Component::GUI::AtkComponentScrollBar* Scrollbar;
    /* 0x1518 */ Component::GUI::AtkResNode* ActionContentsContainer;
    /* 0x1520 */ Component::GUI::AtkCollisionNode* ActionCollision;
    /*        */ byte _gap_0x1528[0x1F8];
};

struct Client::UI::AddonAOZNotebook::SpellbookBlock /* Size=0x48 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* AtkComponentBase;
    /* 0x08 */ Component::GUI::AtkCollisionNode* AtkCollisionNode;
    /* 0x10 */ Component::GUI::AtkComponentCheckBox* AtkComponentCheckBox;
    /* 0x18 */ Component::GUI::AtkComponentIcon* AtkComponentIcon;
    /* 0x20 */ Component::GUI::AtkTextNode* AtkTextNode;
    /* 0x28 */ Component::GUI::AtkResNode* AtkResNode1;
    /* 0x30 */ Component::GUI::AtkResNode* AtkResNode2;
    /* 0x38 */ char* Name;
    /* 0x40 */ unsigned __int32 ActionID;
    /*      */ byte _gap_0x44[0x4];
};

struct Client::UI::AddonAOZNotebook::ActiveActions /* Size=0x20 */
{
    /* 0x00 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop;
    /* 0x08 */ Component::GUI::AtkTextNode* AtkTextNode;
    /* 0x10 */ char* Name;
    /* 0x18 */ __int32 ActionID;
    /*      */ byte _gap_0x1C[0x4];
};

struct Client::UI::AddonAOZNotebook /* Size=0xCC8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xE8];
    /* 0x308 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock01;
    /* 0x350 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock02;
    /* 0x398 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock03;
    /* 0x3E0 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock04;
    /* 0x428 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock05;
    /* 0x470 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock06;
    /* 0x4B8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock07;
    /* 0x500 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock08;
    /* 0x548 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock09;
    /* 0x590 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock10;
    /* 0x5D8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock11;
    /* 0x620 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock12;
    /* 0x668 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock13;
    /* 0x6B0 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock14;
    /* 0x6F8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock15;
    /* 0x740 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock16;
    /*       */ byte _gap_0x788[0x98];
    /* 0x820 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions01;
    /* 0x840 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions02;
    /* 0x860 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions03;
    /* 0x880 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions04;
    /* 0x8A0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions05;
    /* 0x8C0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions06;
    /* 0x8E0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions07;
    /* 0x900 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions08;
    /* 0x920 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions09;
    /* 0x940 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions10;
    /* 0x960 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions11;
    /* 0x980 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions12;
    /* 0x9A0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions13;
    /* 0x9C0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions14;
    /* 0x9E0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions15;
    /* 0xA00 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions16;
    /* 0xA20 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions17;
    /* 0xA40 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions18;
    /* 0xA60 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions19;
    /* 0xA80 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions20;
    /* 0xAA0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions21;
    /* 0xAC0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions22;
    /* 0xAE0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions23;
    /* 0xB00 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions24;
    /*       */ byte _gap_0xB20[0x1A8];
};

struct Client::UI::AddonBank /* Size=0x298 */
{
    /*       */ byte _gap_0x0[0x298];
};

struct Client::UI::AddonBank::AddonBankVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonBannerEditor /* Size=0x4E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xB8];
    /* 0x2D8 */ Component::GUI::AtkComponentDropDownList* PresetDropdown;
    /*       */ byte _gap_0x2E0[0x18];
    /* 0x2F8 */ Component::GUI::AtkComponentDropDownList* BackgroundDropdown;
    /*       */ byte _gap_0x300[0x18];
    /* 0x318 */ Component::GUI::AtkComponentDropDownList* FrameDropdown;
    /*       */ byte _gap_0x320[0x18];
    /* 0x338 */ Component::GUI::AtkComponentDropDownList* AccentDropdown;
    /*       */ byte _gap_0x340[0x18];
    /* 0x358 */ Component::GUI::AtkComponentDropDownList* PoseDropdown;
    /*       */ byte _gap_0x360[0x18];
    /* 0x378 */ Component::GUI::AtkComponentDropDownList* ExpressionDropdown;
    /*       */ byte _gap_0x380[0x38];
    /* 0x3B8 */ Component::GUI::AtkComponentCheckBox* PlayAnimationCheckbox;
    /* 0x3C0 */ Component::GUI::AtkComponentCheckBox* HeadFacingCameraCheckbox;
    /* 0x3C8 */ Component::GUI::AtkComponentCheckBox* EyesFacingCameraCheckbox;
    /*       */ byte _gap_0x3D0[0x28];
    /* 0x3F8 */ Component::GUI::AtkComponentButton* ApplyEquipmentButton;
    /* 0x400 */ Component::GUI::AtkComponentButton* SaveButton;
    /* 0x408 */ Component::GUI::AtkComponentButton* CloseButton;
    /* 0x410 */ Component::GUI::AtkComponentSlider* AmbientLightingColorRedSlider;
    /* 0x418 */ Component::GUI::AtkComponentSlider* AmbientLightingColorGreenSlider;
    /* 0x420 */ Component::GUI::AtkComponentSlider* AmbientLightingColorBlueSlider;
    /* 0x428 */ Component::GUI::AtkComponentSlider* AmbientLightingBrightnessSlider;
    /* 0x430 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorRedSlider;
    /* 0x438 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorGreenSlider;
    /* 0x440 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorBlueSlider;
    /* 0x448 */ Component::GUI::AtkComponentSlider* DirectionalLightingBrightnessSlider;
    /* 0x450 */ Component::GUI::AtkComponentSlider* DirectionalLightingVerticalAngleSlider;
    /* 0x458 */ Component::GUI::AtkComponentSlider* DirectionalLightingHorizontalAngleSlider;
    /* 0x460 */ Component::GUI::AtkComponentSlider* CameraZoomSlider;
    /* 0x468 */ Component::GUI::AtkComponentSlider* ImageRotation;
    /*       */ byte _gap_0x470[0x50];
    /* 0x4C0 */ Component::GUI::AtkResNode* WarningSymbol;
    /*       */ byte _gap_0x4C8[0x4];
    /* 0x4CC */ __int16 NumPresets;
    /*       */ byte _gap_0x4CE[0x2];
    /*       */ byte _gap_0x4D0[0x10];
    /*       */ byte _gap_0x4E0[0x2];
    /*       */ byte _gap_0x4E2;
    /* 0x4E3 */ bool IsWarningSymbolShown;
    /*       */ byte _gap_0x4E4[0x4];
};

struct Client::UI::AddonCastBar /* Size=0x500 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::System::String::Utf8String CastName;
    /*       */ byte _gap_0x288[0x30];
    /*       */ byte _gap_0x2B8[0x4];
    /* 0x2BC */ unsigned __int16 CastTime;
    /*       */ byte _gap_0x2BE[0x2];
    /* 0x2C0 */ float CastPercent;
    /*       */ byte _gap_0x2C4[0x4];
    /*       */ byte _gap_0x2C8[0x238];
};

struct Client::UI::AddonCharacterInspect /* Size=0x500 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x210];
    /* 0x430 */ Component::GUI::AtkComponentBase* PreviewComponent;
    /*       */ byte _gap_0x438[0xC8];
};

struct Client::UI::AddonChatLogPanel /* Size=0x3D0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x60];
    /* 0x280 */ Component::GUI::AtkTextNode* ChatText;
    /*       */ byte _gap_0x288[0x28];
    /* 0x2B0 */ byte FontSize;
    /*       */ byte _gap_0x2B1;
    /*       */ byte _gap_0x2B2[0x2];
    /* 0x2B4 */ unsigned __int32 FirstLineVisible;
    /* 0x2B8 */ unsigned __int32 LastLineVisible;
    /*       */ byte _gap_0x2BC[0x4];
    /* 0x2C0 */ unsigned __int32 Unknown2C0;
    /* 0x2C4 */ unsigned __int32 TotalLineCount;
    /*       */ byte _gap_0x2C8[0x30];
    /* 0x2F8 */ unsigned __int32 MessagesAboveCurrent;
    /*       */ byte _gap_0x2FC[0x4];
    /*       */ byte _gap_0x300[0x40];
    /*       */ byte _gap_0x340;
    /* 0x341 */ byte IsScrolledBottom;
    /*       */ byte _gap_0x342[0x2];
    /*       */ byte _gap_0x344[0x4];
    /*       */ byte _gap_0x348[0x88];
};

struct Client::UI::AddonChocoboBreedTraining /* Size=0x230 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* CommenceButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* CancelButton;
};

struct Client::UI::AddonContentsFinder /* Size=0x16C8 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x98];
    /* 0x02B8 */ Component::GUI::AtkComponentButton* JoinButton;
    /* 0x02C0 */ Component::GUI::AtkComponentButton* ClearSelectionButton;
    /* 0x02C8 */ Component::GUI::AtkComponentRadioButton* DutyRouletteRadioButton;
    /* 0x02D0 */ Component::GUI::AtkComponentRadioButton* Dungeons1RadioButton;
    /* 0x02D8 */ Component::GUI::AtkComponentRadioButton* Dungeons2RadioButton;
    /* 0x02E0 */ Component::GUI::AtkComponentRadioButton* GuildHeistsRadioButton;
    /* 0x02E8 */ Component::GUI::AtkComponentRadioButton* Trials1RadioButton;
    /* 0x02F0 */ Component::GUI::AtkComponentRadioButton* Trials2RadioButton;
    /* 0x02F8 */ Component::GUI::AtkComponentRadioButton* Raids1RadioButton;
    /* 0x0300 */ Component::GUI::AtkComponentRadioButton* Raids2RadioButton;
    /* 0x0308 */ Component::GUI::AtkComponentRadioButton* PvpRadioButton;
    /* 0x0310 */ Component::GUI::AtkComponentRadioButton* GoldSaucerRadioButton;
    /* 0x0318 */ byte SelectedDutyTextNode[0x28];
    /* 0x0340 */ Component::GUI::AtkComponentTreeList* DutyList;
    /* 0x0348 */ Component::GUI::AtkComponentDropDownList* OrderByButton;
    /* 0x0350 */ Component::GUI::AtkComponentButton* RefreshButton;
    /* 0x0358 */ Component::GUI::AtkComponentButton* DutyTypeButton;
    /* 0x0360 */ Component::GUI::AtkTextNode* JobNameTextNode;
    /* 0x0368 */ Component::GUI::AtkTextNode* UnkTextNode;
    /* 0x0370 */ Component::GUI::AtkTextNode* LevelTextNode;
    /* 0x0378 */ Component::GUI::AtkTextNode* ItemLevelTextNode;
    /* 0x0380 */ Component::GUI::AtkTextNode* RoleTextNode;
    /* 0x0388 */ Component::GUI::AtkTextNode* NumberSelectedTextNode;
    /* 0x0390 */ Component::GUI::AtkTextNode* ObtainingDataTextNode;
    /* 0x0398 */ Component::GUI::AtkTextNode* NumOtherPartiesRecruitingTextNode;
    /*        */ byte _gap_0x3A0[0x8];
    /* 0x03A8 */ Component::GUI::AtkImageNode* StarImageNode;
    /* 0x03B0 */ Component::GUI::AtkResNode* RoleIconResNode;
    /* 0x03B8 */ Component::GUI::AtkImageNode* RoleIconImageNode;
    /* 0x03C0 */ Component::GUI::AtkResNode* NumOtherPartiesRecruitingResNode;
    /* 0x03C8 */ byte SettingsButton[0x40];
    /*        */ byte _gap_0x408[0x12A0];
    /* 0x16A8 */ unsigned __int32 SelectedRadioButton;
    /*        */ byte _gap_0x16AC[0x4];
    /*        */ byte _gap_0x16B0[0x4];
    /* 0x16B4 */ unsigned __int32 SelectedRow;
    /* 0x16B8 */ unsigned __int32 NumEntries;
    /*        */ byte _gap_0x16BC[0x4];
    /*        */ byte _gap_0x16C0[0x8];
};

struct Client::UI::AddonContentsFinder::AddonContentsFinderVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::AddonContentsFinderConfirm /* Size=0x2A0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x8];
    /* 0x228 */ Component::GUI::AtkTextNode* AtkTextNode228;
    /* 0x230 */ Component::GUI::AtkTextNode* AtkTextNode230;
    /* 0x238 */ Component::GUI::AtkTextNode* AtkTextNode238;
    /* 0x240 */ Component::GUI::AtkTextNode* AtkTextNode240;
    /* 0x248 */ Component::GUI::AtkTextNode* AtkTextNode248;
    /*       */ byte _gap_0x250[0x38];
    /* 0x288 */ Component::GUI::AtkComponentButton* CommenceButton;
    /* 0x290 */ Component::GUI::AtkComponentButton* WithdrawButton;
    /* 0x298 */ Component::GUI::AtkComponentButton* WaitButton;
};

struct Client::UI::AddonContentsFinderConfirm::AddonContentsFinderConfirmVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::AddonContextIconMenu /* Size=0x2B0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ __int32 EntryCount;
    /*       */ byte _gap_0x224[0x4];
    /*       */ byte _gap_0x228[0x18];
    /* 0x240 */ Component::GUI::AtkComponentList* AtkComponentList240;
    /* 0x248 */ void* unk248;
    /* 0x250 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton250;
    /* 0x258 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton258;
    /* 0x260 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton260;
    /* 0x268 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton268;
    /* 0x270 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton270;
    /* 0x278 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton278;
    /* 0x280 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton280;
    /* 0x288 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton288;
    /* 0x290 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton290;
    /* 0x298 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton298;
    /*       */ byte _gap_0x2A0[0x10];
};

struct Client::UI::AddonContextMenu /* Size=0x2A0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x80];
};

struct Client::UI::AddonCutSceneSelectString /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x10];
    /* 0x230 */ Component::GUI::AtkComponentList* OptionList;
    /* 0x238 */ Component::GUI::AtkComponentTextNineGrid* TextLabel;
    /*       */ byte _gap_0x240[0x8];
};

struct Client::UI::AddonDeliveryItemInfo /* Size=0x68 */
{
    /* 0x00 */ unsigned __int32 ItemId;
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x60];
};

struct Client::UI::AddonDtr /* Size=0x368 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::System::String::Utf8String TimeModeTooltip;
    /* 0x288 */ Client::System::String::Utf8String NetworkInfoTooltip;
    /*       */ byte _gap_0x2F0[0x8];
    /* 0x2F8 */ Component::GUI::AtkTextNode* TimeText;
    /* 0x300 */ Component::GUI::AtkResNode* NetworkStrengthContainer;
    /* 0x308 */ Component::GUI::AtkImageNode* NetworkStrengthImage;
    /* 0x310 */ Component::GUI::AtkResNode* MailContainer;
    /* 0x318 */ Component::GUI::AtkImageNode* MailImage;
    /* 0x320 */ Component::GUI::AtkTextNode* MailText;
    /* 0x328 */ Component::GUI::AtkResNode* DutyRecorderContainer;
    /* 0x330 */ Component::GUI::AtkResNode* AlarmsContainer;
    /* 0x338 */ Component::GUI::AtkResNode* WalkModeContainer;
    /* 0x340 */ Component::GUI::AtkResNode* WorldInfoContainer;
    /* 0x348 */ Component::GUI::AtkTextNode* WorldText;
    /* 0x350 */ Component::GUI::AtkImageNode* WorldVisitImage;
    /* 0x358 */ Component::GUI::AtkCollisionNode* CollisionNode;
    /*       */ byte _gap_0x360[0x8];
};

struct Client::UI::AddonEnemyList /* Size=0x278 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton** EnemyOneComponent;
    /*       */ byte _gap_0x228[0x48];
    /*       */ byte _gap_0x270[0x2];
    /* 0x272 */ byte EnemyCount;
    /* 0x273 */ byte HoveredIndex;
    /* 0x274 */ byte SelectedIndex;
    /*       */ byte _gap_0x275;
    /*       */ byte _gap_0x276[0x2];
};

struct Client::UI::AddonExp /* Size=0x290 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x50];
    /* 0x270 */ byte ClassJob;
    /*       */ byte _gap_0x271;
    /*       */ byte _gap_0x272[0x2];
    /*       */ byte _gap_0x274[0x4];
    /* 0x278 */ unsigned __int32 CurrentExp;
    /* 0x27C */ unsigned __int32 RequiredExp;
    /* 0x280 */ unsigned __int32 RestedExp;
    /*       */ byte _gap_0x284[0x4];
    /*       */ byte _gap_0x288[0x8];
};

struct Client::UI::AddonFateReward /* Size=0x570 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkResNode* AtkResNode220;
    /* 0x228 */ Component::GUI::AtkImageNode* AtkImageNode228;
    /* 0x230 */ Component::GUI::AtkImageNode* AtkImageNode230;
    /* 0x238 */ Component::GUI::AtkResNode* AtkResNode238;
    /* 0x240 */ Component::GUI::AtkTextNode* AtkTextNode240;
    /* 0x248 */ Component::GUI::AtkTextNode* AtkTextNode248;
    /* 0x250 */ Component::GUI::AtkTextNode* AtkTextNode250;
    /* 0x258 */ Component::GUI::AtkImageNode* AtkImageNode258;
    /*       */ byte _gap_0x260[0x68];
    /* 0x2C8 */ Component::GUI::AtkComponentTextNineGrid* AtkComponentTextNineGrid2C8;
    /* 0x2D0 */ Component::GUI::AtkImageNode* AtkImageNode2D0;
    /* 0x2D8 */ Component::GUI::AtkResNode* AtkResNode2D8;
    /*       */ byte _gap_0x2E0[0x68];
    /* 0x348 */ Component::GUI::AtkComponentTextNineGrid* AtkComponentTextNineGrid348;
    /* 0x350 */ Component::GUI::AtkImageNode* AtkImageNode350;
    /* 0x358 */ Component::GUI::AtkResNode* AtkResNode358;
    /*       */ byte _gap_0x360[0x200];
    /* 0x560 */ Component::GUI::AtkResNode* AtkResNode560;
    /* 0x568 */ float ElapsedSeconds;
    /*       */ byte _gap_0x56C[0x4];
};

struct Client::UI::AddonFieldMarker /* Size=0x598 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x10];
    /* 0x230 */ __int32 HoveredButtonIndex;
    /*       */ byte _gap_0x234[0x4];
    /* 0x238 */ byte WaymarkInfo[0xC0];
    /*       */ byte _gap_0x2F8[0x280];
    /*       */ byte _gap_0x578[0x4];
    /* 0x57C */ __int32 HoveredPresetIndex;
    /* 0x580 */ byte SelectedPage;
    /*       */ byte _gap_0x581;
    /*       */ byte _gap_0x582[0x2];
    /*       */ byte _gap_0x584[0x4];
    /*       */ byte _gap_0x588[0x10];
};

struct Client::UI::AddonFriendList /* Size=0x380 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xD0];
    /* 0x2F0 */ Component::GUI::AtkComponentList* FriendList;
    /* 0x2F8 */ Component::GUI::AtkComponentButton* AddButton;
    /* 0x300 */ Component::GUI::AtkComponentCheckBox* MoveOnlineToTopCheckBox;
    /* 0x308 */ Component::GUI::AtkTextNode* CurrentFriendCountTextNode;
    /* 0x310 */ Component::GUI::AtkTextNode* ListIsEmptyTextNode;
    /*       */ byte _gap_0x318[0x8];
    /* 0x320 */ Component::GUI::AtkComponentDropDownList* FilterDropDownList;
    /* 0x328 */ Component::GUI::AtkComponentDropDownList* SortDropDownList;
    /*       */ byte _gap_0x330[0x50];
};

struct Client::UI::AddonGathering /* Size=0x300 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkResNode* UnkResNode220;
    /* 0x228 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox1;
    /* 0x230 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox2;
    /* 0x238 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox3;
    /* 0x240 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox4;
    /* 0x248 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox5;
    /* 0x250 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox6;
    /* 0x258 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox7;
    /* 0x260 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox8;
    /* 0x268 */ Component::GUI::AtkTextNode* InventoryQuantityTextNode;
    /* 0x270 */ Component::GUI::AtkResNode* UnkResNode270;
    /* 0x278 */ Component::GUI::AtkComponentCheckBox* QuickGatheringComponentCheckBox;
    /* 0x280 */ Component::GUI::AtkResNode* UnkResNode;
    /* 0x288 */ unsigned __int64 unk288;
    /* 0x290 */ unsigned __int64 unk290;
    /* 0x298 */ unsigned __int64 unk298;
    /* 0x2A0 */ unsigned __int64 unk2A0;
    /* 0x2A8 */ unsigned __int64 unk2A8;
    /* 0x2B0 */ unsigned __int64 unk2B0;
    /* 0x2B8 */ unsigned __int64 unk2B8;
    /* 0x2C0 */ unsigned __int64 unk2C0;
    /* 0x2C8 */ unsigned __int32 GatheredItemId1;
    /* 0x2CC */ unsigned __int32 GatheredItemId2;
    /* 0x2D0 */ unsigned __int32 GatheredItemId3;
    /* 0x2D4 */ unsigned __int32 GatheredItemId4;
    /* 0x2D8 */ unsigned __int32 GatheredItemId5;
    /* 0x2DC */ unsigned __int32 GatheredItemId6;
    /* 0x2E0 */ unsigned __int32 GatheredItemId7;
    /* 0x2E4 */ unsigned __int32 GatheredItemId8;
    /* 0x2E8 */ unsigned __int64 unk2E8;
    /* 0x2F0 */ unsigned __int64 unk2F0;
    /* 0x2F8 */ __int32 unk2F8;
    /* 0x2FC */ __int16 unk2FC;
    /*       */ byte _gap_0x2FE[0x2];
};

struct Client::UI::AddonGatheringMasterpiece /* Size=0x7F8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x168];
    /* 0x388 */ Component::GUI::AtkComponentDragDrop* CollectDragDrop;
    /*       */ byte _gap_0x390[0x468];
};

struct Client::UI::AddonGcArmyCapture /* Size=0x268 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeployButton;
    /* 0x228 */ Component::GUI::AtkComponentList* MissionList;
    /* 0x230 */ Component::GUI::AtkComponentList* ChosenRecruitList;
    /* 0x238 */ Component::GUI::AtkTextNode* ScriptsTextNode;
    /* 0x240 */ Component::GUI::AtkTextNode* ExpRewardTextNode;
    /* 0x248 */ Component::GUI::AtkComponentBase* ExpRewardComponent;
    /* 0x250 */ Component::GUI::AtkTextNode* ExpendituresTextNode;
    /* 0x258 */ Component::GUI::AtkTextNode* MissionLevelTextNode;
    /* 0x260 */ Component::GUI::AtkTextNode* MissionRequirementsTextNode;
};

struct Client::UI::AddonGcArmyExpedition /* Size=0x2E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeployButton;
    /* 0x228 */ Component::GUI::AtkComponentList* MissionList;
    /*       */ byte _gap_0x230[0x8];
    /* 0x238 */ Component::GUI::AtkTextNode* ListHeaderTextNode;
    /* 0x240 */ Component::GUI::AtkTextNode* ScriptsTextNode;
    /* 0x248 */ Component::GUI::AtkTextNode* MissionDescriptionTextNode;
    /*       */ byte _gap_0x250[0x8];
    /* 0x258 */ Component::GUI::AtkComponentBase* SquadronExpRewardComponentNode;
    /* 0x260 */ Component::GUI::AtkComponentBase* ItemRewardComponentNode;
    /* 0x268 */ Component::GUI::AtkTextNode* MissionSealCostTextNode;
    /* 0x270 */ Component::GUI::AtkResNode* MissionLevelResNode;
    /* 0x278 */ Component::GUI::AtkTextNode* MissionLevelTextNode;
    /*       */ byte _gap_0x280[0x18];
    /* 0x298 */ Component::GUI::AtkComponentBase* RequiredAttributesComponentNode;
    /* 0x2A0 */ Component::GUI::AtkComponentBase* CurrentAttributesComponentNode;
    /*       */ byte _gap_0x2A8[0x18];
    /* 0x2C0 */ Component::GUI::AtkResNode* SquadronSergeantImageResNode;
    /* 0x2C8 */ Component::GUI::AtkResNode* SquadronSergeantChatMessageResNode;
    /* 0x2D0 */ Component::GUI::AtkTextNode* SquadronSergeantChatMessageTextNode;
    /* 0x2D8 */ __int32 SelectedTab;
    /*       */ byte _gap_0x2DC[0x4];
    /*       */ byte _gap_0x2E0[0x8];
};

struct Client::UI::AddonGcArmyExpeditionResult /* Size=0x228 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* CompleteButton;
};

struct Client::UI::AddonGoldSaucerInfo /* Size=0x310 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ __int32 SelectedCategory;
    /* 0x224 */ __int32 SelectedSubCategory;
    /*       */ byte _gap_0x228[0x78];
    /* 0x2A0 */ byte CategoryRadioButtons[0x30];
    /* 0x2D0 */ byte ChocoboRadioButtons[0x18];
    /* 0x2E8 */ Component::GUI::AtkCollisionNode* ContentsSection;
    /*       */ byte _gap_0x2F0[0x8];
    /* 0x2F8 */ Component::GUI::AtkResNode* ChocoboPetInfo;
    /* 0x300 */ Component::GUI::AtkNineGridNode* ChocoboPetExpBar;
    /* 0x308 */ __int32 ChocoboPetExpBarWidth;
    /*       */ byte _gap_0x30C[0x4];
};

struct Client::UI::AddonGrandCompanySupplyList /* Size=0x760 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x60];
    /* 0x280 */ Component::GUI::AtkComponentList* SupplyProvisioningList;
    /* 0x288 */ Component::GUI::AtkComponentList* ExpertDeliveryList;
    /* 0x290 */ Component::GUI::AtkComponentDropDownList* SortByDropdown;
    /* 0x298 */ Component::GUI::AtkComponentDropDownList* FilterDropdown;
    /* 0x2A0 */ Component::GUI::AtkComponentRadioButton* SupplyRadioButton;
    /* 0x2A8 */ Component::GUI::AtkComponentRadioButton* ProvisioningRadioButton;
    /* 0x2B0 */ Component::GUI::AtkComponentRadioButton* ExpertDeliveryRadioButton;
    /*       */ byte _gap_0x2B8[0x8];
    /* 0x2C0 */ Component::GUI::AtkTextNode* NextMissionAllowanceTextNode;
    /* 0x2C8 */ Component::GUI::AtkTextNode* ListEmptyTextNode;
    /* 0x2D0 */ Component::GUI::AtkTextNode* SealCountTextNode;
    /* 0x2D8 */ Component::GUI::AtkImageNode* SealIconNode;
    /*       */ byte _gap_0x2E0[0x8];
    /* 0x2E8 */ __int32 SelectedTab;
    /* 0x2EC */ __int32 SelectedSortBy;
    /* 0x2F0 */ __int32 SelectedFilter;
    /*       */ byte _gap_0x2F4[0x4];
    /*       */ byte _gap_0x2F8[0x468];
};

struct Client::UI::AddonGrandCompanySupplyReward /* Size=0x230 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeliverButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* CancelButton;
};

struct Client::UI::AddonGSInfoCardDeck /* Size=0x228 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentList* DeckList;
};

struct Client::UI::AddonGSInfoCardList /* Size=0x540 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x128];
    /* 0x348 */ Component::GUI::AtkResNode* PageSelection;
    /* 0x350 */ byte PageButtons[0x48];
    /* 0x398 */ Component::GUI::AtkComponentButton* GotoFirstPageButton;
    /* 0x3A0 */ Component::GUI::AtkComponentButton* GotoLastPageButton;
    /*       */ byte _gap_0x3A8[0x10];
    /* 0x3B8 */ byte CardButtons[0xF0];
    /* 0x4A8 */ Component::GUI::AtkTextNode* TotalTextNode;
    /* 0x4B0 */ Component::GUI::AtkImageNode* SelectedButtonBorderImage;
    /* 0x4B8 */ Component::GUI::AtkComponentDropDownList* CardDisplayFilter;
    /*       */ byte _gap_0x4C0[0x10];
    /* 0x4D0 */ Component::GUI::AtkTextNode* SelectedCardName;
    /* 0x4D8 */ Component::GUI::AtkTextNode* SelectedCardTribeName;
    /* 0x4E0 */ Component::GUI::AtkTextNode* SelectedCardDescription;
    /* 0x4E8 */ Component::GUI::AtkTextNode* PreviewedCardNumber;
    /* 0x4F0 */ Component::GUI::AtkTextNode* SelectedCardNumber;
    /* 0x4F8 */ Component::GUI::AtkTextNode* SelectedCardAcquisitionName;
    /* 0x500 */ Component::GUI::AtkImageNode* SelectedCardAcquisitionIcon;
    /* 0x508 */ Client::UI::GSInfoCardListFilterMode FilterMode;
    /*       */ byte _gap_0x50C[0x4];
    /* 0x510 */ __int32 SelectedPage;
    /* 0x514 */ __int32 SelectedCardIndex;
    /*       */ byte _gap_0x518[0x28];
};

struct Client::UI::AddonGSInfoChocoboParam /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Component::GUI::AtkComponentBase* RaceAbility1;
    /* 0x240 */ Component::GUI::AtkComponentBase* RaceAbility2;
};

struct Client::UI::AddonGSInfoEmj /* Size=0x258 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* MatchesPlayed;
    /* 0x228 */ Component::GUI::AtkTextNode* CurrentRating;
    /* 0x230 */ Component::GUI::AtkTextNode* HighestRating;
    /* 0x238 */ Component::GUI::AtkTextNode* Rank;
    /* 0x240 */ Component::GUI::AtkTextNode* NextRankPoints;
    /* 0x248 */ Component::GUI::AtkTextNode* Points;
    /* 0x250 */ Component::GUI::AtkComponentButton* ResetRankButton;
};

struct Client::UI::AddonGSInfoGeneral /* Size=0x250 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentBase* MGPAmountDisplay;
    /* 0x228 */ Component::GUI::AtkComponentBase* TournamentMatches;
    /* 0x230 */ Component::GUI::AtkComponentBase* TournamentWins;
    /* 0x238 */ Component::GUI::AtkComponentBase* TournamentPoints;
    /* 0x240 */ Component::GUI::AtkComponentBase* TournamentInfo;
    /* 0x248 */ Component::GUI::AtkResNode* TournamentResults;
};

struct Client::UI::AddonGSInfoMinionBattle /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentBase* TournamentMatches;
    /* 0x228 */ Component::GUI::AtkComponentBase* TournamentWins;
    /* 0x230 */ Component::GUI::AtkComponentBase* TournamentPoints;
    /* 0x238 */ Component::GUI::AtkComponentBase* TournamentInfo;
    /* 0x240 */ Component::GUI::AtkResNode* TournamentResults;
};

struct Client::UI::AddonGuildLeve /* Size=0x18F0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x8];
    /* 0x0228 */ Component::GUI::AtkComponentTreeList* AtkComponentTreeList228;
    /* 0x0230 */ Component::GUI::AtkComponentRadioButton* FieldcraftButton;
    /* 0x0238 */ Component::GUI::AtkComponentRadioButton* TradecraftButton;
    union {
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* CarpenterButton;
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* MinerButton;
    } _union_0x248;
    union {
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* BlacksmithButton;
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* BotanistButton;
    } _union_0x250;
    union {
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* ArmorerButton;
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* FisherButton;
    } _union_0x258;
    /*        */ byte _gap_0x258[0x8];
    /* 0x0260 */ Component::GUI::AtkComponentRadioButton* GoldsmithButton;
    /* 0x0268 */ Component::GUI::AtkComponentRadioButton* LeatherworkerButton;
    /* 0x0270 */ Component::GUI::AtkComponentRadioButton* WeaverButton;
    /* 0x0278 */ Component::GUI::AtkComponentRadioButton* AlchemistButton;
    /* 0x0280 */ Component::GUI::AtkComponentRadioButton* CulinarianButton;
    /* 0x0288 */ Component::GUI::AtkResNode* AtkResNode288;
    union {
    /* 0x0290 */ Client::System::String::Utf8String CarpenterString;
    /* 0x0290 */ Client::System::String::Utf8String MinerString;
    } _union_0x290;
    union {
    /* 0x02F8 */ Client::System::String::Utf8String BlacksmithString;
    /* 0x02F8 */ Client::System::String::Utf8String BotanistString;
    } _union_0x2F8;
    union {
    /* 0x0360 */ Client::System::String::Utf8String ArmorerString;
    /* 0x0360 */ Client::System::String::Utf8String FisherString;
    } _union_0x360;
    /* 0x03C8 */ Client::System::String::Utf8String GoldsmithString;
    /* 0x0430 */ Client::System::String::Utf8String LeatherworkerString;
    /* 0x0498 */ Client::System::String::Utf8String WeaverString;
    /* 0x0500 */ Client::System::String::Utf8String AlchemistString;
    /* 0x0568 */ Client::System::String::Utf8String CulinarianString;
    /* 0x05D0 */ Component::GUI::AtkComponentButton* JournalButton;
    /* 0x05D8 */ Component::GUI::AtkTextNode* AtkTextNode298;
    /* 0x05E0 */ Component::GUI::AtkComponentBase* AtkComponentBase290;
    /* 0x05E8 */ Component::GUI::AtkComponentBase* AtkComponentBase298;
    /*        */ byte _gap_0x5F0[0x1300];
};

struct Client::UI::AddonHudLayoutScreen /* Size=0x8A8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xA8];
    /* 0x2C8 */ Client::UI::AddonHudLayoutWindow* HudLayoutWindow;
    /*       */ byte _gap_0x2D0[0x270];
    /* 0x540 */ Component::GUI::AtkComponentNode* SelectedOverlayNode;
    /*       */ byte _gap_0x548[0x268];
    /* 0x7B0 */ Client::UI::MoveableAddonInfoStruct* SelectedAddon;
    /*       */ byte _gap_0x7B8[0xF0];
};

struct Client::UI::AddonHudLayoutWindow /* Size=0x268 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Component::GUI::AtkComponentButton* SaveButton;
    /*       */ byte _gap_0x240[0x28];
};

struct Client::UI::AddonImage /* Size=0x290 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x40];
    /* 0x260 */ Component::GUI::AtkResNode* ResNode1;
    /* 0x268 */ Component::GUI::AtkResNode* ResNode2;
    /* 0x270 */ Component::GUI::AtkImageNode* ImageNode;
    /*       */ byte _gap_0x278[0x4];
    /* 0x27C */ unsigned __int16 Width;
    /*       */ byte _gap_0x27E[0x2];
    /* 0x280 */ unsigned __int16 Height;
    /*       */ byte _gap_0x282[0x2];
    /*       */ byte _gap_0x284[0x4];
    /*       */ byte _gap_0x288[0x8];
};

struct Client::UI::AddonItemDonationInfo /* Size=0x30 */
{
    /* 0x00 */ void* UnkPtr1;
    /* 0x08 */ void* UnkPtr2;
    /* 0x10 */ void* UnkPtr3;
    /* 0x18 */ void* UnkPtr4;
    /* 0x20 */ void* UnkPtr5;
    /*      */ byte _gap_0x28[0x4];
    /* 0x2C */ __int32 UnkValue1;
};

struct Client::UI::AddonItemInspectionList /* Size=0x1230 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x1010];
};

struct Client::UI::AddonItemInspectionResult /* Size=0x2F8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xD8];
};

struct Client::UI::AddonItemSearchResult /* Size=0x3D0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentIcon* ItemIcon;
    /* 0x228 */ Component::GUI::AtkTextNode* ItemName;
    /*       */ byte _gap_0x230[0x18];
    /* 0x248 */ Component::GUI::AtkComponentButton* History;
    /* 0x250 */ Component::GUI::AtkComponentButton* AdvancedSearch;
    /*       */ byte _gap_0x258[0x8];
    /* 0x260 */ Component::GUI::AtkComponentList* Results;
    /* 0x268 */ Component::GUI::AtkTextNode* HitsMessage;
    /* 0x270 */ Component::GUI::AtkTextNode* ErrorMessage;
    /*       */ byte _gap_0x278[0x158];
};

struct Client::UI::AddonJournalDetail /* Size=0x2F8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x10];
    /* 0x230 */ Component::GUI::AtkComponentScrollBar* ScrollBarNode;
    /* 0x238 */ Component::GUI::AtkComponentGuildLeveCard* GuildLeveCardNode;
    /* 0x240 */ Component::GUI::AtkTextNode* DutyNameTextNode;
    /* 0x248 */ Component::GUI::AtkTextNode* DutyLevelTextNode;
    /* 0x250 */ Component::GUI::AtkImageNode* DutyCategoryImageNode;
    /* 0x258 */ Component::GUI::AtkImageNode* DutyCategoryBackgroundImageNode;
    /* 0x260 */ Component::GUI::AtkImageNode* GuildLeveCardBackgroundImageNode;
    /* 0x268 */ Component::GUI::AtkResNode* RewardsReceivedResNode;
    /* 0x270 */ Component::GUI::AtkTextNode* RewardsReceivedTextNode;
    /* 0x278 */ Component::GUI::AtkResNode* ButtonsResNode;
    /* 0x280 */ Component::GUI::AtkComponentButton* AcceptMapButton;
    /* 0x288 */ Component::GUI::AtkComponentButton* InitiateButton;
    /* 0x290 */ Component::GUI::AtkComponentButton* AbandonDeclineButton;
    /* 0x298 */ Component::GUI::AtkResNode* AtkResNode298;
    /* 0x2A0 */ Component::GUI::AtkImageNode* QuestImageNode;
    /* 0x2A8 */ Component::GUI::AtkTextNode* AtkTextNode2A8;
    /* 0x2B0 */ Component::GUI::AtkTextNode* RequirementsNotMetLabelTextNode;
    /* 0x2B8 */ Component::GUI::AtkTextNode* RequirementsNotMetTextNode;
    /* 0x2C0 */ Component::GUI::AtkTextNode* AtkTextNode2C0;
    /* 0x2C8 */ Component::GUI::AtkComponentButton* AtkComponentButton2C8;
    /* 0x2D0 */ Component::GUI::AtkComponentJournalCanvas* JournalCanvasNode;
    /*       */ byte _gap_0x2D8[0x20];
};

struct Client::UI::AddonJournalResult /* Size=0x288 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkImageNode* AtkImageNode220;
    /* 0x228 */ Component::GUI::AtkImageNode* AtkImageNode228;
    /* 0x230 */ Component::GUI::AtkImageNode* AtkImageNode230;
    /* 0x238 */ Component::GUI::AtkComponentGuildLeveCard* AtkComponentGuildLeveCard238;
    /* 0x240 */ Component::GUI::AtkComponentButton* CompleteButton;
    /* 0x248 */ Component::GUI::AtkComponentButton* DeclineButton;
    /* 0x250 */ Component::GUI::AtkTextNode* AtkTextNode250;
    /* 0x258 */ Component::GUI::AtkTextNode* AtkTextNode258;
    /* 0x260 */ Component::GUI::AtkImageNode* AtkImageNode260;
    /* 0x268 */ Component::GUI::AtkComponentJournalCanvas* AtkComponentJournalCanvas268;
    /*       */ byte _gap_0x270[0x18];
};

struct Client::UI::AddonLookingForGroupDetail /* Size=0x3E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x28];
    /* 0x248 */ Component::GUI::AtkComponentButton* JoinPartyButton;
    /* 0x250 */ byte JoinAllianceButtons[0x30];
    /* 0x280 */ Component::GUI::AtkComponentButton* SendTellButton;
    /* 0x288 */ Component::GUI::AtkComponentButton* AllianceBackButton;
    /* 0x290 */ Component::GUI::AtkComponentButton* BackButton;
    /*       */ byte _gap_0x298[0x20];
    /* 0x2B8 */ Component::GUI::AtkComponentButton* RelayPartyFinderInfoButton;
    /* 0x2C0 */ Component::GUI::AtkImageNode* LookingForGroupImageNode;
    /* 0x2C8 */ Component::GUI::AtkImageNode* CategoryImageNode;
    /* 0x2D0 */ Component::GUI::AtkTextNode* PartyLeaderTextNode;
    /* 0x2D8 */ Component::GUI::AtkTextNode* LocationTextNode;
    /* 0x2E0 */ Component::GUI::AtkTextNode* TimeRemainingTextNode;
    /* 0x2E8 */ Component::GUI::AtkTextNode* DutyNameTextNode;
    /* 0x2F0 */ Component::GUI::AtkTextNode* ItemLevelTextNode;
    /* 0x2F8 */ Component::GUI::AtkTextNode* StatusTextNode;
    /* 0x300 */ Component::GUI::AtkTextNode* DescriptionTextNode;
    /* 0x308 */ Client::System::String::Utf8String DescriptionString;
    /* 0x370 */ Client::System::String::Utf8String CategoriesString;
    /*       */ byte _gap_0x3D8[0x10];
};

struct Client::UI::AddonLotteryDaily::GameTileRow /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkComponentCheckBox* Col1;
    /* 0x08 */ Component::GUI::AtkComponentCheckBox* Col2;
    /* 0x10 */ Component::GUI::AtkComponentCheckBox* Col3;
};

struct Client::UI::AddonLotteryDaily::GameTileBoard /* Size=0x48 */
{
    /* 0x00 */ Client::UI::AddonLotteryDaily::GameTileRow Row1;
    /* 0x18 */ Client::UI::AddonLotteryDaily::GameTileRow Row2;
    /* 0x30 */ Client::UI::AddonLotteryDaily::GameTileRow Row3;
};

struct Client::UI::AddonLotteryDaily::LaneTileSelector /* Size=0x40 */
{
    /* 0x00 */ Component::GUI::AtkComponentRadioButton* MajorDiagonal;
    /* 0x08 */ Component::GUI::AtkComponentRadioButton* Col1;
    /* 0x10 */ Component::GUI::AtkComponentRadioButton* Col2;
    /* 0x18 */ Component::GUI::AtkComponentRadioButton* Col3;
    /* 0x20 */ Component::GUI::AtkComponentRadioButton* MinorDiagonal;
    /* 0x28 */ Component::GUI::AtkComponentRadioButton* Row1;
    /* 0x30 */ Component::GUI::AtkComponentRadioButton* Row2;
    /* 0x38 */ Component::GUI::AtkComponentRadioButton* Row3;
};

struct Client::UI::AddonLotteryDaily::GameNumberRow /* Size=0xC */
{
    /* 0x0 */ __int32 Col1;
    /* 0x4 */ __int32 Col2;
    /* 0x8 */ __int32 Col3;
};

struct Client::UI::AddonLotteryDaily::GameBoardNumbers /* Size=0x24 */
{
    /* 0x00 */ Client::UI::AddonLotteryDaily::GameNumberRow Row1;
    /* 0x0C */ Client::UI::AddonLotteryDaily::GameNumberRow Row2;
    /* 0x18 */ Client::UI::AddonLotteryDaily::GameNumberRow Row3;
};

struct Client::UI::AddonLotteryDaily /* Size=0x408 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::UI::AddonLotteryDaily::GameTileBoard GameBoard;
    /* 0x268 */ Client::UI::AddonLotteryDaily::LaneTileSelector LaneSelector;
    /* 0x2A8 */ Component::GUI::AtkComponentBase* UnkCompBase2A8;
    /* 0x2B0 */ Component::GUI::AtkComponentBase* UnkCompBase2B0;
    /* 0x2B8 */ Component::GUI::AtkComponentBase* UnkCompBase2B8;
    /* 0x2C0 */ Component::GUI::AtkComponentBase* UnkCompBase2C0;
    /* 0x2C8 */ Component::GUI::AtkComponentBase* UnkCompBase2C8;
    /* 0x2D0 */ Component::GUI::AtkComponentBase* UnkCompBase2D0;
    /* 0x2D8 */ Component::GUI::AtkComponentBase* UnkCompBase2D8;
    /* 0x2E0 */ Component::GUI::AtkComponentBase* UnkCompBase2E0;
    /* 0x2E8 */ Component::GUI::AtkComponentBase* UnkCompBase2E8;
    /* 0x2F0 */ Component::GUI::AtkResNode* UnkResNode2F0;
    /* 0x2F8 */ Component::GUI::AtkResNode* UnkResNode2F8;
    /* 0x300 */ Component::GUI::AtkResNode* UnkResNode300;
    /* 0x308 */ Component::GUI::AtkComponentBase* UnkCompBase308;
    /* 0x310 */ Component::GUI::AtkComponentBase* UnkCompBase310;
    /* 0x318 */ Component::GUI::AtkComponentBase* UnkCompBase318;
    /* 0x320 */ Component::GUI::AtkComponentButton* UnkCompButton320;
    /* 0x328 */ Component::GUI::AtkTextNode* UnkTextNode328;
    /* 0x330 */ Component::GUI::AtkComponentBase* UnkCompBase330;
    /* 0x338 */ Component::GUI::AtkComponentBase* UnkCompBase338;
    /* 0x340 */ Component::GUI::AtkComponentBase* UnkCompBase340;
    /* 0x348 */ Component::GUI::AtkComponentBase* UnkCompBase348;
    /* 0x350 */ Component::GUI::AtkComponentBase* UnkCompBase350;
    /* 0x358 */ Component::GUI::AtkComponentBase* UnkCompBase358;
    /* 0x360 */ Component::GUI::AtkComponentBase* UnkCompBase360;
    /* 0x368 */ Component::GUI::AtkComponentBase* UnkCompBase368;
    /* 0x370 */ Component::GUI::AtkComponentBase* UnkCompBase370;
    /* 0x378 */ Component::GUI::AtkComponentBase* UnkCompBase378;
    /* 0x380 */ Component::GUI::AtkComponentBase* UnkCompBase380;
    /* 0x388 */ Component::GUI::AtkComponentBase* UnkCompBase388;
    /* 0x390 */ Component::GUI::AtkComponentBase* UnkCompBase390;
    /* 0x398 */ Component::GUI::AtkComponentBase* UnkCompBase398;
    /* 0x3A0 */ Component::GUI::AtkComponentBase* UnkCompBase3A0;
    /* 0x3A8 */ Component::GUI::AtkComponentBase* UnkCompBase3A8;
    /* 0x3B0 */ Component::GUI::AtkComponentBase* UnkCompBase3B0;
    /* 0x3B8 */ Component::GUI::AtkComponentBase* UnkCompBase3B8;
    /* 0x3C0 */ Component::GUI::AtkComponentBase* UnkCompBase3C0;
    /* 0x3C8 */ Component::GUI::AtkImageNode* UnkImageNode3C8;
    /* 0x3D0 */ __int32 UnkNumber3D0;
    /* 0x3D4 */ __int32 UnkNumber3D4;
    /* 0x3D8 */ Client::UI::AddonLotteryDaily::GameBoardNumbers GameNumbers;
    /* 0x3FC */ __int32 UnkNumber3FC;
    /* 0x400 */ __int32 UnkNumber400;
    /* 0x404 */ __int32 UnkNumber404;
};

struct Client::UI::AddonMacro /* Size=0x30B0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x98];
    /* 0x02B8 */ byte DragDropComponent[0x320];
    /*        */ byte _gap_0x5D8[0x8];
    /* 0x05E0 */ __int32 DefaultIcon;
    /*        */ byte _gap_0x5E4[0x4];
    /*        */ byte _gap_0x5E8[0x4];
    /* 0x05EC */ __int32 MacroSetIcon[0x64];
    /*        */ byte _gap_0x77C[0x4];
    /* 0x0780 */ byte MacroName[0x28A0];
    /* 0x3020 */ bool MacroCreated[0x64];
    /*        */ byte _gap_0x3084[0x4];
    /*        */ byte _gap_0x3088[0x18];
    /*        */ byte _gap_0x30A0[0x4];
    /* 0x30A4 */ unsigned __int32 SelectedMacroIndex;
    /* 0x30A8 */ unsigned __int32 SelectedPage;
    /*        */ byte _gap_0x30AC[0x4];
};

struct Client::UI::AddonMaterializeDialog /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* Text;
    /* 0x228 */ Component::GUI::AtkComponentIcon* ItemIcon;
    /* 0x230 */ Component::GUI::AtkTextNode* ItemName;
    /* 0x238 */ Component::GUI::AtkComponentButton* YesButton;
    /* 0x240 */ Component::GUI::AtkComponentButton* NoButton;
};

struct Client::UI::AddonMateriaRetrieveDialog /* Size=0x220 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
};

struct Client::UI::AddonMobHunt /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* NextPageButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* PreviousPageButton;
    /* 0x230 */ Component::GUI::AtkComponentButton* OpenMapButton;
    /* 0x238 */ __int32 CurrentPage;
    /*       */ byte _gap_0x23C[0x4];
    /*       */ byte _gap_0x240[0x8];
};

struct Client::UI::AddonNamePlate::BakePlateRenderer /* Size=0x240 */
{
    /*       */ byte _gap_0x0[0x230];
    /* 0x230 */ byte DisableFixedFontResolution;
    /*       */ byte _gap_0x231;
    /*       */ byte _gap_0x232[0x2];
    /*       */ byte _gap_0x234[0x4];
    /*       */ byte _gap_0x238[0x8];
};

struct Client::UI::AddonNamePlate /* Size=0x470 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::UI::AddonNamePlate::BakePlateRenderer BakePlate;
    /* 0x460 */ Client::UI::AddonNamePlate::NamePlateObject* NamePlateObjectArray;
    /* 0x468 */ byte DoFullUpdate;
    /*       */ byte _gap_0x469;
    /* 0x46A */ unsigned __int16 AlternatePartId;
    /*       */ byte _gap_0x46C[0x4];
};

struct Client::UI::AddonNamePlate::BakeData /* Size=0xC */
{
    /* 0x0 */ __int16 U;
    /* 0x2 */ __int16 V;
    /* 0x4 */ __int16 Width;
    /* 0x6 */ __int16 Height;
    /*     */ byte _gap_0x8[0x2];
    /* 0xA */ byte Alpha;
    /* 0xB */ byte IsBaked;
};

struct Client::UI::AddonNamePlate::NamePlateObject /* Size=0x78 */
{
    /* 0x00 */ Client::UI::AddonNamePlate::BakeData BakeData;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ Component::GUI::AtkComponentNode* RootNode;
    /* 0x18 */ Component::GUI::AtkResNode* ResNode;
    /* 0x20 */ Component::GUI::AtkTextNode* NameText;
    /* 0x28 */ Component::GUI::AtkImageNode* IconImageNode;
    /* 0x30 */ Component::GUI::AtkImageNode* ImageNode2;
    /* 0x38 */ Component::GUI::AtkImageNode* ImageNode3;
    /* 0x40 */ Component::GUI::AtkImageNode* ImageNode4;
    /* 0x48 */ Component::GUI::AtkImageNode* ImageNode5;
    /* 0x50 */ Component::GUI::AtkCollisionNode* CollisionNode1;
    /* 0x58 */ Component::GUI::AtkCollisionNode* CollisionNode2;
    /* 0x60 */ __int32 Priority;
    /* 0x64 */ __int16 TextW;
    /* 0x66 */ __int16 TextH;
    /* 0x68 */ __int16 IconXAdjust;
    /* 0x6A */ __int16 IconYAdjust;
    /* 0x6C */ byte NameplateKind;
    /* 0x6D */ byte HasHPBar;
    /* 0x6E */ byte ClickThrough;
    /* 0x6F */ byte IsPvpEnemy;
    /* 0x70 */ byte NeedsToBeBaked;
    /*      */ byte _gap_0x71;
    /*      */ byte _gap_0x72[0x2];
    /*      */ byte _gap_0x74[0x4];
};

struct Client::UI::AddonNeedGreed /* Size=0x510 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ byte Items[0x280];
    /*       */ byte _gap_0x4A0[0x58];
    /*       */ byte _gap_0x4F8[0x4];
    /* 0x4FC */ __int32 NumItems;
    /*       */ byte _gap_0x500[0x8];
    /* 0x508 */ __int32 SelectedItemIndex;
    /*       */ byte _gap_0x50C[0x4];
};

struct Client::UI::AddonPartyList::PartyListMemberStruct::StatusIcons /* Size=0x50 */
{
    /* 0x00 */ Component::GUI::AtkComponentIconText* StatusIcon0;
    /* 0x08 */ Component::GUI::AtkComponentIconText* StatusIcon1;
    /* 0x10 */ Component::GUI::AtkComponentIconText* StatusIcon2;
    /* 0x18 */ Component::GUI::AtkComponentIconText* StatusIcon3;
    /* 0x20 */ Component::GUI::AtkComponentIconText* StatusIcon4;
    /* 0x28 */ Component::GUI::AtkComponentIconText* StatusIcon5;
    /* 0x30 */ Component::GUI::AtkComponentIconText* StatusIcon6;
    /* 0x38 */ Component::GUI::AtkComponentIconText* StatusIcon7;
    /* 0x40 */ Component::GUI::AtkComponentIconText* StatusIcon8;
    /* 0x48 */ Component::GUI::AtkComponentIconText* StatusIcon9;
};

struct Client::UI::AddonPartyList::PartyListMemberStruct /* Size=0xF8 */
{
    /* 0x00 */ Client::UI::AddonPartyList::PartyListMemberStruct::StatusIcons StatusIcon;
    /* 0x50 */ Component::GUI::AtkComponentBase* PartyMemberComponent;
    /* 0x58 */ Component::GUI::AtkTextNode* IconBottomLeftText;
    /* 0x60 */ Component::GUI::AtkResNode* NameAndBarsContainer;
    /* 0x68 */ Component::GUI::AtkTextNode* GroupSlotIndicator;
    /* 0x70 */ Component::GUI::AtkTextNode* Name;
    /* 0x78 */ Component::GUI::AtkTextNode* CastingActionName;
    /* 0x80 */ Component::GUI::AtkImageNode* CastingProgressBar;
    /* 0x88 */ Component::GUI::AtkImageNode* CastingProgressBarBackground;
    /* 0x90 */ Component::GUI::AtkResNode* EmnityBarContainer;
    /* 0x98 */ Component::GUI::AtkNineGridNode* EmnityBarFill;
    /* 0xA0 */ Component::GUI::AtkImageNode* ClassJobIcon;
    /* 0xA8 */ void* UnknownA8;
    /* 0xB0 */ Component::GUI::AtkImageNode* UnknownImageB0;
    /* 0xB8 */ Component::GUI::AtkComponentBase* HPGaugeComponent;
    /* 0xC0 */ Component::GUI::AtkComponentGaugeBar* HPGaugeBar;
    /* 0xC8 */ Component::GUI::AtkComponentGaugeBar* MPGaugeBar;
    /* 0xD0 */ Component::GUI::AtkResNode* TargetGlowContainer;
    /* 0xD8 */ Component::GUI::AtkNineGridNode* ClickFlash;
    /* 0xE0 */ Component::GUI::AtkNineGridNode* TargetGlow;
    /*      */ byte _gap_0xE8[0x8];
    /* 0xF0 */ byte EmnityByte;
    /*      */ byte _gap_0xF1;
    /*      */ byte _gap_0xF2[0x2];
    /*      */ byte _gap_0xF4[0x4];
};

struct Client::UI::AddonPartyList::PartyMembers /* Size=0x7C0 */
{
    /* 0x000 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember0;
    /* 0x0F8 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember1;
    /* 0x1F0 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember2;
    /* 0x2E8 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember3;
    /* 0x3E0 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember4;
    /* 0x4D8 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember5;
    /* 0x5D0 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember6;
    /* 0x6C8 */ Client::UI::AddonPartyList::PartyListMemberStruct PartyMember7;
};

struct Client::UI::AddonPartyList::TrustMembers /* Size=0x6C8 */
{
    /* 0x000 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust0;
    /* 0x0F8 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust1;
    /* 0x1F0 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust2;
    /* 0x2E8 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust3;
    /* 0x3E0 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust4;
    /* 0x4D8 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust5;
    /* 0x5D0 */ Client::UI::AddonPartyList::PartyListMemberStruct Trust6;
};

struct Client::UI::AddonPartyList /* Size=0x13E0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x0220 */ Client::UI::AddonPartyList::PartyMembers PartyMember;
    /* 0x09E0 */ Client::UI::AddonPartyList::TrustMembers TrustMember;
    /* 0x10A8 */ Client::UI::AddonPartyList::PartyListMemberStruct Chocobo;
    /* 0x11A0 */ Client::UI::AddonPartyList::PartyListMemberStruct Pet;
    /* 0x1298 */ unsigned __int32 PartyClassJobIconId[0x8];
    /* 0x12B8 */ unsigned __int32 TrustClassJobIconId[0x7];
    /* 0x12D4 */ unsigned __int32 ChocoboIconId;
    /* 0x12D8 */ unsigned __int32 PetIconId;
    /*        */ byte _gap_0x12DC[0x4];
    /*        */ byte _gap_0x12E0[0x80];
    /* 0x1360 */ __int16 Edited[0x11];
    /*        */ byte _gap_0x1382[0x2];
    /*        */ byte _gap_0x1384[0x4];
    /*        */ byte _gap_0x1388[0x8];
    /* 0x1390 */ Component::GUI::AtkNineGridNode* BackgroundNineGridNode;
    /* 0x1398 */ Component::GUI::AtkTextNode* PartyTypeTextNode;
    /* 0x13A0 */ Component::GUI::AtkResNode* LeaderMarkResNode;
    /* 0x13A8 */ Component::GUI::AtkResNode* MpBarSpecialResNode;
    /* 0x13B0 */ Component::GUI::AtkTextNode* MpBarSpecialTextNode;
    /* 0x13B8 */ __int32 MemberCount;
    /* 0x13BC */ __int32 TrustCount;
    /* 0x13C0 */ __int32 EnmityLeaderIndex;
    /* 0x13C4 */ __int32 HideWhenSolo;
    /* 0x13C8 */ __int32 HoveredIndex;
    /* 0x13CC */ __int32 TargetedIndex;
    /* 0x13D0 */ __int32 Unknown1410;
    /* 0x13D4 */ __int32 Unknown1414;
    /* 0x13D8 */ byte Unknown1418;
    /*        */ byte _gap_0x13D9;
    /* 0x13DA */ byte PetCount;
    /* 0x13DB */ byte ChocoboCount;
    /*        */ byte _gap_0x13DC[0x4];
};

struct Client::UI::AddonRaceChocoboResult /* Size=0x2C8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x48];
    /* 0x268 */ Component::GUI::AtkComponentButton* LeaveButton;
    /*       */ byte _gap_0x270[0x58];
};

struct Client::UI::AddonRaceChocoboResult::AddonRaceChocoboResultVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::AddonRaidFinder /* Size=0xEF0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x68];
    /* 0x288 */ Component::GUI::AtkComponentList* DutyList;
    /* 0x290 */ Component::GUI::AtkComponentNode* CategoryDescriptionComponent;
    /* 0x298 */ Component::GUI::AtkComponentScrollBar* CategoryDescriptionScrollBar;
    /* 0x2A0 */ Component::GUI::AtkTextNode* ItemLevelText;
    /* 0x2A8 */ Component::GUI::AtkComponentButton* UnselectButton;
    /* 0x2B0 */ Component::GUI::AtkComponentDropDownList* OrderByDropDownList;
    /* 0x2B8 */ Component::GUI::AtkComponentButton* DutyTypeButton;
    /*       */ byte _gap_0x2C0[0xB8];
    /* 0x378 */ Client::System::String::Utf8String RaidsTooltipString;
    /* 0x3E0 */ Client::System::String::Utf8String TrialsTooltipString;
    /* 0x448 */ Client::System::String::Utf8String UltimatesTooltipString;
    /*       */ byte _gap_0x4B0[0x20];
    /*       */ byte _gap_0x4D0[0x4];
    /* 0x4D4 */ __int32 HighlightedRow;
    /*       */ byte _gap_0x4D8[0x4];
    /* 0x4DC */ __int32 NumDisplayedEntries;
    /* 0x4E0 */ __int32 SelectedTab;
    /*       */ byte _gap_0x4E4[0x4];
    /* 0x4E8 */ byte EntryInfoArray[0xA00];
    /*       */ byte _gap_0xEE8[0x8];
};

struct Client::UI::AddonRecipeNote /* Size=0x22D0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x0220 */ Component::GUI::AtkTextNode* CurrentJobLevel;
    /* 0x0228 */ Component::GUI::AtkTextNode* CurrentJobName;
    /* 0x0230 */ Component::GUI::AtkTextNode* Unk230;
    /* 0x0238 */ Component::GUI::AtkImageNode* Unk238;
    /*        */ byte _gap_0x240[0x8];
    /* 0x0248 */ Component::GUI::AtkResNode* Unk248;
    /* 0x0250 */ Component::GUI::AtkResNode* Unk250;
    /* 0x0258 */ Component::GUI::AtkResNode* Unk258;
    /* 0x0260 */ Component::GUI::AtkComponentRadioButton* Unk260;
    /* 0x0268 */ Component::GUI::AtkComponentRadioButton* Unk268;
    /* 0x0270 */ Component::GUI::AtkComponentRadioButton* Unk270;
    /* 0x0278 */ Component::GUI::AtkComponentRadioButton* Unk278;
    /* 0x0280 */ Component::GUI::AtkComponentRadioButton* Unk280;
    /* 0x0288 */ Component::GUI::AtkComponentRadioButton* Unk288;
    /* 0x0290 */ Component::GUI::AtkComponentRadioButton* Unk290;
    /* 0x0298 */ Component::GUI::AtkComponentRadioButton* Unk298;
    /* 0x02A0 */ Component::GUI::AtkComponentRadioButton* Unk2A0;
    /*        */ byte _gap_0x2A8[0x28];
    /* 0x02D0 */ Component::GUI::AtkImageNode* Unk2D0;
    /* 0x02D8 */ Component::GUI::AtkImageNode* Unk2D8;
    /* 0x02E0 */ Component::GUI::AtkImageNode* Unk2E0;
    /* 0x02E8 */ Component::GUI::AtkImageNode* Unk2E8;
    /* 0x02F0 */ Component::GUI::AtkImageNode* Unk2F0;
    /* 0x02F8 */ Component::GUI::AtkImageNode* Unk2F8;
    /* 0x0300 */ Component::GUI::AtkImageNode* Unk300;
    /* 0x0308 */ Component::GUI::AtkImageNode* Unk308;
    /* 0x0310 */ Component::GUI::AtkImageNode* Unk310;
    /* 0x0318 */ Component::GUI::AtkComponentButton* TrialSynthesisButton;
    /* 0x0320 */ Component::GUI::AtkComponentButton* QuickSynthesisButton;
    /* 0x0328 */ Component::GUI::AtkComponentButton* SynthesizeButton;
    /* 0x0330 */ Component::GUI::AtkComponentButton* Unk330;
    /* 0x0338 */ Component::GUI::AtkComponentButton* Unk338;
    /* 0x0340 */ Component::GUI::AtkComponentButton* Unk340;
    /* 0x0348 */ Component::GUI::AtkComponentButton* Unk348;
    /* 0x0350 */ Component::GUI::AtkComponentButton* Unk350;
    /* 0x0358 */ Component::GUI::AtkResNode* Unk358;
    /* 0x0360 */ Component::GUI::AtkTextNode* PaginationText;
    /* 0x0368 */ Component::GUI::AtkComponentBase* Unk368;
    /* 0x0370 */ Component::GUI::AtkComponentBase* Unk370;
    /* 0x0378 */ Component::GUI::AtkComponentBase* Unk378;
    /* 0x0380 */ Component::GUI::AtkComponentBase* Unk380;
    /* 0x0388 */ Component::GUI::AtkComponentBase* Unk388;
    /* 0x0390 */ Component::GUI::AtkTextNode* CharacteristicsTextLine1;
    /* 0x0398 */ Component::GUI::AtkTextNode* CharacteristicsTextLine2;
    /* 0x03A0 */ Component::GUI::AtkTextNode* CharacteristicsTextLine3;
    /* 0x03A8 */ Component::GUI::AtkTextNode* CharacteristicsTextLine4;
    /* 0x03B0 */ Component::GUI::AtkTextNode* CharacteristicsTextLine5;
    /* 0x03B8 */ Component::GUI::AtkTextNode* Unk3B8;
    /* 0x03C0 */ Component::GUI::AtkResNode* Unk3C0;
    /* 0x03C8 */ Component::GUI::AtkTextNode* RecipeLevelLiteral;
    /* 0x03D0 */ Component::GUI::AtkComponentButton* Unk3D0;
    /* 0x03D8 */ Component::GUI::AtkResNode* Unk3D8;
    /* 0x03E0 */ Component::GUI::AtkComponentButton* Unk3E0;
    /* 0x03E8 */ Component::GUI::AtkResNode* Unk3E8;
    /* 0x03F0 */ Component::GUI::AtkResNode* Unk3F0;
    /* 0x03F8 */ void* Unk3F8;
    /* 0x0400 */ void* Unk400;
    /* 0x0408 */ void* Unk408;
    /* 0x0410 */ Client::UI::AddonRecipeNote* this410;
    /* 0x0418 */ void* Unk418;
    /* 0x0420 */ void* Unk420;
    /* 0x0428 */ void* Unk428;
    /* 0x0430 */ Client::UI::AddonRecipeNote* this430;
    /* 0x0438 */ void* Unk438;
    /* 0x0440 */ void* Unk440;
    /* 0x0448 */ void* Unk448;
    /* 0x0450 */ void* Unk450;
    /* 0x0458 */ void* Unk458;
    /* 0x0460 */ void* Unk460;
    /* 0x0468 */ void* Unk468;
    /* 0x0470 */ Component::GUI::AtkTextNode* SelectedRecipeName;
    /* 0x0478 */ Component::GUI::AtkTextNode* SelectedRecipeDurability;
    /* 0x0480 */ Component::GUI::AtkTextNode* SelectedRecipeDifficulty;
    /* 0x0488 */ Component::GUI::AtkTextNode* SelectedRecipeStartingQuality;
    /* 0x0490 */ Component::GUI::AtkTextNode* SelectedRecipeMaximumQuality;
    /* 0x0498 */ Component::GUI::AtkTextNode* SelectedRecipeHighestStartingQuality;
    /* 0x04A0 */ Component::GUI::AtkTextNode* BagLiteral;
    /* 0x04A8 */ Component::GUI::AtkTextNode* SelectedRecipeResultQuantityInInventoryNqAndHq;
    /* 0x04B0 */ Component::GUI::AtkTextNode* CraftableLiteral;
    /* 0x04B8 */ Component::GUI::AtkTextNode* SelectedRecipeQuantityCraftableFromMaterialsInInventory;
    /* 0x04C0 */ void* Unk4C0;
    /* 0x04C8 */ Component::GUI::AtkTextNode* ProgressCalculationSentence;
    /* 0x04D0 */ Component::GUI::AtkTextNode* QualityCalculationSentence;
    /* 0x04D8 */ void* Unk4D8;
    /* 0x04E0 */ void* Unk4E0;
    /* 0x04E8 */ Component::GUI::AtkTextNode* AetherCrystal1QuantityRequiredForCraft;
    /* 0x04F0 */ Component::GUI::AtkTextNode* AetherCrystal1QuantityInInventory;
    /* 0x04F8 */ void* Unk4F8;
    /* 0x0500 */ void* Unk500;
    /* 0x0508 */ Component::GUI::AtkTextNode* AetherCrystal2QuantityRequiredForCraft;
    /* 0x0510 */ Component::GUI::AtkTextNode* AetherCrystal2QuantityInInventory;
    /* 0x0518 */ void* Unk518;
    /* 0x0520 */ void* Unk520;
    /* 0x0528 */ void* Unk528;
    /* 0x0530 */ Component::GUI::AtkTextNode* Ingredient1Name;
    /* 0x0538 */ Component::GUI::AtkTextNode* Ingredient1QuantityRequiredForCraft;
    /* 0x0540 */ void* Unk540;
    /* 0x0548 */ void* Unk548;
    /* 0x0550 */ void* Unk550;
    /* 0x0558 */ Component::GUI::AtkTextNode* Ingredient1QuantityInInventoryNq;
    /* 0x0560 */ Component::GUI::AtkTextNode* Ingredient1QuantityInInventoryHq;
    /*        */ byte _gap_0x568[0x10];
    /* 0x0578 */ void* Unk578;
    /* 0x0580 */ void* Unk580;
    /* 0x0588 */ void* Unk588;
    /* 0x0590 */ void* Unk590;
    /* 0x0598 */ void* Unk598;
    /* 0x05A0 */ void* Unk5A0;
    /* 0x05A8 */ Component::GUI::AtkTextNode* Ingredient2Name;
    /* 0x05B0 */ Component::GUI::AtkTextNode* Ingredient2QuantityRequiredForCraft;
    /* 0x05B8 */ void* Unk5B8;
    /* 0x05C0 */ void* Unk5C0;
    /* 0x05C8 */ void* Unk5C8;
    /* 0x05D0 */ Component::GUI::AtkTextNode* Ingredient2QuantityInInventoryNq;
    /* 0x05D8 */ Component::GUI::AtkTextNode* Ingredient2QuantityInInventoryHq;
    /*        */ byte _gap_0x5E0[0x8];
    /* 0x05E8 */ void* Unk5E8;
    /* 0x05F0 */ void* Unk5F0;
    /* 0x05F8 */ void* Unk5F8;
    /* 0x0600 */ void* Unk600;
    /* 0x0608 */ void* Unk608;
    /* 0x0610 */ void* Unk610;
    /* 0x0618 */ void* Unk618;
    /* 0x0620 */ Component::GUI::AtkTextNode* Ingredient3Name;
    /* 0x0628 */ Component::GUI::AtkTextNode* Ingredient3QuantityRequiredForCraft;
    /* 0x0630 */ void* Unk630;
    /* 0x0638 */ void* Unk638;
    /* 0x0640 */ void* Unk640;
    /* 0x0648 */ Component::GUI::AtkTextNode* Ingredient3QuantityInInventoryNq;
    /* 0x0650 */ Component::GUI::AtkTextNode* Ingredient3QuantityInInventoryHq;
    /* 0x0658 */ void* Unk658;
    /* 0x0660 */ void* Unk660;
    /* 0x0668 */ void* Unk668;
    /* 0x0670 */ void* Unk670;
    /* 0x0678 */ void* Unk678;
    /* 0x0680 */ void* Unk680;
    /* 0x0688 */ void* Unk688;
    /* 0x0690 */ void* Unk690;
    /* 0x0698 */ Component::GUI::AtkTextNode* Ingredient4Name;
    /* 0x06A0 */ Component::GUI::AtkTextNode* Ingredient4QuantityRequiredForCraft;
    /* 0x06A8 */ void* Unk6A8;
    /* 0x06B0 */ void* Unk6B0;
    /*        */ byte _gap_0x6B8[0x8];
    /* 0x06C0 */ Component::GUI::AtkTextNode* Ingredient4QuantityInInventoryNq;
    /* 0x06C8 */ Component::GUI::AtkTextNode* Ingredient4QuantityInInventoryHq;
    /* 0x06D0 */ void* Unk6D0;
    /* 0x06D8 */ void* Unk6D8;
    /* 0x06E0 */ void* Unk6E0;
    /* 0x06E8 */ void* Unk6E8;
    /* 0x06F0 */ void* Unk6F0;
    /* 0x06F8 */ void* Unk6F8;
    /* 0x0700 */ void* Unk700;
    /* 0x0708 */ void* Unk708;
    /* 0x0710 */ Component::GUI::AtkTextNode* Ingredient5Name;
    /* 0x0718 */ Component::GUI::AtkTextNode* Ingredient5QuantityRequiredForCraft;
    /* 0x0720 */ void* Unk720;
    /*        */ byte _gap_0x728[0x10];
    /* 0x0738 */ Component::GUI::AtkTextNode* Ingredient5QuantityInInventoryNq;
    /* 0x0740 */ Component::GUI::AtkTextNode* Ingredient5QuantityInInventoryHq;
    /* 0x0748 */ void* Unk748;
    /* 0x0750 */ void* Unk750;
    /* 0x0758 */ void* Unk758;
    /* 0x0760 */ void* Unk760;
    /* 0x0768 */ void* Unk768;
    /* 0x0770 */ void* Unk770;
    /* 0x0778 */ void* Unk778;
    /* 0x0780 */ void* Unk780;
    /* 0x0788 */ Component::GUI::AtkTextNode* Ingredient6Name;
    /* 0x0790 */ Component::GUI::AtkTextNode* Ingredient6QuantityRequiredForCraft;
    /*        */ byte _gap_0x798[0x10];
    /* 0x07A8 */ void* Unk7A8;
    /* 0x07B0 */ Component::GUI::AtkTextNode* Ingredient6QuantityInInventoryNq;
    /* 0x07B8 */ Component::GUI::AtkTextNode* Ingredient6QuantityInInventoryHq;
    /*        */ byte _gap_0x7C0[0x40];
    /* 0x0800 */ Client::UI::AddonRecipeNote* this800;
    /* 0x0808 */ Component::GUI::AtkStage* Unk808;
    /* 0x0810 */ Component::GUI::AtkComponentTextInput* Unk810;
    /* 0x0818 */ Client::UI::AddonRecipeNote* this818;
    /*        */ byte _gap_0x820[0x330];
    /* 0x0B50 */ char* UnkB50;
    /*        */ byte _gap_0xB58[0x8];
    /* 0x0B60 */ char* UnkB60;
    /*        */ byte _gap_0xB68[0x8];
    /* 0x0B70 */ char* UnkB70;
    /*        */ byte _gap_0xB78[0x8];
    /* 0x0B80 */ char* UnkB80;
    /*        */ byte _gap_0xB88[0x8];
    /* 0x0B90 */ char* UnkB90;
    /*        */ byte _gap_0xB98[0x8];
    /* 0x0BA0 */ char* UnkBA0;
    /*        */ byte _gap_0xBA8[0x8];
    /* 0x0BB0 */ char* UnkBB0;
    /*        */ byte _gap_0xBB8[0x8];
    /* 0x0BC0 */ char* UnkBC0;
    /*        */ byte _gap_0xBC8[0x8];
    /* 0x0BD0 */ char* UnkBD0;
    /*        */ byte _gap_0xBD8[0x8];
    /* 0x0BE0 */ char* UnkBE0;
    /*        */ byte _gap_0xBE8[0x8];
    /* 0x0BF0 */ char* UnkBF0;
    /*        */ byte _gap_0xBF8[0x8];
    /* 0x0C00 */ char* UnkC00;
    /*        */ byte _gap_0xC08[0x8];
    /* 0x0C10 */ char* UnkC10;
    /*        */ byte _gap_0xC18[0x1520];
    /* 0x2138 */ char* Unk2138;
    /* 0x2140 */ char* Unk2140;
    /* 0x2148 */ char* Unk2148;
    /* 0x2150 */ char* Unk2150;
    /* 0x2158 */ char* Unk2158;
    /* 0x2160 */ char* Unk2160;
    /* 0x2168 */ char* Unk2168;
    /* 0x2170 */ char* Unk2170;
    /* 0x2178 */ char* Unk2178;
    /*        */ byte _gap_0x2180[0x150];
};

struct Client::UI::AddonReconstructionBox /* Size=0x440 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x38];
    /* 0x258 */ byte DonationInfoArray[0x1E0];
    /* 0x438 */ __int32 ItemHovered;
    /*       */ byte _gap_0x43C[0x4];
};

struct Client::UI::AddonRelicNoteBook::TargetNode /* Size=0x28 */
{
    /* 0x00 */ Component::GUI::AtkComponentCheckBox* CheckBox;
    /* 0x08 */ Component::GUI::AtkResNode* ResNode;
    /* 0x10 */ Component::GUI::AtkImageNode* ImageNode;
    /* 0x18 */ Component::GUI::AtkTextNode* CounterTextNode;
    /*      */ byte _gap_0x20[0x8];
};

struct Client::UI::AddonRelicNoteBook /* Size=0xAA8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkImageNode* CornerImage;
    /* 0x228 */ Component::GUI::AtkComponentBase* WeaponImageContainer;
    /* 0x230 */ Component::GUI::AtkImageNode* WeaponImage;
    /* 0x238 */ Component::GUI::AtkTextNode* WeaponText;
    /* 0x240 */ Component::GUI::AtkTextNode* RewardText;
    /* 0x248 */ Component::GUI::AtkTextNode* RewardTextAmount;
    /* 0x250 */ Component::GUI::AtkComponentList* CategoryList;
    /* 0x258 */ Component::GUI::AtkResNode* EnemyContainer;
    /* 0x260 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy0;
    /* 0x288 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy1;
    /* 0x2B0 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy2;
    /* 0x2D8 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy3;
    /* 0x300 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy4;
    /* 0x328 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy5;
    /* 0x350 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy6;
    /* 0x378 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy7;
    /* 0x3A0 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy8;
    /* 0x3C8 */ Client::UI::AddonRelicNoteBook::TargetNode Enemy9;
    /* 0x3F0 */ Component::GUI::AtkResNode* DungeonContainer;
    /* 0x3F8 */ Client::UI::AddonRelicNoteBook::TargetNode Dungeon0;
    /* 0x420 */ Client::UI::AddonRelicNoteBook::TargetNode Dungeon1;
    /* 0x448 */ Client::UI::AddonRelicNoteBook::TargetNode Dungeon2;
    /*       */ byte _gap_0x470[0x118];
    /* 0x588 */ Component::GUI::AtkResNode* FateContainer;
    /* 0x590 */ Client::UI::AddonRelicNoteBook::TargetNode Fate0;
    /* 0x5B8 */ Client::UI::AddonRelicNoteBook::TargetNode Fate1;
    /* 0x5E0 */ Client::UI::AddonRelicNoteBook::TargetNode Fate2;
    /*       */ byte _gap_0x608[0x118];
    /* 0x720 */ Component::GUI::AtkResNode* LeveContainer;
    /* 0x728 */ Client::UI::AddonRelicNoteBook::TargetNode Leve0;
    /* 0x750 */ Client::UI::AddonRelicNoteBook::TargetNode Leve1;
    /* 0x778 */ Client::UI::AddonRelicNoteBook::TargetNode Leve2;
    /*       */ byte _gap_0x7A0[0x118];
    /* 0x8B8 */ Component::GUI::AtkTextNode* TargetText;
    /* 0x8C0 */ Component::GUI::AtkTextNode* TargetLocationText;
    /*       */ byte _gap_0x8C8[0x1E0];
};

struct Client::UI::AddonRepair /* Size=0xF7A0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x8];
    /* 0x0228 */ Component::GUI::AtkTextNode* UnusedText1;
    /* 0x0230 */ Component::GUI::AtkTextNode* JobLevel;
    /* 0x0238 */ Component::GUI::AtkImageNode* JobIcon;
    /* 0x0240 */ Component::GUI::AtkTextNode* JobName;
    /* 0x0248 */ Component::GUI::AtkTextNode* UnusedText2;
    /* 0x0250 */ Component::GUI::AtkComponentDropDownList* Dropdown;
    /* 0x0258 */ Component::GUI::AtkComponentButton* RepairAllButton;
    /* 0x0260 */ Component::GUI::AtkResNode* HeaderContainer;
    /* 0x0268 */ Component::GUI::AtkTextNode* UnusedText3;
    /* 0x0270 */ Component::GUI::AtkTextNode* NothingToRepairText;
    /* 0x0278 */ Component::GUI::AtkComponentList* ItemList;
    /*        */ byte _gap_0x280[0xF520];
};

struct Client::UI::AddonRequest /* Size=0x2E0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkCollisionNode* AtkCollisionNode220;
    /* 0x228 */ Component::GUI::AtkComponentIcon* AtkComponentIcon228;
    /* 0x230 */ Component::GUI::AtkComponentIcon* AtkComponentIcon230;
    /* 0x238 */ Component::GUI::AtkComponentIcon* AtkComponentIcon238;
    /* 0x240 */ Component::GUI::AtkComponentIcon* AtkComponentIcon240;
    /* 0x248 */ Component::GUI::AtkComponentIcon* AtkComponentIcon248;
    /* 0x250 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop250;
    /* 0x258 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop258;
    /* 0x260 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop260;
    /* 0x268 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop268;
    /* 0x270 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop270;
    /* 0x278 */ Component::GUI::AtkComponentButton* HandOverButton;
    /* 0x280 */ Component::GUI::AtkComponentButton* CancelButton;
    /* 0x288 */ Component::GUI::AtkComponentIcon* AtkComponentIcon288;
    /* 0x290 */ Component::GUI::AtkComponentIcon* AtkComponentIcon290;
    /* 0x298 */ Component::GUI::AtkComponentIcon* AtkComponentIcon298;
    /* 0x2A0 */ Component::GUI::AtkComponentIcon* AtkComponentIcon2A0;
    /* 0x2A8 */ Component::GUI::AtkComponentIcon* AtkComponentIcon2A8;
    /* 0x2B0 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop2B0;
    /* 0x2B8 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop2B8;
    /* 0x2C0 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop2C0;
    /* 0x2C8 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop2C8;
    /* 0x2D0 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop2D0;
    /* 0x2D8 */ __int32 EntryCount;
    /*       */ byte _gap_0x2DC[0x4];
};

struct Client::UI::AddonRetainerItemTransferList /* Size=0x2C8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* SomeText;
    /* 0x228 */ Component::GUI::AtkComponentButton* ConfirmButton;
    /* 0x230 */ Component::GUI::AtkComponentButton* CancelButton;
    /* 0x238 */ byte ListItems[0xA];
    /*       */ byte _gap_0x242[0x2];
    /*       */ byte _gap_0x244[0x4];
    /*       */ byte _gap_0x248[0x80];
};

struct Client::UI::AddonRetainerItemTransferList::AddonRetainerItemTransferListVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::AddonRetainerItemTransferProgress /* Size=0x240 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* EntrustAllItemsButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* CloseWindowButton;
    /* 0x230 */ Component::GUI::AtkResNode* ProgressBar;
    /* 0x238 */ unsigned __int16 Progress;
    /*       */ byte _gap_0x23A[0x2];
    /*       */ byte _gap_0x23C[0x4];
};

struct Client::UI::AddonRetainerItemTransferProgress::AddonRetainerItemTransferProgressVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::AddonRetainerList /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::UI::AddonRetainerList::AddonRetainerListVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonRetainerSell /* Size=0x278 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* Confirm;
    /* 0x228 */ Component::GUI::AtkComponentButton* Cancel;
    /* 0x230 */ Component::GUI::AtkComponentButton* ComparePrices;
    /* 0x238 */ Component::GUI::AtkComponentIcon* ItemIcon;
    /*       */ byte _gap_0x240[0x8];
    /* 0x248 */ Component::GUI::AtkComponentNumericInput* Quantity;
    /* 0x250 */ Component::GUI::AtkComponentNumericInput* AskingPrice;
    /* 0x258 */ Component::GUI::AtkTextNode* ItemName;
    /* 0x260 */ Component::GUI::AtkTextNode* Total;
    /* 0x268 */ Component::GUI::AtkTextNode* Tax;
    /*       */ byte _gap_0x270[0x8];
};

struct Client::UI::AddonRetainerTaskAsk /* Size=0x2B8 */
{
    /*       */ byte _gap_0x0[0x2A8];
    /* 0x2A8 */ Component::GUI::AtkComponentButton* AssignButton;
    /* 0x2B0 */ Component::GUI::AtkComponentButton* ReturnButton;
};

struct Client::UI::AddonRetainerTaskAsk::AddonRetainerTaskAskVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonRetainerTaskList /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::UI::AddonRetainerTaskList::AddonRetainerTaskListVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonRetainerTaskResult /* Size=0x258 */
{
    /*       */ byte _gap_0x0[0x240];
    /* 0x240 */ Component::GUI::AtkComponentButton* ReassignButton;
    /* 0x248 */ Component::GUI::AtkComponentButton* ConfirmButton;
    /*       */ byte _gap_0x250[0x8];
};

struct Client::UI::AddonRetainerTaskResult::AddonRetainerTaskResultVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonSalvageDialog /* Size=0x250 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x8];
    /* 0x228 */ Component::GUI::AtkComponentButton* DesynthesizeButton;
    /* 0x230 */ Component::GUI::AtkComponentCheckBox* CheckBox;
    /*       */ byte _gap_0x238[0x8];
    /* 0x240 */ Component::GUI::AtkComponentCheckBox* CheckBox2;
    /* 0x248 */ bool BulkDesynthEnabled;
    /*       */ byte _gap_0x249;
    /*       */ byte _gap_0x24A[0x2];
    /*       */ byte _gap_0x24C[0x4];
};

struct Client::UI::AddonSalvageItemSelector /* Size=0x1CB0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x48];
    /* 0x0268 */ byte Items[0x1A40];
    /* 0x1CA8 */ Client::UI::Agent::AgentSalvage::SalvageItemCategory SelectedCategory;
    /* 0x1CAC */ unsigned __int32 ItemCount;
};

struct Client::UI::AddonSalvageItemSelector::SalvageItem /* Size=0x30 */
{
    /* 0x00 */ Client::Game::InventoryType Inventory;
    /* 0x04 */ __int32 Slot;
    /* 0x08 */ unsigned __int32 IconId;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ byte* NamePtr;
    /* 0x18 */ unsigned __int32 Quantity;
    /* 0x1C */ unsigned __int32 JobIconID;
    /* 0x20 */ byte* JobNamePtr;
    /* 0x28 */ byte Unknown28;
    /*      */ byte _gap_0x29;
    /*      */ byte _gap_0x2A[0x2];
    /*      */ byte _gap_0x2C[0x4];
};

struct Client::UI::AddonSatisfactionSupply /* Size=0x670 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x4];
    /* 0x224 */ __int32 HoveredElementIndex;
    /*       */ byte _gap_0x228[0xE0];
    /* 0x308 */ byte DeliveryInfo[0x138];
    /*       */ byte _gap_0x440[0x230];
};

struct Client::UI::PopupMenu /* Size=0x68 */
{
    /* 0x00 */ Component::GUI::AtkEventListener AtkEventListener;
    /* 0x08 */ Component::GUI::AtkStage* AtkStage;
    /* 0x10 */ byte** EntryNames;
    /*      */ byte _gap_0x18[0x18];
    /* 0x30 */ Component::GUI::AtkComponentWindow* Window;
    /* 0x38 */ Component::GUI::AtkComponentList* List;
    /* 0x40 */ Component::GUI::AtkUnitBase* Owner;
    /*      */ byte _gap_0x48[0x4];
    /* 0x4C */ __int32 EntryCount;
    /*      */ byte _gap_0x50[0x18];
};

struct Client::UI::AddonSelectIconString::PopupMenuDerive /* Size=0x68 */
{
    /* 0x00 */ Client::UI::PopupMenu PopupMenu;
};

struct Client::UI::AddonSelectIconString /* Size=0x2A8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Client::UI::AddonSelectIconString::PopupMenuDerive PopupMenu;
    /*       */ byte _gap_0x2A0[0x8];
};

struct Client::UI::AddonSelectOk /* Size=0x2A8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* PromptText;
    /* 0x228 */ Component::GUI::AtkComponentButton* OkButton;
    /*       */ byte _gap_0x230[0x78];
};

struct Client::UI::AddonSelectString::PopupMenuDerive /* Size=0x70 */
{
    /* 0x00 */ Client::UI::PopupMenu PopupMenu;
    /*      */ byte _gap_0x68[0x8];
};

struct Client::UI::AddonSelectString /* Size=0x2A8 */
{
    /*       */ byte _gap_0x0[0x220];
    /* 0x220 */ Client::UI::AddonSelectString::PopupMenuDerive PopupMenu;
    /*       */ byte _gap_0x290[0x18];
};

struct Client::UI::AddonSelectString::AddonSelectStringVTable /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x178];
    /* 0x178 */ __int64 OnSetup;
};

struct Client::UI::AddonSelectYesno /* Size=0x2D0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* PromptText;
    /* 0x228 */ Component::GUI::AtkComponentButton* YesButton;
    /* 0x230 */ Component::GUI::AtkComponentButton* NoButton;
    /* 0x238 */ Component::GUI::AtkComponentButton* AtkComponentButton238;
    /* 0x240 */ Component::GUI::AtkResNode* AtkResNode240;
    /* 0x248 */ Component::GUI::AtkResNode* AtkResNode248;
    /*       */ byte _gap_0x250[0x8];
    /* 0x258 */ Component::GUI::AtkResNode* AtkResNode258;
    /* 0x260 */ Component::GUI::AtkComponentButton* AtkComponentButton260;
    /* 0x268 */ Component::GUI::AtkComponentButton* AtkComponentButton268;
    /* 0x270 */ Component::GUI::AtkComponentButton* AtkComponentButton270;
    /* 0x278 */ Component::GUI::AtkComponentHoldButton* AtkComponentHoldButton278;
    /* 0x280 */ Component::GUI::AtkComponentHoldButton* AtkComponentHoldButton280;
    /* 0x288 */ Component::GUI::AtkComponentHoldButton* AtkComponentHoldButton288;
    /* 0x290 */ Component::GUI::AtkComponentCheckBox* ConfirmCheckBox;
    /* 0x298 */ Component::GUI::AtkTextNode* AtkTextNode298;
    /* 0x2A0 */ Component::GUI::AtkComponentBase* AtkComponentBase2A0;
    /*       */ byte _gap_0x2A8[0x28];
};

struct Client::UI::AddonShopCardDialog /* Size=0x230 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentNumericInput* CardQuantityInput;
    /*       */ byte _gap_0x228[0x8];
};

struct Client::UI::AddonSocial /* Size=0x320 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x70];
    /* 0x290 */ Component::GUI::AtkComponentRadioButton* PartyMembersRadioButton;
    /* 0x298 */ Component::GUI::AtkComponentRadioButton* FriendListRadioButton;
    /* 0x2A0 */ Component::GUI::AtkComponentRadioButton* BlacklistRadioButton;
    /* 0x2A8 */ Component::GUI::AtkComponentRadioButton* PlayerSearchRadioButton;
    /* 0x2B0 */ Client::System::String::Utf8String PlayerSearchString;
    /*       */ byte _gap_0x318[0x8];
};

struct Client::UI::AddonSynthesis::CraftEffect /* Size=0x20 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* Container;
    /* 0x08 */ Component::GUI::AtkImageNode* Image;
    /* 0x10 */ Component::GUI::AtkTextNode* StepsRemaining;
    /* 0x18 */ Component::GUI::AtkTextNode* Name;
};

struct Client::UI::AddonSynthesis /* Size=0x8A8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Component::GUI::AtkComponentButton* QuitButton;
    /* 0x240 */ Component::GUI::AtkComponentButton* CalculationsButton;
    /* 0x248 */ Component::GUI::AtkComponentIcon* ItemIcon;
    /*       */ byte _gap_0x250[0x8];
    /* 0x258 */ Component::GUI::AtkTextNode* ItemName;
    /* 0x260 */ Component::GUI::AtkResNode* DiamondImageNodeContainer;
    /*       */ byte _gap_0x268[0x8];
    /* 0x270 */ Component::GUI::AtkTextNode* Condition;
    /*       */ byte _gap_0x278[0x10];
    /* 0x288 */ Component::GUI::AtkTextNode* CurrentQuality;
    /* 0x290 */ Component::GUI::AtkTextNode* MaxQuality;
    /*       */ byte _gap_0x298[0x20];
    /* 0x2B8 */ Component::GUI::AtkTextNode* HQLiteral;
    /* 0x2C0 */ Component::GUI::AtkTextNode* HQPercentage;
    /* 0x2C8 */ Component::GUI::AtkTextNode* StepNumber;
    /*       */ byte _gap_0x2D0[0x10];
    /* 0x2E0 */ Component::GUI::AtkTextNode* CurrentProgress;
    /* 0x2E8 */ Component::GUI::AtkTextNode* MaxProgress;
    /*       */ byte _gap_0x2F0[0x8];
    /* 0x2F8 */ Component::GUI::AtkTextNode* CurrentDurability;
    /* 0x300 */ Component::GUI::AtkTextNode* StartingDurability;
    /*       */ byte _gap_0x308[0x68];
    /* 0x370 */ Component::GUI::AtkTextNode* CollectabilityLow;
    /* 0x378 */ Component::GUI::AtkTextNode* CollectabilityMid;
    /* 0x380 */ Component::GUI::AtkTextNode* CollectabilityHigh;
    /* 0x388 */ Component::GUI::AtkComponentCheckBox* ToggleCraftEffectPane;
    /*       */ byte _gap_0x390[0x18];
    /* 0x3A8 */ Component::GUI::AtkTextNode* CraftEffectOverflow;
    /* 0x3B0 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect1;
    /* 0x3D0 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect2;
    /* 0x3F0 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect3;
    /* 0x410 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect4;
    /* 0x430 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect5;
    /* 0x450 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect6;
    /* 0x470 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect7;
    /* 0x490 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect8;
    /* 0x4B0 */ Client::UI::AddonSynthesis::CraftEffect CraftEffect9;
    /*       */ byte _gap_0x4D0[0x20];
    /* 0x4F0 */ Client::System::String::Utf8String CraftEffect1HoverText;
    /* 0x558 */ Client::System::String::Utf8String CraftEffect2HoverText;
    /* 0x5C0 */ Client::System::String::Utf8String CraftEffect3HoverText;
    /* 0x628 */ Client::System::String::Utf8String CraftEffect4HoverText;
    /* 0x690 */ Client::System::String::Utf8String CraftEffect5HoverText;
    /* 0x6F8 */ Client::System::String::Utf8String CraftEffect6HoverText;
    /* 0x760 */ Client::System::String::Utf8String CraftEffect7HoverText;
    /* 0x7C8 */ Client::System::String::Utf8String CraftEffect8HoverText;
    /* 0x830 */ Client::System::String::Utf8String CraftEffect9HoverText;
    /*       */ byte _gap_0x898[0x10];
};

struct Component::GUI::AtkEventTarget /* Size=0x8 */
{
    union {
    /* 0x0 */ void* vtbl;
    /* 0x0 */ void** vfunc;
    } _union_0x0;
};

struct Component::GUI::AtkEventListenerUnk1 /* Size=0x60 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ void** vfunc;
    } _union_0x0;
    /* 0x08 */ void* Unk;
    /*      */ byte _gap_0x10[0x10];
    /* 0x20 */ Component::GUI::AtkUnitBase* AtkUnitBase;
    /* 0x28 */ Component::GUI::AtkStage* AtkStage;
    /*      */ byte _gap_0x30[0x30];
};

struct Client::UI::AddonTalk /* Size=0xE80 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* AtkTextNode220;
    /* 0x228 */ Component::GUI::AtkTextNode* AtkTextNode228;
    /* 0x230 */ Component::GUI::AtkResNode* AtkResNode230;
    /* 0x238 */ Component::GUI::AtkTextNode* AtkTextNode238;
    /* 0x240 */ Component::GUI::AtkTextNode* AtkTextNode240;
    /* 0x248 */ Component::GUI::AtkTextNode* AtkTextNode248;
    /*       */ byte _gap_0x250[0x18];
    /* 0x268 */ Client::System::String::Utf8String String268;
    /* 0x2D0 */ Client::System::String::Utf8String String2D0;
    /* 0x338 */ Client::System::String::Utf8String String338;
    /*       */ byte _gap_0x3A0[0x68];
    /* 0x408 */ Client::System::String::Utf8String String408;
    /* 0x470 */ Client::System::String::Utf8String String470;
    /* 0x4D8 */ Client::System::String::Utf8String String4D8;
    /* 0x540 */ Client::System::String::Utf8String String540;
    /*       */ byte _gap_0x5A8[0x870];
    /* 0xE18 */ Component::GUI::AtkEventTarget AtkEventTarget;
    /* 0xE20 */ Component::GUI::AtkEventListenerUnk1 AtkEventListenerUnk;
};

struct Client::UI::AddonTeleport /* Size=0x2D8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentRadioButton* TabHeaderAll;
    /* 0x228 */ Component::GUI::AtkComponentRadioButton* TabHeaderLaNoscea;
    /* 0x230 */ Component::GUI::AtkComponentRadioButton* TabHeaderBlackShroud;
    /* 0x238 */ Component::GUI::AtkComponentRadioButton* TabHeaderThanalan;
    /* 0x240 */ Component::GUI::AtkComponentRadioButton* TabHeaderIshgard;
    /* 0x248 */ Component::GUI::AtkComponentRadioButton* TabHeaderGyrAbania;
    /* 0x250 */ Component::GUI::AtkComponentRadioButton* TabHeaderFarEast;
    /* 0x258 */ Component::GUI::AtkComponentRadioButton* TabHeaderIlsabard;
    /* 0x260 */ Component::GUI::AtkComponentRadioButton* TabHeaderNorvandt;
    /* 0x268 */ Component::GUI::AtkComponentRadioButton* TabHeaderOther;
    /* 0x270 */ Component::GUI::AtkComponentRadioButton* TabHeaderHistory;
    /* 0x278 */ Component::GUI::AtkComponentRadioButton* TabHeaderFavourite;
    /* 0x280 */ Component::GUI::AtkTextNode* GilCountText;
    /* 0x288 */ Component::GUI::AtkComponentTreeList* TeleportTreeList;
    /* 0x290 */ Component::GUI::AtkComponentListItemRenderer* TeleportTreeListFirstHeader;
    /* 0x298 */ Component::GUI::AtkComponentListItemRenderer* TeleportTreeListFirstItem;
    /* 0x2A0 */ void* UnknownVtbl;
    /* 0x2A8 */ Client::UI::AddonTeleport* Addon;
    /* 0x2B0 */ __int64 UnknownFunction;
    /* 0x2B8 */ Component::GUI::AtkComponentButton* SettingsButton;
    /* 0x2C0 */ Component::GUI::AtkTextNode* AetheryteTicketsText;
    /* 0x2C8 */ unsigned __int32 SelectedTab;
    /* 0x2CC */ unsigned __int32 SelectedTabItemCount;
    /* 0x2D0 */ unsigned __int32 ListTotalCount;
    /* 0x2D4 */ unsigned __int32 Unknown2D4;
};

struct Client::UI::AddonWaymarkInfo /* Size=0x18 */
{
    /* 0x00 */ __int32 IconId;
    /* 0x04 */ __int32 Active;
    /* 0x08 */ byte* TooltipString;
    /* 0x10 */ __int32 Slot;
    /*      */ byte _gap_0x14[0x4];
};

struct Client::UI::DutySlot /* Size=0x168 */
{
    /* 0x000 */ void** vtbl;
    /* 0x008 */ Client::UI::AddonWeeklyBingo* addon;
    /* 0x010 */ __int32 index;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x120];
    /* 0x138 */ Component::GUI::AtkComponentButton* DutyButton;
    /* 0x140 */ Component::GUI::AtkImageNode* DutyImage;
    /* 0x148 */ Component::GUI::AtkResNode* DutyResNode;
    /* 0x150 */ Component::GUI::AtkResNode* ResNode1;
    /* 0x158 */ Component::GUI::AtkTextNode* TextNode;
    /* 0x160 */ Component::GUI::AtkResNode* ResNode2;
};

struct Client::UI::DutySlotList /* Size=0x16C8 */
{
    /* 0x0000 */ void** vtbl;
    /* 0x0008 */ void* addon;
    /*        */ byte _gap_0x10[0x10];
    /*        */ byte _gap_0x20[0x4];
    /* 0x0024 */ unsigned __int32 NumSecondChances;
    /* 0x0028 */ Client::UI::DutySlot DutySlot1;
    /* 0x0190 */ Client::UI::DutySlot DutySlot2;
    /* 0x02F8 */ Client::UI::DutySlot DutySlot3;
    /* 0x0460 */ Client::UI::DutySlot DutySlot4;
    /* 0x05C8 */ Client::UI::DutySlot DutySlot5;
    /* 0x0730 */ Client::UI::DutySlot DutySlot6;
    /* 0x0898 */ Client::UI::DutySlot DutySlot7;
    /* 0x0A00 */ Client::UI::DutySlot DutySlot8;
    /* 0x0B68 */ Client::UI::DutySlot DutySlot9;
    /* 0x0CD0 */ Client::UI::DutySlot DutySlot10;
    /* 0x0E38 */ Client::UI::DutySlot DutySlot11;
    /* 0x0FA0 */ Client::UI::DutySlot DutySlot12;
    /* 0x1108 */ Client::UI::DutySlot DutySlot13;
    /* 0x1270 */ Client::UI::DutySlot DutySlot14;
    /* 0x13D8 */ Client::UI::DutySlot DutySlot15;
    /* 0x1540 */ Client::UI::DutySlot DutySlot16;
    /*        */ byte _gap_0x16A8[0x20];
};

struct Client::UI::StringThing /* Size=0x50 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ byte* FullSealsText;
    /* 0x10 */ byte* OneOrMoreLinesText;
    /* 0x18 */ byte* SecondChancePointsText;
    /* 0x20 */ byte* ReceiveSealCompleteText;
    /* 0x28 */ byte* ReceiveSealIncompleteText;
    /* 0x30 */ byte* SecondChanceRetryText;
    /*      */ byte _gap_0x38[0x8];
    /* 0x40 */ void* addon;
    /* 0x48 */ Component::GUI::AtkTextNode* TextNode;
};

struct Client::UI::StickerSlot /* Size=0x58 */
{
    /* 0x00 */ void** vtbl;
    /* 0x08 */ void* addon;
    /* 0x10 */ __int32 index;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ Component::GUI::AtkComponentButton* Button;
    /* 0x28 */ Component::GUI::AtkComponentBase* StickerComponentBase;
    /* 0x30 */ Component::GUI::AtkComponentBase* StickerShadowComponentBase;
    /* 0x38 */ Component::GUI::AtkResNode* StickerResNode;
    /* 0x40 */ Component::GUI::AtkResNode* StickerShadowResNode;
    /* 0x48 */ Component::GUI::AtkComponentBase* StickerSidebarBase;
    /* 0x50 */ Component::GUI::AtkResNode* StickerSidebarResNode;
};

struct Client::UI::StickerSlotList /* Size=0x590 */
{
    /* 0x000 */ void** vtbl;
    /* 0x008 */ void* addon;
    /* 0x010 */ Client::UI::StickerSlot StickerSlot1;
    /* 0x068 */ Client::UI::StickerSlot StickerSlot2;
    /* 0x0C0 */ Client::UI::StickerSlot StickerSlot3;
    /* 0x118 */ Client::UI::StickerSlot StickerSlot4;
    /* 0x170 */ Client::UI::StickerSlot StickerSlot5;
    /* 0x1C8 */ Client::UI::StickerSlot StickerSlot6;
    /* 0x220 */ Client::UI::StickerSlot StickerSlot7;
    /* 0x278 */ Client::UI::StickerSlot StickerSlot8;
    /* 0x2D0 */ Client::UI::StickerSlot StickerSlot9;
    /* 0x328 */ Client::UI::StickerSlot StickerSlot10;
    /* 0x380 */ Client::UI::StickerSlot StickerSlot11;
    /* 0x3D8 */ Client::UI::StickerSlot StickerSlot12;
    /* 0x430 */ Client::UI::StickerSlot StickerSlot13;
    /* 0x488 */ Client::UI::StickerSlot StickerSlot14;
    /* 0x4E0 */ Client::UI::StickerSlot StickerSlot15;
    /* 0x538 */ Client::UI::StickerSlot StickerSlot16;
};

struct Client::UI::AddonWeeklyBingo /* Size=0x23C8 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x0220 */ Client::UI::DutySlotList DutySlotList;
    /* 0x18E8 */ Client::UI::StringThing StringThing;
    /* 0x1938 */ Client::UI::StickerSlotList StickerSlotList;
    /*        */ byte _gap_0x1EC8[0x58];
    /* 0x1F20 */ unsigned __int32 NumStickersPlaced;
    /*        */ byte _gap_0x1F24[0x4];
    /*        */ byte _gap_0x1F28[0x4A0];
};

struct Client::UI::AddonWeeklyPuzzle::RewardPanelItem /* Size=0x28 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* CompBase;
    /* 0x08 */ Component::GUI::AtkResNode* Res;
    /* 0x10 */ Component::GUI::AtkTextNode* NameText;
    /* 0x18 */ Component::GUI::AtkTextNode* RewardText;
    /* 0x20 */ __int64 Unk20;
};

struct Client::UI::AddonWeeklyPuzzle::GameTileItem /* Size=0x30 */
{
    /* 0x00 */ Client::UI::AddonWeeklyPuzzle* self;
    /* 0x08 */ Component::GUI::AtkComponentButton* Button;
    /* 0x10 */ Component::GUI::AtkResNode* RevealedIconResNode;
    /* 0x18 */ Component::GUI::AtkResNode* UnkRes20;
    /* 0x20 */ Component::GUI::AtkResNode* RevealedTileResNode;
    /* 0x28 */ __int64 Unk28;
};

struct Client::UI::AddonWeeklyPuzzle::GameTileRow /* Size=0x120 */
{
    /* 0x000 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col1;
    /* 0x030 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col2;
    /* 0x060 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col3;
    /* 0x090 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col4;
    /* 0x0C0 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col5;
    /* 0x0F0 */ Client::UI::AddonWeeklyPuzzle::GameTileItem Col6;
};

struct Client::UI::AddonWeeklyPuzzle::GameTileBoard /* Size=0x6C0 */
{
    /* 0x000 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row1;
    /* 0x120 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row2;
    /* 0x240 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row3;
    /* 0x360 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row4;
    /* 0x480 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row5;
    /* 0x5A0 */ Client::UI::AddonWeeklyPuzzle::GameTileRow Row6;
};

struct Client::UI::AddonWeeklyPuzzle /* Size=0xD00 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::UI::AddonWeeklyPuzzle::RewardPanelItem RewardPanelCommander;
    /* 0x248 */ Client::UI::AddonWeeklyPuzzle::RewardPanelItem RewardPanelCoffer;
    /* 0x270 */ Client::UI::AddonWeeklyPuzzle::RewardPanelItem RewardPanelGiftBox;
    /* 0x298 */ Client::UI::AddonWeeklyPuzzle::RewardPanelItem RewardPanelDualBlades;
    /* 0x2C0 */ Component::GUI::AtkComponentButton* AtkComponentButton2C0;
    /* 0x2C8 */ Component::GUI::AtkResNode* AtkResNode2C8;
    /* 0x2D0 */ Component::GUI::AtkTextNode* AtkTextNode2D0;
    /* 0x2D8 */ Component::GUI::AtkTextNode* AtkTextNode2D8;
    /* 0x2E0 */ Component::GUI::AtkResNode* AtkResNode2E0;
    /* 0x2E8 */ Component::GUI::AtkTextNode* AtkTextNode2E8;
    /* 0x2F0 */ Component::GUI::AtkTextNode* AtkTextNode2F0;
    /* 0x2F8 */ Client::UI::AddonWeeklyPuzzle::GameTileBoard GameBoard;
    /*       */ byte _gap_0x9B8[0x80];
    /* 0xA38 */ Component::GUI::AtkResNode* AtkResNodeA38;
    /*       */ byte _gap_0xA40[0x108];
    /* 0xB48 */ Client::System::String::Utf8String CommanderStr;
    /* 0xBB0 */ Client::System::String::Utf8String CofferStr;
    /* 0xC18 */ Client::System::String::Utf8String GiftBoxStr;
    /* 0xC80 */ Client::System::String::Utf8String DualBladesStr;
    /*       */ byte _gap_0xCE8[0x18];
};

struct Client::UI::Agent::ActionData /* Size=0x88 */
{
    /* 0x00 */ Client::System::String::Utf8String DisplayString;
    /* 0x68 */ unsigned __int32 ActionId;
    /* 0x6C */ unsigned __int32 UnkValue0;
    /* 0x70 */ unsigned __int32 ActionCategoryId;
    /* 0x74 */ unsigned __int32 IconId;
    /* 0x78 */ unsigned __int32 Level;
    /*      */ byte _gap_0x7C[0x4];
    /*      */ byte _gap_0x80;
    /* 0x81 */ bool IsSlotable;
    /*      */ byte _gap_0x82[0x2];
    /*      */ byte _gap_0x84[0x4];
};

struct Component::GUI::AgentInterface /* Size=0x28 */
{
    union {
    /* 0x00 */ Component::GUI::AtkEventInterface AtkEventInterface;
    /* 0x00 */ Component::GUI::AgentInterface::AgentInterfaceVTable* VTable;
    } _union_0x0;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ Client::UI::UIModule* UiModule;
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ unsigned __int32 AddonId;
    /*      */ byte _gap_0x24[0x4];
};

struct StdVector::ClientUIAgentActionData /* Size=0x18 */
{
    /* 0x00 */ Client::UI::Agent::ActionData* First;
    /* 0x08 */ Client::UI::Agent::ActionData* Last;
    /* 0x10 */ Client::UI::Agent::ActionData* End;
};

struct StdVector::ClientUIAgentExtraCommandData /* Size=0x18 */
{
    /* 0x00 */ Client::UI::Agent::ExtraCommandData* First;
    /* 0x08 */ Client::UI::Agent::ExtraCommandData* Last;
    /* 0x10 */ Client::UI::Agent::ExtraCommandData* End;
};

struct Client::UI::Agent::AgentActionMenu /* Size=0x2E8 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x8];
    /* 0x030 */ unsigned __int32 JobIconId;
    /* 0x034 */ unsigned __int32 Level;
    /* 0x038 */ unsigned __int32 JobId;
    /* 0x03C */ unsigned __int32 ClassId;
    /* 0x040 */ unsigned __int32 ClassJobCategoryId;
    /* 0x044 */ bool JobStoneEquipped;
    /*       */ byte _gap_0x45;
    /*       */ byte _gap_0x46[0x2];
    /*       */ byte _gap_0x48[0x8];
    /*       */ byte _gap_0x50[0x4];
    /* 0x054 */ __int32 Flags;
    /*       */ byte _gap_0x58[0x4];
    /* 0x05C */ bool CompactView;
    /*       */ byte _gap_0x5D;
    /*       */ byte _gap_0x5E[0x2];
    /* 0x060 */ unsigned __int32 OpenUpgradeActionId;
    /*       */ byte _gap_0x64[0x4];
    /* 0x068 */ StdVector::ClientUIAgentActionData ClassActionList;
    /* 0x080 */ StdVector::ClientUIAgentActionData JobActionList;
    /* 0x098 */ StdVector::ClientUIAgentActionData TraitList;
    /* 0x0B0 */ StdVector::ClientUIAgentActionData GeneralList;
    /* 0x0C8 */ StdVector::ClientUIAgentActionData CompanionOrderList;
    /* 0x0E0 */ StdVector::ClientUIAgentActionData SquadronOrderList;
    /* 0x0F8 */ StdVector::ClientUIAgentActionData MainCommandList;
    /* 0x110 */ StdVector::ClientUIAgentActionData PetActionList;
    /* 0x128 */ StdVector::ClientUIAgentActionData PetOrderList;
    /* 0x140 */ StdVector::ClientUIAgentActionData PerformanceList;
    /* 0x158 */ StdVector::ClientUIAgentActionData ExtraList;
    /* 0x170 */ StdVector::ClientUIAgentActionData CombatRoleActionList;
    /* 0x188 */ StdVector::ClientUIAgentActionData GatheringRoleActionList;
    /*       */ byte _gap_0x1A0[0x40];
    /* 0x1E0 */ Client::System::String::Utf8String ClassJobTitle;
    /*       */ byte _gap_0x248[0x70];
    /* 0x2B8 */ StdVector::ClientUIAgentExtraCommandData ExtraCommandData;
    /* 0x2D0 */ void* ExtraCommandExcelSheet;
    /*       */ byte _gap_0x2D8[0x8];
    /* 0x2E0 */ unsigned __int32 UpgradeAddonId;
    /*       */ byte _gap_0x2E4[0x4];
};

struct Client::UI::Agent::AgentExplorationResultInterface /* Size=0x38 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ unsigned __int32 ItemId;
    /*      */ byte _gap_0x2C[0x4];
    /* 0x30 */ Client::UI::Agent::ExplorationResultData* Data;
};

struct Client::UI::Agent::AgentAirshipExplorationResult /* Size=0x38 */
{
    /* 0x00 */ Client::UI::Agent::AgentExplorationResultInterface Interface;
};

struct Client::UI::Agent::AgentAozContentBriefing /* Size=0x1A0 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ Client::UI::Agent::AozContentData* AozContentData;
    /* 0x030 */ Client::System::String::Utf8String WeeklyNoviceTitle;
    /* 0x098 */ Client::System::String::Utf8String WeeklyModerateTitle;
    /* 0x100 */ Client::System::String::Utf8String WeeklyAdvancedTitle;
    /* 0x168 */ Client::UI::Agent::AozWeeklyFlags WeeklyCompletion;
    /* 0x169 */ byte WeeklyAozContentId[0x3];
    /* 0x16C */ byte NoviceRequirement[0x3];
    /* 0x16F */ byte ModerateRequirement[0x3];
    /* 0x172 */ byte AdvancedRequirement[0x3];
    /*       */ byte _gap_0x175;
    /*       */ byte _gap_0x176[0x2];
    /* 0x178 */ byte* NoviceRequirements;
    /* 0x180 */ byte* ModerateRequirements;
    /* 0x188 */ byte* AdvancedRequirements;
    /*       */ byte _gap_0x190[0x10];
};

struct Client::UI::Agent::AgentAozContentResult /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AozContentResultData* AozContentResultData;
};

struct Client::UI::Agent::AgentArchiveItem /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::ArchiveItem* ArchiveItem;
};

struct Client::UI::Agent::AgentBannerEditor /* Size=0x38 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentBannerEditorState* EditorState;
    /*      */ byte _gap_0x30[0x8];
};

struct Common::Math::HalfVector4 /* Size=0x8 */
{
    /* 0x0 */ __int16 X;
    /* 0x2 */ __int16 Y;
    /* 0x4 */ __int16 Z;
    /* 0x6 */ __int16 W;
};

struct Common::Math::HalfVector2 /* Size=0x4 */
{
    /* 0x0 */ __int16 X;
    /* 0x2 */ __int16 Y;
};

struct Client::UI::Misc::BannerModuleEntry /* Size=0x90 */
{
    /* 0x00 */ byte BannerTimelineName[0x40];
    /*      */ byte _gap_0x40[0x4];
    /* 0x44 */ Common::Math::HalfVector4 CameraPosition;
    /* 0x4C */ Common::Math::HalfVector4 CameraTarget;
    /* 0x54 */ Common::Math::HalfVector2 HeadDirection;
    /* 0x58 */ Common::Math::HalfVector2 EyeDirection;
    /* 0x5C */ __int16 DirectionalLightingVerticalAngle;
    /* 0x5E */ __int16 DirectionalLightingHorizontalAngle;
    /* 0x60 */ byte Race;
    /* 0x61 */ byte Gender;
    /* 0x62 */ byte Height;
    /* 0x63 */ byte Tribe;
    /* 0x64 */ byte DirectionalLightingColorRed;
    /* 0x65 */ byte DirectionalLightingColorGreen;
    /* 0x66 */ byte DirectionalLightingColorBlue;
    /* 0x67 */ byte AmbientLightingColorRed;
    /* 0x68 */ byte AmbientLightingColorGreen;
    /* 0x69 */ byte AmbientLightingColorBlue;
    /*      */ byte _gap_0x6A[0x2];
    /* 0x6C */ float AnimationProgress;
    /* 0x70 */ unsigned __int32 BannerTimelineIcon;
    /* 0x74 */ unsigned __int32 LastUpdated;
    /* 0x78 */ unsigned __int32 Checksum;
    /* 0x7C */ unsigned __int16 BannerBg;
    /* 0x7E */ unsigned __int16 BannerFrame;
    /* 0x80 */ unsigned __int16 BannerDecoration;
    /* 0x82 */ unsigned __int16 BannerTimeline;
    /* 0x84 */ __int16 ImageRotation;
    /* 0x86 */ byte BannerIndex;
    /* 0x87 */ byte BannerId;
    /* 0x88 */ byte BannerTimelineClassJobCategory;
    /* 0x89 */ byte Expression;
    /* 0x8A */ byte CameraZoom;
    /* 0x8B */ byte DirectionalLightingBrightness;
    /* 0x8C */ byte AmbientLightingBrightness;
    /* 0x8D */ byte HasBannerTimelineCustomName;
    /*      */ byte _gap_0x8E[0x2];
};

struct Client::UI::Agent::AgentBannerEditorState /* Size=0x2D8 */
{
    /*       */ byte _gap_0x0[0x20];
    /* 0x020 */ __int64 PresetItems;
    /* 0x028 */ unsigned __int32 PresetItemsCount;
    /*       */ byte _gap_0x2C[0x4];
    /*       */ byte _gap_0x30[0x10];
    /* 0x040 */ Client::UI::Agent::AgentBannerEditorState::GenericDropdownItem** BackgroundItems;
    /* 0x048 */ unsigned __int32 BackgroundItemsCount;
    /*       */ byte _gap_0x4C[0x4];
    /*       */ byte _gap_0x50[0x20];
    /* 0x070 */ Client::UI::Agent::AgentBannerEditorState::GenericDropdownItem** FrameItems;
    /* 0x078 */ unsigned __int32 FrameItemsCount;
    /*       */ byte _gap_0x7C[0x4];
    /*       */ byte _gap_0x80[0x20];
    /* 0x0A0 */ Client::UI::Agent::AgentBannerEditorState::GenericDropdownItem** AccentItems;
    /* 0x0A8 */ unsigned __int32 AccentItemsCount;
    /*       */ byte _gap_0xAC[0x4];
    /*       */ byte _gap_0xB0[0x20];
    /* 0x0D0 */ Client::UI::Agent::AgentBannerEditorState::GenericDropdownItem** BannerTimelineItems;
    /* 0x0D8 */ unsigned __int32 BannerTimelineItemsCount;
    /*       */ byte _gap_0xDC[0x4];
    /*       */ byte _gap_0xE0[0x20];
    /* 0x100 */ Client::UI::Agent::AgentBannerEditorState::ExpressionDropdownItem** ExpressionItems;
    /* 0x108 */ unsigned __int32 ExpressionItemsCount;
    /*       */ byte _gap_0x10C[0x4];
    /*       */ byte _gap_0x110[0x10];
    /* 0x120 */ Client::UI::Misc::BannerModuleEntry BannerEntry;
    /*       */ byte _gap_0x1B0[0x90];
    /* 0x240 */ unsigned __int32 ItemIds[0xE];
    /* 0x278 */ byte StainIds[0xE];
    /*       */ byte _gap_0x286[0x2];
    /* 0x288 */ unsigned __int32 Checksum;
    /* 0x28C */ Client::UI::Misc::BannerGearVisibilityFlag GearVisibilityFlag;
    /* 0x290 */ byte GearsetIndex;
    /* 0x291 */ byte ClassJobId;
    /*       */ byte _gap_0x292[0x2];
    /*       */ byte _gap_0x294[0x4];
    /* 0x298 */ Client::UI::Agent::AgentBannerEditor* AgentBannerEditor;
    /* 0x2A0 */ Client::UI::UIModule* UIModule;
    /* 0x2A8 */ Client::UI::Misc::CharaViewPortrait* CharaView;
    /*       */ byte _gap_0x2B0[0x8];
    /* 0x2B8 */ Client::UI::Agent::AgentBannerEditorState::EditorOpenType OpenType;
    /*       */ byte _gap_0x2BC[0x4];
    /*       */ byte _gap_0x2C0[0x4];
    /* 0x2C4 */ unsigned __int32 FrameCountdown;
    /* 0x2C8 */ __int32 GearsetId;
    /*       */ byte _gap_0x2CC[0x4];
    /* 0x2D0 */ __int32 CloseDialogAddonId;
    /* 0x2D4 */ bool HasDataChanged;
    /*       */ byte _gap_0x2D5;
    /*       */ byte _gap_0x2D6[0x2];
};

struct Client::UI::Agent::AgentBannerEditorState::ExpressionDropdownItem /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int64 Data;
    /* 0x10 */ unsigned __int16 Id;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Client::UI::Agent::AgentBannerEditorState::GenericDropdownItem /* Size=0x18 */
{
    /* 0x00 */ __int64 Data;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ unsigned __int16 Id;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Client::UI::Agent::AgentBannerInterface /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentBannerInterface::Storage* Data;
};

struct Client::UI::Agent::AgentBannerInterface::Storage /* Size=0x3B30 */
{
    /* 0x0000 */ void* Agent;
    /* 0x0008 */ Client::UI::UIModule* UiModule;
    /* 0x0010 */ unsigned __int32 Unk1;
    /* 0x0014 */ unsigned __int32 Unk2;
    /*        */ byte _gap_0x18[0x8];
    /* 0x0020 */ byte CharacterArray[0x3B00];
    /* 0x3B20 */ __int64 Unk3;
    /* 0x3B28 */ __int64 Unk4;
};

struct Component::GUI::AtkTexture /* Size=0x18 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ Component::GUI::AtkTexture::AtkTextureVTable* VTable;
    } _union_0x0;
    union {
    /* 0x08 */ Component::GUI::AtkTextureResource* Resource;
    /* 0x08 */ void* Crest;
    /* 0x08 */ Client::Graphics::Kernel::Texture* KernelTexture;
    } _union_0x8;
    /* 0x10 */ Component::GUI::TextureType TextureType;
    /* 0x11 */ bool TextureReady;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

struct Client::UI::Agent::AgentBannerInterface::Storage::CharacterData /* Size=0x760 */
{
    /* 0x000 */ void** VTable;
    /*       */ byte _gap_0x8[0x10];
    /* 0x018 */ Client::System::String::Utf8String Name1;
    /* 0x080 */ Client::System::String::Utf8String Name2;
    /* 0x0E8 */ Client::System::String::Utf8String UnkString1;
    /* 0x150 */ Client::System::String::Utf8String UnkString2;
    /*       */ byte _gap_0x1B8[0x8];
    /* 0x1C0 */ Client::System::String::Utf8String Job;
    /*       */ byte _gap_0x228[0x10];
    /* 0x238 */ unsigned __int32 WorldId;
    /*       */ byte _gap_0x23C[0x4];
    /* 0x240 */ Client::System::String::Utf8String UnkString3;
    /*       */ byte _gap_0x2A8[0x8];
    /* 0x2B0 */ void* CharaView;
    /*       */ byte _gap_0x2B8[0x318];
    /* 0x5D0 */ Component::GUI::AtkTexture AtkTexture;
    /*       */ byte _gap_0x5E8[0xF8];
    /* 0x6E0 */ Client::System::String::Utf8String Title;
    /*       */ byte _gap_0x748[0x8];
    /* 0x750 */ void* SomePointer;
    /*       */ byte _gap_0x758[0x8];
};

struct Client::UI::Agent::AgentBannerMIP /* Size=0x38 */
{
    /* 0x00 */ Client::UI::Agent::AgentBannerInterface AgentBannerInterface;
    /*      */ byte _gap_0x30[0x8];
};

struct Client::UI::Agent::AgentBannerParty /* Size=0x38 */
{
    /* 0x00 */ Client::UI::Agent::AgentBannerInterface AgentBannerInterface;
    /*      */ byte _gap_0x30[0x8];
};

struct Client::UI::Agent::AgentCharaCard /* Size=0x38 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentCharaCard::Storage* Data;
    /*      */ byte _gap_0x30[0x8];
};

struct Client::UI::Misc::CharaViewCharacterData /* Size=0x68 */
{
    /* 0x00 */ Client::Game::Character::CustomizeData CustomizeData;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ unsigned __int32 ItemIds[0xE];
    /* 0x54 */ byte ItemStains[0xE];
    /* 0x62 */ byte ClassJobId;
    /* 0x63 */ bool VisorHidden;
    /* 0x64 */ bool WeaponHidden;
    /* 0x65 */ bool VisorClosed;
    /*      */ byte _gap_0x66[0x2];
};

struct Client::UI::Misc::CharaView /* Size=0x2C8 */
{
    /* 0x000 */ Client::UI::Misc::CharaView::CharaViewVTable* VTable;
    /* 0x008 */ unsigned __int32 State;
    /* 0x00C */ unsigned __int32 ClientObjectId;
    /* 0x010 */ unsigned __int32 ClientObjectIndex;
    /* 0x014 */ unsigned __int32 CameraType;
    /* 0x018 */ __int64 CameraManager;
    /* 0x020 */ Client::Game::Camera* Camera;
    /*       */ byte _gap_0x28[0x8];
    /* 0x030 */ Component::GUI::AgentInterface* Agent;
    /*       */ byte _gap_0x38[0x10];
    /* 0x048 */ Client::UI::Misc::CharaViewCharacterData CharacterData;
    /*       */ byte _gap_0xB0[0x10];
    /*       */ byte _gap_0xC0[0x4];
    /* 0x0C4 */ float ZoomRatio;
    /*       */ byte _gap_0xC8[0x8];
    /* 0x0D0 */ byte Items[0x1C0];
    /*       */ byte _gap_0x290[0x28];
    /* 0x2B8 */ bool CharacterDataCopied;
    /* 0x2B9 */ bool CharacterLoaded;
    /*       */ byte _gap_0x2BA[0x2];
    /*       */ byte _gap_0x2BC[0x4];
    /*       */ byte _gap_0x2C0[0x8];
};

struct Client::UI::Agent::AgentCharaCard::Storage /* Size=0x950 */
{
    /*       */ byte _gap_0x0[0x58];
    /* 0x058 */ Client::System::String::Utf8String Name;
    /*       */ byte _gap_0xC0[0x18];
    /* 0x0D8 */ Client::System::String::Utf8String FreeCompany;
    /* 0x140 */ Client::System::String::Utf8String SearchComment1;
    /* 0x1A8 */ Client::System::String::Utf8String SearchComment2;
    /*       */ byte _gap_0x210[0x40];
    /* 0x250 */ unsigned __int32 Activity1IconId;
    /*       */ byte _gap_0x254[0x4];
    /* 0x258 */ Client::System::String::Utf8String Activity1Name;
    /* 0x2C0 */ unsigned __int32 Activity2IconId;
    /*       */ byte _gap_0x2C4[0x4];
    /* 0x2C8 */ Client::System::String::Utf8String Activity2Name;
    /* 0x330 */ unsigned __int32 Activity3IconId;
    /*       */ byte _gap_0x334[0x4];
    /* 0x338 */ Client::System::String::Utf8String Activity3Name;
    /* 0x3A0 */ unsigned __int32 Activity4IconId;
    /*       */ byte _gap_0x3A4[0x4];
    /* 0x3A8 */ Client::System::String::Utf8String Activity4Name;
    /* 0x410 */ unsigned __int32 Activity5IconId;
    /*       */ byte _gap_0x414[0x4];
    /* 0x418 */ Client::System::String::Utf8String Activity5Name;
    /* 0x480 */ unsigned __int32 Activity6IconId;
    /*       */ byte _gap_0x484[0x4];
    /* 0x488 */ Client::System::String::Utf8String Activity6Name;
    /*       */ byte _gap_0x4F0[0x50];
    /* 0x540 */ Client::UI::Misc::CharaView CharaView;
    /*       */ byte _gap_0x808[0x148];
};

struct Client::UI::Agent::AgentChatLog /* Size=0x2B8 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x18];
    /* 0x040 */ Client::UI::Agent::ChatChannel CurrentChannel;
    /*       */ byte _gap_0x44[0x4];
    /* 0x048 */ Client::System::String::Utf8String ChannelLabel;
    /*       */ byte _gap_0xB0[0x208];
};

struct Client::UI::Agent::AgentCompanyCraftMaterial /* Size=0xE8 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /*      */ byte _gap_0x28[0x68];
    /*      */ byte _gap_0x90[0x4];
    /* 0x94 */ unsigned __int32 ResultItem;
    /*      */ byte _gap_0x98;
    /* 0x99 */ byte SelectedSupplyItemIndex;
    /*      */ byte _gap_0x9A[0x2];
    /* 0x9C */ unsigned __int32 SupplyItem[0xC];
    /*      */ byte _gap_0xCC[0x4];
    /*      */ byte _gap_0xD0[0x18];
};

struct Client::UI::Agent::AgentContentsFinder /* Size=0x2088 */
{
    /* 0x0000 */ Component::GUI::AgentInterface AgentInterface;
    /*        */ byte _gap_0x28[0x10];
    /* 0x0038 */ Client::System::String::Utf8String Description;
    /*        */ byte _gap_0xA0[0x850];
    /* 0x08F0 */ byte ItemRewardArray[0x11D0];
    /*        */ byte _gap_0x1AC0[0xA8];
    /*        */ byte _gap_0x1B68[0x4];
    /* 0x1B6C */ __int32 SelectedDutyId;
    /*        */ byte _gap_0x1B70[0x8];
    /* 0x1B78 */ byte NumCollectedRewards;
    /*        */ byte _gap_0x1B79;
    /*        */ byte _gap_0x1B7A[0x2];
    /*        */ byte _gap_0x1B7C[0x4];
    /*        */ byte _gap_0x1B80[0x48];
    /* 0x1BC8 */ byte Strings[0x410];
    /*        */ byte _gap_0x1FD8[0x28];
    /*        */ byte _gap_0x2000[0x4];
    /*        */ byte _gap_0x2004[0x2];
    /*        */ byte _gap_0x2006;
    /* 0x2007 */ byte ContentRouletteRoleBonus[0xB];
    /*        */ byte _gap_0x2012[0x2];
    /* 0x2014 */ unsigned __int32 DutyPenaltyMinutes;
    /* 0x2018 */ unsigned __int32 UnkPenaltyMinutes;
    /*        */ byte _gap_0x201C[0x4];
    /*        */ byte _gap_0x2020[0x28];
    /*        */ byte _gap_0x2048[0x4];
    /* 0x204C */ __int32 CurrentTimestamp;
    /*        */ byte _gap_0x2050[0x8];
    /* 0x2058 */ byte SelectedTab;
    /*        */ byte _gap_0x2059;
    /*        */ byte _gap_0x205A[0x2];
    /*        */ byte _gap_0x205C[0x4];
    /*        */ byte _gap_0x2060[0x28];
};

struct System::Drawing::Point /* Size=0x0 */
{
};

struct Client::UI::Agent::ContextMenuTarget /* Size=0x60 */
{
    /* 0x00 */ unsigned __int64 ContentId;
    /*      */ byte _gap_0x8[0x8];
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ byte AddonListIndex;
    /*      */ byte _gap_0x15;
    /* 0x16 */ unsigned __int16 CurrentWorldId;
    /* 0x18 */ unsigned __int16 HomeWorldId;
    /* 0x1A */ unsigned __int16 TerritoryTypeId;
    /* 0x1C */ byte GrandCompany;
    /* 0x1D */ byte ClientLanguage;
    /* 0x1E */ byte LanguageBitmask;
    /*      */ byte _gap_0x1F;
    /* 0x20 */ byte Gender;
    /* 0x21 */ byte ClassJobId;
    /* 0x22 */ byte Name[0x20];
    /* 0x42 */ byte FcName[0xE];
    /* 0x50 */ void* Unk_Info_Ptr;
    /*      */ byte _gap_0x58[0x8];
};

struct Client::UI::Agent::AgentContext /* Size=0x1750 */
{
    /* 0x0000 */ Component::GUI::AgentInterface AgentInterface;
    /*        */ byte _gap_0x28[0xCF0];
    /* 0x0D18 */ Client::UI::Agent::ContextMenu* CurrentContextMenu;
    /* 0x0D20 */ Client::System::String::Utf8String ContextMenuTitle;
    /* 0x0D88 */ System::Drawing::Point Position;
    /*        */ byte _gap_0xD88[0x8];
    /* 0x0D90 */ unsigned __int32 OwnerAddon;
    /*        */ byte _gap_0xD94[0x4];
    /*        */ byte _gap_0xD98[0x8];
    /* 0x0DA0 */ Client::UI::Agent::ContextMenuTarget ContextMenuTarget;
    /* 0x0E00 */ Client::UI::Agent::ContextMenuTarget* CurrentContextMenuTarget;
    /* 0x0E08 */ Client::System::String::Utf8String TargetName;
    /* 0x0E70 */ Client::System::String::Utf8String YesNoTargetName;
    /*        */ byte _gap_0xED8[0x8];
    /* 0x0EE0 */ unsigned __int64 TargetContentId;
    /* 0x0EE8 */ unsigned __int64 YesNoTargetContentId;
    /* 0x0EF0 */ Client::Game::Object::GameObjectID TargetObjectId;
    /* 0x0EF8 */ Client::Game::Object::GameObjectID YesNoTargetObjectId;
    /* 0x0F00 */ __int16 TargetHomeWorldId;
    /* 0x0F02 */ __int16 YesNoTargetHomeWorldId;
    /* 0x0F04 */ byte YesNoEventId;
    /*        */ byte _gap_0xF05;
    /*        */ byte _gap_0xF06[0x2];
    /* 0x0F08 */ __int32 TargetGender;
    /* 0x0F0C */ unsigned __int32 TargetMountSeats;
    /*        */ byte _gap_0xF10[0x820];
    /* 0x1730 */ void* UpdateChecker;
    /* 0x1738 */ __int64 UpdateCheckerParam;
    /* 0x1740 */ byte ContextMenuIndex;
    /* 0x1741 */ byte OpenAtPosition;
    /*        */ byte _gap_0x1742[0x2];
    /*        */ byte _gap_0x1744[0x4];
    /*        */ byte _gap_0x1748[0x8];
};

struct Client::UI::Agent::AgentCraftActionSimulator /* Size=0x90 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::ProgressEfficiencyCalculations* Progress;
    /*      */ byte _gap_0x30[0x10];
    /* 0x40 */ Client::UI::Agent::QualityEfficiencyCalculations* Quality;
    /*      */ byte _gap_0x48[0x48];
};

struct Client::UI::Agent::AgentDeepDungeonInspect /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentDeepDungeonInspect::AgentDeepDungeonInspectData* Data;
};

struct Client::UI::Agent::AgentDeepDungeonInspect::AgentDeepDungeonInspectData /* Size=0x160 */
{
    /* 0x000 */ unsigned __int32 RequestObjectID;
    /* 0x004 */ unsigned __int32 CurrentObjectID;
    /* 0x008 */ unsigned __int32 StatusSearchComment;
    /* 0x00C */ unsigned __int32 Unk0C;
    /* 0x010 */ Client::System::String::Utf8String SearchComment;
    /* 0x078 */ Client::UI::Info::InfoProxySearchComment* InfoProxySearchComment;
    /* 0x080 */ byte Title;
    /* 0x081 */ byte Unk81;
    /* 0x082 */ byte WorldID;
    /* 0x083 */ byte Unk83;
    /* 0x084 */ byte Unk84;
    /* 0x085 */ byte Job;
    /* 0x086 */ byte Level;
    /* 0x087 */ byte AetherPoolArmLvl;
    /* 0x088 */ byte AetherPoolArmorLvl;
    /*       */ byte _gap_0x89;
    /*       */ byte _gap_0x8A[0x2];
    /*       */ byte _gap_0x8C[0x4];
    /* 0x090 */ Client::System::String::Utf8String Name;
    /* 0x0F8 */ Client::System::String::Utf8String UnkF8;
};

struct Client::UI::Agent::AgentDeepDungeonMap /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentDeepDungeonMapData* Data;
};

struct Client::UI::Agent::AgentDeepDungeonMapData /* Size=0x36 */
{
    /* 0x00 */ signed __int8 MapArray[0x19];
    /* 0x19 */ signed __int8 RoomIndexArray[0x19];
    /* 0x32 */ byte RoomIndexCount;
    /* 0x33 */ byte DeepDungeonId;
    /* 0x34 */ byte Unk_34;
    /* 0x35 */ bool MapLocked;
};

struct Client::UI::Agent::AgentDeepDungeonStatus /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::DeepDungeonStatusData* Data;
};

struct Client::UI::Agent::AgentDeliveryItemInfo /* Size=0x108 */
{
    /*       */ byte _gap_0x0[0xA0];
    /* 0x0A0 */ Client::System::String::Utf8String ItemName;
};

struct Client::UI::Agent::AgentFieldMarker /* Size=0xCE0 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x8];
    /*       */ byte _gap_0x30[0x4];
    /* 0x034 */ byte ActiveMarkerFlags;
    /*       */ byte _gap_0x35;
    /*       */ byte _gap_0x36[0x2];
    /* 0x038 */ __int32 PageIndexOffset;
    /*       */ byte _gap_0x3C[0x4];
    /* 0x040 */ byte PresetLabels[0xC30];
    /* 0xC70 */ Client::System::String::Utf8String TooltipString;
    /*       */ byte _gap_0xCD8[0x8];
};

struct Client::UI::Agent::AgentFishGuide /* Size=0x1A8 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x180];
};

struct Client::UI::Agent::AgentFreeCompany::FreeCompanyActionTimer /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 TimeSinceUpdate;
    /* 0x04 */ unsigned __int32 TimeRemainingAtUpdate[0x3];
};

struct Client::UI::Agent::AgentFreeCompany /* Size=0xAD8 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ void* vtbl2;
    /* 0x030 */ void* vtbl3;
    /*       */ byte _gap_0x38[0x8];
    /* 0x040 */ Client::UI::Misc::RaptureTextModule* RaptureTextModule;
    /* 0x048 */ void* InfoProxy0;
    /* 0x050 */ void* InfoProxy1;
    /*       */ byte _gap_0x58[0x2D0];
    /* 0x328 */ Client::System::String::Utf8String Board;
    /*       */ byte _gap_0x390[0x70];
    /* 0x400 */ Client::System::String::Utf8String Slogan;
    /*       */ byte _gap_0x468[0x70];
    /* 0x4D8 */ Client::System::String::Utf8String ShortMessage;
    /*       */ byte _gap_0x540[0x550];
    /* 0xA90 */ Client::UI::Agent::AgentFreeCompany::FreeCompanyActionTimer ActionTimeRemaining;
    /*       */ byte _gap_0xAA0[0x38];
};

struct Client::UI::Agent::CrestData /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

struct Client::UI::Agent::AgentFreeCompanyCrestEditor /* Size=0x70 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /*      */ byte _gap_0x28[0x38];
    /* 0x60 */ Client::UI::Agent::CrestData OriginalCrest;
    /* 0x68 */ Client::UI::Agent::CrestData CurrentCrest;
};

struct Client::UI::Agent::AgentFreeCompanyProfile::FCProfile /* Size=0x6 */
{
    /* 0x0 */ Client::UI::Agent::AgentFreeCompanyProfile::FCProfile::FocusType Focus;
    /* 0x2 */ Client::UI::Agent::AgentFreeCompanyProfile::FCProfile::SeekingType Seeking;
    /* 0x4 */ Client::UI::Agent::AgentFreeCompanyProfile::FCProfile::ActiveType Active;
    /* 0x5 */ Client::UI::Agent::AgentFreeCompanyProfile::FCProfile::RecruitmentType Recruitment;
};

struct Client::UI::Agent::AgentFreeCompanyProfile /* Size=0x27C */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ __int64 RequestID;
    /* 0x030 */ __int64 UnkID2;
    /* 0x038 */ __int64 UnkID3;
    /* 0x040 */ __int64 UnkID4;
    /* 0x048 */ Client::UI::Agent::CrestData Crest;
    /* 0x050 */ unsigned __int16 PlotNumber;
    /* 0x052 */ unsigned __int16 WardNumber;
    /* 0x054 */ unsigned __int16 EstateZone;
    /* 0x056 */ unsigned __int16 World;
    /*       */ byte _gap_0x58[0x4];
    /* 0x05C */ unsigned __int32 FoundationDate;
    /* 0x060 */ __int16 MemberCount;
    /* 0x062 */ __int16 MembersOnline;
    /* 0x064 */ Client::UI::Agent::AgentFreeCompanyProfile::FCProfile Profile;
    /* 0x06A */ Client::UI::Agent::GrandCompany GrandCompany;
    /*       */ byte _gap_0x6B;
    /* 0x06C */ byte Rank;
    /* 0x06D */ byte Reputation;
    /*       */ byte _gap_0x6E[0x2];
    /* 0x070 */ Client::System::String::Utf8String Name;
    /* 0x0D8 */ Client::System::String::Utf8String Tag;
    /* 0x140 */ Client::System::String::Utf8String Master;
    /* 0x1A8 */ Client::System::String::Utf8String Slogan;
    /* 0x210 */ Client::System::String::Utf8String EstateName;
    /* 0x278 */ byte Unk278;
    /* 0x279 */ byte Unk279;
    /* 0x27A */ byte Unk27A;
    /* 0x27B */ byte Unk27B;
};

struct Client::UI::Agent::AgentFriendList /* Size=0xC8 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Info::InfoProxyFriendList* InfoProxy;
    /* 0x30 */ Client::System::String::Utf8String SelectedPlayerName;
    /*      */ byte _gap_0x98[0x8];
    /* 0xA0 */ unsigned __int64 SelectedContentId;
    /*      */ byte _gap_0xA8[0x8];
    /* 0xB0 */ byte SelectedIndex;
    /*      */ byte _gap_0xB1;
    /*      */ byte _gap_0xB2[0x2];
    /*      */ byte _gap_0xB4[0x4];
    /*      */ byte _gap_0xB8[0x10];
};

struct Client::UI::Agent::AgentGatheringNote /* Size=0x178 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x90];
    /* 0x0B8 */ Client::UI::Agent::GatheringAreaInfo* GatheringAreaInfo;
    /*       */ byte _gap_0xC0[0xB8];
};

struct Client::UI::Agent::AgentGcArmyExpedition /* Size=0x48 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::GcArmyExpeditionData* ExpeditionData;
    /*      */ byte _gap_0x30[0x10];
    /* 0x40 */ __int32 SelectedTab;
    /* 0x44 */ __int32 SelectedRow;
};

struct Client::UI::Agent::AgentGoldSaucer /* Size=0x210 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x30];
    /*       */ byte _gap_0x58[0x2];
    /* 0x05A */ __int16 GoldSaucerSelectedTab;
    /* 0x05C */ __int16 ChocoboSeletedTab;
    /*       */ byte _gap_0x5E[0x2];
    /*       */ byte _gap_0x60[0xA0];
    /* 0x100 */ __int32 EditDeckSelectedPage;
    /*       */ byte _gap_0x104[0x4];
    /* 0x108 */ __int32 EditDeckSelectedCardIndex;
    /*       */ byte _gap_0x10C[0x4];
    /*       */ byte _gap_0x110[0x100];
};

struct Client::UI::Agent::AgentGrandCompanySupply /* Size=0x2F8 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x38];
    /* 0x060 */ Client::UI::Agent::SupplyProvisioningData* SupplyProvisioningData;
    /* 0x068 */ Client::UI::Agent::GrandCompanyItem* ItemArray;
    /*       */ byte _gap_0x70[0x8];
    /* 0x078 */ __int32 NumItems;
    /*       */ byte _gap_0x7C[0x4];
    /*       */ byte _gap_0x80[0x10];
    /* 0x090 */ __int32 SelectedTab;
    /*       */ byte _gap_0x94[0x4];
    /*       */ byte _gap_0x98[0x260];
};

struct Client::UI::Agent::AgentHousingPlant /* Size=0x950 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x18];
    /* 0x040 */ unsigned __int32 ContextAddonId;
    /* 0x044 */ unsigned __int32 PlotType;
    /* 0x048 */ byte SelectedItems[0x20];
    /* 0x068 */ byte SelectedItems2[0x20];
    /* 0x088 */ byte SelectableItems[0x8C0];
    /* 0x948 */ byte SelectableItemCount;
    /*       */ byte _gap_0x949;
    /*       */ byte _gap_0x94A[0x2];
    /*       */ byte _gap_0x94C[0x4];
};

struct Client::UI::Agent::AgentHousingPlant::SelectableItem /* Size=0x10 */
{
    /* 0x00 */ void* ItemCache;
    /* 0x08 */ unsigned __int32 InventoryId;
    /* 0x0C */ unsigned __int16 InventorySlot;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::UI::Agent::AgentHousingPlant::SelectedItem /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 InventoryId;
    /* 0x04 */ unsigned __int16 InventorySlot;
    /*      */ byte _gap_0x6[0x2];
    /* 0x08 */ unsigned __int32 ItemId;
    /*      */ byte _gap_0xC[0x4];
};

struct Client::UI::Agent::AgentHUD /* Size=0x4BA0 */
{
    /* 0x0000 */ Component::GUI::AgentInterface AgentInterface;
    /*        */ byte _gap_0x28[0xC90];
    /* 0x0CB8 */ __int32 CompanionSummonTimer;
    /*        */ byte _gap_0xCBC[0x4];
    /*        */ byte _gap_0xCC0[0x8];
    /* 0x0CC8 */ byte PartyMemberList[0x140];
    /*        */ byte _gap_0xE08[0x4B0];
    /* 0x12B8 */ __int16 PartyMemberCount;
    /*        */ byte _gap_0x12BA[0x2];
    /*        */ byte _gap_0x12BC[0x4];
    /* 0x12C0 */ unsigned __int32 PartyTitleAddonId;
    /* 0x12C4 */ unsigned __int32 RaidMemberIds[0x28];
    /* 0x1364 */ __int32 RaidGroupSize;
    /*        */ byte _gap_0x1368[0x88];
    /* 0x13F0 */ Client::UI::Agent::HudPartyMemberEnmity* PartyEnmityList;
    /*        */ byte _gap_0x13F8[0x37A8];
};

struct Client::UI::Agent::AgentHudLayout /* Size=0x78 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /*      */ byte _gap_0x28[0x48];
    /* 0x70 */ bool NeedToSave;
    /*      */ byte _gap_0x71;
    /*      */ byte _gap_0x72[0x2];
    /*      */ byte _gap_0x74[0x4];
};

struct Client::UI::Agent::AgentIKDFishingLog /* Size=0x460 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ unsigned __int32 RouteId;
    /* 0x02C */ unsigned __int32 SpotId[0x3];
    /* 0x038 */ unsigned __int32 SpotIndex;
    /* 0x03C */ unsigned __int32 SelectedSpotIndex;
    /* 0x040 */ unsigned __int32 Points;
    /* 0x044 */ bool SpecialCurrent;
    /*       */ byte _gap_0x45;
    /*       */ byte _gap_0x46[0x2];
    /* 0x048 */ byte Log[0x30];
    /*       */ byte _gap_0x78[0x8];
    /*       */ byte _gap_0x80[0x4];
    /* 0x084 */ byte PotentialCatchSpots[0x3D8];
    /* 0x45C */ bool DisplayOnlyCaught;
    /*       */ byte _gap_0x45D;
    /*       */ byte _gap_0x45E[0x2];
};

struct Client::UI::Agent::AgentIKDFishingLog::LogEntry /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 ItemId;
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ unsigned __int16 Average;
    /* 0x0A */ unsigned __int16 Large;
    /* 0x0C */ unsigned __int16 Points;
    /*      */ byte _gap_0xE[0x2];
};

struct Client::UI::Agent::AgentIKDFishingLog::PotentialCatchSpot /* Size=0x148 */
{
    /* 0x000 */ unsigned __int32 SpotId;
    /* 0x004 */ byte CatchEntries[0xA0];
    /* 0x0A4 */ unsigned __int32 SpecialSpotId;
    /* 0x0A8 */ byte SpecialCatchEntries[0xA0];
};

struct Client::UI::Agent::AgentIKDResult /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x28 */ Client::UI::Agent::AgentIKDResult::ResultData* Data;
};

struct Client::UI::Agent::AgentIKDResult::CatchResult /* Size=0xC */
{
    /* 0x0 */ unsigned __int32 IKDFishParamId;
    /* 0x4 */ unsigned __int16 Average;
    /* 0x6 */ unsigned __int16 Large;
    /* 0x8 */ unsigned __int32 Points;
};

struct Client::UI::Agent::AgentIKDResult::CatchResultInfo /* Size=0xC */
{
    /* 0x0 */ unsigned __int32 FishParameterId;
    /* 0x4 */ unsigned __int32 ItemId;
    /* 0x8 */ byte UnkByte;
    /* 0x9 */ byte IKDContentBonusId;
    /*     */ byte _gap_0xA[0x2];
};

struct Client::UI::Agent::AgentIKDResult::ContentBonusEntry /* Size=0xE0 */
{
    /* 0x00 */ Client::System::String::Utf8String Objective;
    /* 0x68 */ Client::System::String::Utf8String Requirement;
    /* 0xD0 */ unsigned __int32 IKDContentBonusId;
    /* 0xD4 */ unsigned __int32 IconId;
    /* 0xD8 */ unsigned __int16 UnkUShort;
    /* 0xDA */ byte Order;
    /*      */ byte _gap_0xDB;
    /*      */ byte _gap_0xDC[0x4];
};

struct Client::UI::Agent::AgentIKDResult::ResultEntry /* Size=0x78 */
{
    /* 0x00 */ Client::System::String::Utf8String Name;
    /* 0x68 */ unsigned __int16 WorldId;
    /*      */ byte _gap_0x6A[0x2];
    /* 0x6C */ unsigned __int16 Caught;
    /*      */ byte _gap_0x6E[0x2];
    /* 0x70 */ unsigned __int32 Points;
    /*      */ byte _gap_0x74[0x4];
};

struct Client::UI::Agent::AgentIKDResult::ResultData /* Size=0x17A0 */
{
    /* 0x0000 */ byte CatchResults[0x2D0];
    /* 0x02D0 */ byte CatchResultCount;
    /*        */ byte _gap_0x2D1;
    /*        */ byte _gap_0x2D2[0x2];
    /* 0x02D4 */ unsigned __int32 ContentBonusIds[0xD];
    /* 0x0308 */ byte ContentBonusCount;
    /*        */ byte _gap_0x309;
    /*        */ byte _gap_0x30A[0x2];
    /*        */ byte _gap_0x30C[0x4];
    /* 0x0310 */ Client::UI::Agent::AgentIKDResult::ResultEntry PlayerResult;
    /* 0x0388 */ byte GroupResult[0x4B0];
    /* 0x0838 */ byte GroupSize;
    /* 0x0839 */ byte PlayerGroupIndex;
    /*        */ byte _gap_0x83A[0x2];
    /* 0x083C */ unsigned __int32 AvarageCaught;
    /* 0x0840 */ unsigned __int32 LargeCaught;
    /* 0x0844 */ unsigned __int32 Score;
    /*        */ byte _gap_0x848[0x4];
    /* 0x084C */ unsigned __int32 TotalScore;
    /* 0x0850 */ unsigned __int32 ExpReward;
    /* 0x0854 */ unsigned __int16 WhiteScripReward;
    /* 0x0856 */ unsigned __int16 PurpleScripReward;
    /*        */ byte _gap_0x858[0x8];
    /* 0x0860 */ byte CatchResultsInfo[0x2D0];
    /* 0x0B30 */ byte ContentBonus[0xB60];
    /* 0x1690 */ byte ContentBonusPointer[0x68];
    /*        */ byte _gap_0x16F8[0xA8];
};

struct Client::UI::Agent::AgentInspect::FreeCompanyData /* Size=0x86 */
{
    /* 0x00 */ byte Unkown4b0;
    /* 0x01 */ bool IsPArtOfFreeCOmpany;
    /*      */ byte _gap_0x2[0x2];
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ __int64 ID;
    /* 0x10 */ Client::UI::Agent::CrestData Crest;
    /* 0x18 */ unsigned __int16 MemberCount;
    /* 0x1A */ unsigned __int16 GrandCompany;
    /* 0x1C */ unsigned __int16 Unk1C;
    /* 0x1E */ Client::System::String::Utf8String GuildName;
};

struct Client::UI::Agent::AgentInspect /* Size=0x554 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ unsigned __int32 RequestObjectID;
    /* 0x02C */ unsigned __int32 RequestSearchCommentOID;
    /* 0x030 */ unsigned __int32 RequestFreeCompanyOID;
    /* 0x034 */ unsigned __int32 CurrentObjectID;
    /* 0x038 */ Client::System::String::Utf8String SearchComment;
    /* 0x0A0 */ Client::System::String::Utf8String UnkString1;
    /* 0x108 */ Client::System::String::Utf8String PsnName;
    /* 0x170 */ Client::System::String::Utf8String ChocoboBarding1;
    /* 0x1D8 */ Client::System::String::Utf8String ChocoboBarding2;
    /* 0x240 */ Client::System::String::Utf8String ChocoboBarding3;
    /* 0x2A8 */ byte Items[0x208];
    /* 0x4B0 */ Client::UI::Agent::AgentInspect::FreeCompanyData FreeCompany;
    /* 0x536 */ __int16 UnkObj536;
    /* 0x538 */ unsigned __int32 FetchCharacterDataStatus;
    /* 0x53C */ unsigned __int32 FetchSearchCommentStatus;
    /* 0x540 */ unsigned __int32 FetchFreeCompanyStatus;
    /* 0x544 */ unsigned __int32 UnkObj544;
    /* 0x548 */ Client::UI::Info::InfoProxySearchComment* InfoProxySearchComment;
    /* 0x550 */ Client::UI::Info::InfoProxyFreeCompany* InfoProxyFreeCompany;
};

struct Client::UI::Agent::AgentInspect::ItemData::ColorRGB /* Size=0x0 */
{
    /* 0x0 */ byte B;
    /* 0x1 */ byte G;
    /* 0x2 */ byte R;
};

struct Client::UI::Agent::AgentInspect::ItemData /* Size=0x28 */
{
    /* 0x00 */ unsigned __int32 IconID;
    /* 0x04 */ Client::UI::Agent::AgentInspect::ItemData::IconFlagsTopRight IconFlags1;
    /* 0x05 */ Client::UI::Agent::AgentInspect::ItemData::ColorRGB Color;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /* 0x08 */ bool Filled;
    /* 0x09 */ bool IsILevelSynced;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ __int16 ModelMain[0x4];
    /* 0x18 */ __int16 ModelSub[0x4];
    /* 0x20 */ Client::Game::InventoryItem* Item;
};

struct Client::UI::Agent::AgentInventoryContext /* Size=0x778 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /* 0x028 */ unsigned __int32 BlockingAddonId;
    /* 0x02C */ __int32 ContexItemStartIndex;
    /* 0x030 */ __int32 ContextItemCount;
    /*       */ byte _gap_0x34[0x4];
    /* 0x038 */ byte EventParams[0x620];
    /* 0x658 */ byte EventIdArray[0x54];
    /* 0x6AC */ unsigned __int32 ContextItemDisabledMask;
    /* 0x6B0 */ unsigned __int32 ContextItemSubmenuMask;
    /* 0x6B4 */ __int32 PositionX;
    /* 0x6B8 */ __int32 PositionY;
    /*       */ byte _gap_0x6BC[0x4];
    /*       */ byte _gap_0x6C0[0x8];
    /* 0x6C8 */ unsigned __int32 OwnerAddonId;
    /*       */ byte _gap_0x6CC[0x4];
    /* 0x6D0 */ Client::Game::InventoryType TargetInventoryId;
    /* 0x6D4 */ __int32 TargetInventorySlotId;
    /*       */ byte _gap_0x6D8[0x4];
    /* 0x6DC */ unsigned __int32 DummyInventoryId;
    /*       */ byte _gap_0x6E0[0x8];
    /* 0x6E8 */ Client::Game::InventoryItem* TargetInventorySlot;
    /* 0x6F0 */ Client::Game::InventoryItem TargetDummyItem;
    /* 0x728 */ Client::Game::InventoryType BlockedInventoryId;
    /* 0x72C */ __int32 BlockedInventorySlotId;
    /*       */ byte _gap_0x730[0x8];
    /* 0x738 */ Client::Game::InventoryItem DiscardDummyItem;
    /* 0x770 */ __int32 DialogType;
    /*       */ byte _gap_0x774[0x4];
};

struct Client::UI::Agent::AgentItemDetail /* Size=0x150 */
{
    /* 0x000 */ Component::GUI::AgentInterface AgentInterface;
    /*       */ byte _gap_0x28[0x110];
    /* 0x138 */ unsigned __int32 ItemId;
    /*       */ byte _gap_0x13C[0x4];
    /*       */ byte _gap_0x140[0x10];
};

struct Client::UI::Agent::AgentItemDonationInfo /* Size=0x18 */
{
    /* 0x00 */ void* UnkPtr1;
    /* 0x08 */ void* UnkPtr2;
    /* 0x10 */ void* UnkPtr3;
};

struct Client::UI::Agent::AgentItemSearch /* Size=0x37F0 */
{
    /* 0x0000 */ Component::GUI::AgentInterface AgentInterface;
    /*        */ byte _gap_0x28[0x32D8];
    /*        */ byte _gap_0x3300[0x4];
    /* 0x3304 */ unsigned __int32 ResultItemID;
    /*        */ byte _gap_0x3308[0x4];
    /* 0x330C */ unsigned __int32 ResultSelectedIndex;
    /*        */ byte _gap_0x3310[0x8];
    /*        */ byte _gap_0x3318[0x4];
    /* 0x331C */ unsigned __int32 ResultHoveredIndex;
    /*        */ byte _gap_0x3320[0x4];
    /* 0x3324 */ unsigned __int32 ResultHoveredCount;
    /*        */ byte _gap_0x3328[0x4];
    /* 0x332C */ byte ResultHoveredHQ;
    /*        */ byte _gap_0x332D;
    /*        */ byte _gap_0x332E[0x2];
    /*        */ byte _gap_0x3330[0x4C0];
};

struct StdVector::ClientUIAgentLobbyDataCenterWorldEntry /* Size=0x18 */
{
    /* 0x00 */ Client::UI::Agent::LobbyDataCenterWorldEntry* First;
    /* 0x08 */ Client::UI::Agent::LobbyDataCenterWorldEntry* Last;
    /* 0x10 */ Client::UI::Agent::LobbyDataCenterWorldEntry* End;
};

struct Client::UI::Agent::LobbyUIClient /* Size=0x848 */
{
    /*       */ byte _gap_0x0[0x30];
    /* 0x030 */ StdVector::ClientUIAgentLobbyDataCenterWorldEntry CurrentDataCenterWorlds;
    /* 0x048 */ Client::UI::Agent::LobbySubscriptionInfo* SubscriptionInfo;
    /*       */ byte _gap_0x50[0x7F8];
};

struct Pointer::ClientUIAgentCharaSelectCharacterEntry /* Size=0x8 */
{
    /* 0x0 */ Client::UI::Agent::CharaSelectCharacterEntry* Value;
};

struct StdVector::PointerClientUIAgentCharaSelectCharacterEntry /* Size=0x18 */
{
    /* 0x00 */ Pointer::ClientUIAgentCharaSelectCharacterEntry* First;
    /* 0x08 */ Pointer::ClientUIAgentCharaSelectCharacterEntry* Last;
    /* 0x10 */ Pointer::ClientUIAgentCharaSelectCharacterEntry* End;
};

struct Client::UI::Agent::LobbyData /* Size=0x9C0 */
{
    /* 0x000 */ Client::UI::Agent::AgentLobby* AgentLobby;
    /* 0x008 */ Client::UI::Agent::LobbyUIClient LobbyUIClient;
    /*       */ byte _gap_0x850[0x8];
    /* 0x858 */ StdVector::PointerClientUIAgentCharaSelectCharacterEntry CharaSelectEntries;
    /*       */ byte _gap_0x870[0x150];
};

struct Client::UI::Agent::AgentLobby /* Size=0x1DD0 */
{
    /* 0x0000 */ Component::GUI::AgentInterface AgentInterface;
    /*        */ byte _gap_0x28[0x18];
    /* 0x0040 */ Client::UI::Agent::LobbyData LobbyData;
    /* 0x0A00 */ Client::UI::UIModule* UIModule;
    /*        */ byte _gap_0xA08[0x38];
    /* 0x0A40 */ Component::Excel::ExcelSheet* ErrorSheet;
    /* 0x0A48 */ Component::Excel::ExcelSheet* LobbySheet;
    /*        */ byte _gap_0xA50[0x690];
    /* 0x10E0 */ signed __int8 ServiceAccountIndex;
    /* 0x10E1 */ signed __int8 SelectedCharacterIndex;
    /*        */ byte _gap_0x10E2[0x2];
    /*        */ byte _gap_0x10E4[0x4];
    /* 0x10E8 */ unsigned __int64 SelectedCharacterContentId;
    /* 0x10F0 */ byte DataCenter;
    /*        */ byte _gap_0x10F1;
    /* 0x10F2 */ __int16 WorldIndex;
    /* 0x10F4 */ unsigned __int16 WorldId;
    /*        */ byte _gap_0x10F6[0x2];
    /*        */ byte _gap_0x10F8[0x18];
    /* 0x1110 */ unsigned __int32 IdleTime;
    /*        */ byte _gap_0x1114[0x4];
    /*        */ byte _gap_0x1118[0x110];
    /* 0x1228 */ bool TemporaryLocked;
    /*        */ byte _gap_0x1229;
    /*        */ byte _gap_0x122A[0x2];
    /*        */ byte _gap_0x122C[0x4];
    /*        */ byte _gap_0x1230[0xBA0];
};

struct Client::UI::Agent::AgentLobby::AgentLobbyVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

struct Client::UI::Agent::AgentLoot /* Size=0x90 */
{
    /* 0x00 */ Component::GUI::AgentInterface AgentInterface;
    /*      */ byte _gap_0x28[0x4];
    /* 0x2C */ byte HoveredSlotIndex;
    /*      */ byte _gap_0x2D;
    /*      */ byte _gap_0x2E[0x2];
    /* 0x30 */ unsigned __int32 HoveredItemId;
    /*      */ byte _gap_0x34[0x4];
    /*      */ byte _gap_0x38[0x38];
    /*      */ byte _gap_0x70[0x4];
    /* 0x74 */ __int32 SelectedSlotIndex;
    /*      */ byte _gap_0x78[0x4];
    /* 0x7C */ __int32 NumItems;
    /*      */ byte _gap_0x80[0x10];
};

struct StdPair::SystemUInt32::SystemUInt32 /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 Item1;
    /* 0x4 */ unsigned __int32 Item2;
};

struct StdMap::Node::SystemUInt32::SystemUInt32 /* Size=0x30 */
{
    /* 0x00 */ StdMap::Node::SystemUInt32::SystemUInt32* Left;
    /* 0x08 */ StdMap::Node::SystemUInt32::SystemUInt32* Parent;
    /* 0x10 */ StdMap::Node::SystemUInt32::SystemUInt32* Right;
    /* 0x18 */ byte Color;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ bool IsNil;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ byte _18;
    /* 0x21 */ byte _19;
    /*      */ byte _gap_0x22[0x2];
    /* 0x24 */ StdPair::SystemUInt32::SystemUInt32 KeyValuePair;
    /*      */ byte _gap_0x2C[0x4];
};

struct StdMap::SystemUInt32::SystemUInt32 /* Size=0x10 */
{
    /* 0x00 */ StdMap::Node::SystemUInt32::SystemUInt32* Head;
    /* 0x08 */ unsigned __int64 Count;
};

struct Client::UI::Agent::MapMarkerBase /* Size=0x38 */
{
    /* 0x00 */ byte SubtextOrientation;
    /* 0x01 */ byte SubtextStyle;
    /* 0x02 */ unsigned __int16 IconFlags;
    /* 0x04 */ unsigned __int32 IconId;
    /* 0x08 */ unsigned __int32 SecondaryIconId;
    /* 0x0C */ __int32 Scale;
    /* 0x10 */ byte* Subtext;
    /* 0x18 */ byte Index;
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /*      */ byte _gap_0x1C[0x4];
    /*      */ byte _gap_0x20[0x8];
    /*      */ byte _gap_0x28[0x4];
    /* 0x2C */ __int16 X;
    /* 0x2E */ __int16 Y;
    /*      */ byte _gap_0x30[0x8];
};

struct Client::UI::Agent::FlagMapMarker /* Size=0x48 */
{
    /* 0x00 */ Client::UI::Agent::MapMarkerBase MapMarker;
    /* 0x38 */ unsigned __int32 TerritoryId;
    /* 0x3C */ unsigned __int32 MapId;
    /* 0x40 */ float XFloat;
    /* 0x44 */ float YFloat;
};

struct Client::UI::Agent::AgentMap /* Size=0x11F70 */
{
    /* 0x00000 */ Component::GUI::AgentInterface AgentInterface;
    /*         */ byte _gap_0x28[0xF0];
    /* 0x00118 */ StdMap::SystemUInt32::SystemUInt32 SymbolMap;
    /*         */ byte _gap_0x128[0x30];
    /* 0x00158 */ Client::System::String::Utf8String CurrentMapPath;
    /* 0x001C0 */ Client::System::String::Utf8String SelectedMapPath;
    /* 0x00228 */ Client::System::String::Utf8String SelectedMapBgPath;
    /* 0x00290 */ Client::System::String::Utf8String CurrentMapBgPath;
    /* 0x002F8 */ byte MapSelectionStrings[0x1A0];
    /* 0x00498 */ Client::System::String::Utf8String MapTitleString;
    /*         */ byte _gap_0x500[0x138];
    /* 0x00638 */ byte MapMarkerInfoArray[0x2520];
    /* 0x02B58 */ byte TempMapMarkerArray[0xCC0];
    /* 0x03818 */ Client::UI::Agent::FlagMapMarker FlagMapMarker;
    /* 0x03860 */ byte WarpMarkerArray[0x2A0];
    /* 0x03B00 */ byte UnkArray2[0x3F0];
    /*         */ byte _gap_0x3EF0[0x30];
    /*         */ byte _gap_0x3F20[0x4];
    /*         */ byte _gap_0x3F24[0x2];
    /* 0x03F26 */ byte MiniMapMarkerArray[0x1900];
    /*         */ byte _gap_0x5826[0x2];
    /*         */ byte _gap_0x5828[0x70];
    /* 0x05898 */ float SelectedMapSizeFactorFloat;
    /* 0x0589C */ float CurrentMapSizeFactorFloat;
    /* 0x058A0 */ __int16 SelectedMapSizeFactor;
