// Forward References
struct Application::Network::WorkDefinitions::BeastReputationWork;
struct Application::Network::WorkDefinitions::DailyQuestWork;
struct Application::Network::WorkDefinitions::EnterContentInfo;
struct Application::Network::WorkDefinitions::LeveWork;
struct Application::Network::WorkDefinitions::QuestWork;
struct Application::Network::WorkDefinitions::TrackingWork;
struct Client::Game::ActionManager;
struct Client::Game::ComboDetail;
struct Client::Game::Object::GameObjectID;
struct Client::Game::ActionTimelineDriver;
struct Client::System::Scheduler::Base::SchedulerTimeline;
struct Client::System::Scheduler::Base::TimelineController;
struct Client::System::Scheduler::Base::SchedulerState;
struct Client::Game::ActionTimelineManager;
struct Client::Game::Balloon;
struct Client::System::String::Utf8String;
struct Client::Game::Camera;
struct Client::Game::CameraBase;
struct Client::Graphics::Scene::Camera;
struct Client::Graphics::Scene::Object;
struct Common::Math::Vector3;
struct Common::Math::Quaternion;
struct Common::Math::Matrix4x4;
struct Client::Game::Camera3;
struct Client::Game::Camera4;
struct Client::Game::Character::BattleChara;
struct Client::Game::Character::Character;
struct Client::Game::Object::GameObject;
struct Client::Game::Event::EventId;
struct Client::Game::Character::CharacterData;
struct Client::Game::Control::EmoteController;
struct Client::Game::Character::Character::MountContainer;

enum Component::GUI::ComponentType: byte
{
    Base = 0,
    Button = 1,
    Window = 2,
    CheckBox = 3,
    RadioButton = 4,
    GaugeBar = 5,
    Slider = 6,
    TextInput = 7,
    NumericInput = 8,
    List = 9,
    DropDownList = 10,
    Tab = 11,
    TreeList = 12,
    ScrollBar = 13,
    ListItemRenderer = 14,
    Icon = 15,
    IconText = 16,
    DragDrop = 17,
    GuildLeveCard = 18,
    TextNineGrid = 19,
    JournalCanvas = 20,
    Multipurpose = 21,
    Map = 22,
    Preview = 23,
    HoldButton = 24,
    Portrait = 25
};

enum Component::GUI::FontType: byte
{
    Axis = 0,
    MiedingerMed = 1,
    Miedinger = 2,
    TrumpGothic = 3,
    Jupiter = 4,
    JupiterLarge = 5
};

enum Component::GUI::IconComponentFlags: unsigned __int32
{
    None = 0,
    DyeIcon = 8,
    Macro = 16,
    GlamourIcon = 32,
    Moving = 256,
    Casting = 1024,
    InventoryItem = 2048
};

enum Component::GUI::ImageNodeFlags: __int32
{
    FlipH = 1,
    FlipV = 2,
    AutoFit = 128
};

enum Component::GUI::NodeFlags: unsigned __int16
{
    AnchorTop = 1,
    AnchorLeft = 2,
    AnchorBottom = 4,
    AnchorRight = 8,
    Visible = 16,
    Enabled = 32,
    Clip = 64,
    Fill = 128,
    HasCollision = 256,
    RespondToMouse = 512,
    Focusable = 1024,
    Droppable = 2048,
    IsTopNode = 4096,
    EmitsEvents = 8192,
    UseDepthBasedPriority = 16384,
    UnkFlag2 = 32768
};

enum Component::GUI::NodeType: unsigned __int16
{
    Res = 1,
    Image = 2,
    Text = 3,
    NineGrid = 4,
    Counter = 5,
    Collision = 8,
    UnknownNode10 = 10
};

enum Component::GUI::SimpleTweenState: unsigned __int32
{
    None = 0,
    Tweening = 1,
    Complete = 2
};

enum Component::GUI::SimpleTweenValueType: unsigned __int32
{
    X = 0,
    Y = 1,
    ScaleX = 2,
    ScaleY = 3,
    Scale = 4,
    Alpha = 5,
    Width = 6,
    Height = 7,
    NodeText = 8
};

enum Component::GUI::TextFlags: __int32
{
    AutoAdjustNodeSize = 1,
    Bold = 2,
    Italic = 4,
    Edge = 8,
    Glare = 16,
    Emboss = 32,
    WordWrap = 64,
    MultiLine = 128
};

enum Component::GUI::TextFlags2: __int32
{
    Ellipsis = 4
};

enum Component::GUI::TextInputFlags1: __int32
{
    Capitalize = 1,
    Mask = 2,
    EnableDictionary = 4,
    EnableHistory = 8,
    EnableIME = 16,
    EscapeClears = 32,
    AllowUpperCase = 64,
    AllowLowerCase = 128
};

enum Component::GUI::TextInputFlags2: __int32
{
    AllowNumberInput = 1,
    AllowSymbolInput = 2,
    WordWrap = 4,
    MultiLine = 8,
    AutoMaxWidth = 16
};

enum Component::GUI::TextureType: byte
{
    Resource = 1,
    Crest = 2,
    KernelTexture = 3
};

enum Component::GUI::ValueType: __int32
{
    Bool = 2,
    Int = 3,
    UInt = 4,
    Float = 5,
    String = 6,
    String8 = 8,
    Vector = 9,
    Texture = 10,
    AtkValues = 11,
    AllocatedString = 38,
    AllocatedVector = 41
};

enum Component::SteamApi::SteamCallbackBase::SteamCallbackFlags: byte
{
    Registered = 1,
    GameServer = 2
};


// Definitions
__unaligned struct Application::Network::WorkDefinitions::BeastReputationWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Rank;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 Value;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Application::Network::WorkDefinitions::DailyQuestWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 QuestId;
    /* 0x0A */ byte Flags;
    /*      */ byte _gap_0xB;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Application::Network::WorkDefinitions::EnterContentInfo /* Size=0x28 */
{
    /* 0x00 */ byte NotifyType;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x10];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ unsigned __int16 ContentFinderConditionId;
    /*      */ byte _gap_0x1E[0x2];
    /*      */ byte _gap_0x20[0x8];
};

__unaligned struct Application::Network::WorkDefinitions::LeveWork /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 LeveId;
    /* 0x0A */ byte Sequence;
    /*      */ byte _gap_0xB;
    /* 0x0C */ unsigned __int16 Flags;
    /* 0x0E */ unsigned __int16 LeveSeed;
    /* 0x10 */ byte ClearClass;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Application::Network::WorkDefinitions::QuestWork /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 QuestId;
    /* 0x0A */ byte Sequence;
    /* 0x0B */ byte Flags;
    /* 0x0C */ byte Variables[0x6];
    /* 0x12 */ byte AcceptClassJob;
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Application::Network::WorkDefinitions::TrackingWork /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte QuestType;
    /* 0x09 */ byte Index;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::ComboDetail /* Size=0x8 */
{
    /* 0x0 */ float Timer;
    /* 0x4 */ unsigned __int32 Action;
};

__unaligned struct Client::Game::Object::GameObjectID /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectID;
    /* 0x4 */ byte Type;
    /*     */ byte _gap_0x5;
    /*     */ byte _gap_0x6[0x2];
};

__unaligned struct Client::Game::ActionManager /* Size=0x7F0 */
{
    /*       */ byte _gap_0x0[0x60];
    /* 0x060 */ Client::Game::ComboDetail Combo;
    /* 0x068 */ bool ActionQueued;
    /*       */ byte _gap_0x69;
    /*       */ byte _gap_0x6A[0x2];
    /* 0x06C */ Client::Game::ActionType QueuedActionType;
    /*       */ byte _gap_0x6D;
    /*       */ byte _gap_0x6E[0x2];
    /* 0x070 */ unsigned __int32 QueuedActionId;
    /*       */ byte _gap_0x74[0x4];
    /* 0x078 */ Client::Game::Object::GameObjectID QueuedTargetId;
    /* 0x080 */ unsigned __int32 QueueType;
    /*       */ byte _gap_0x84[0x4];
    /*       */ byte _gap_0x88[0xB0];
    /*       */ byte _gap_0x138[0x4];
    /* 0x13C */ unsigned __int32 BlueMageActions[0x18];
    /*       */ byte _gap_0x19C[0x4];
    /*       */ byte _gap_0x1A0[0x650];
};

__unaligned struct Client::System::Scheduler::Base::SchedulerState /* Size=0x18 */
{
    /* 0x00 */ void** vtbl;
    /*      */ byte _gap_0x8[0x10];
};

__unaligned struct Client::System::Scheduler::Base::TimelineController /* Size=0x80 */
{
    /* 0x00 */ Client::System::Scheduler::Base::SchedulerState SchedulerState;
    /*      */ byte _gap_0x18[0x18];
    /*      */ byte _gap_0x30[0x4];
    /* 0x34 */ float CurrentTimestamp;
    /*      */ byte _gap_0x38[0x48];
};

__unaligned struct Client::System::Scheduler::Base::SchedulerTimeline /* Size=0x280 */
{
    union {
    /* 0x000 */ Client::System::Scheduler::Base::TimelineController TimelineController;
    /* 0x000 */ Client::System::Scheduler::Base::SchedulerTimeline::SchedulerTimelineVTable* VTable;
    } _union_0x0;
    /*       */ byte _gap_0x80[0x18];
    /* 0x098 */ Client::System::Scheduler::Resource::SchedulerResource* SchedulerResource;
    /*       */ byte _gap_0xA0[0x8];
    /* 0x0A8 */ byte* ActionTimelineKey;
    /* 0x0B0 */ byte* FaceLibraryPath;
    /*       */ byte _gap_0xB8[0xD0];
    /*       */ byte _gap_0x188[0x4];
    /* 0x18C */ unsigned __int32 OwningGameObjectIndex;
    /*       */ byte _gap_0x190[0xF0];
};

__unaligned struct Client::Game::ActionTimelineDriver /* Size=0x1F0 */
{
    /*       */ byte _gap_0x0[0x70];
    /* 0x070 */ Client::System::Scheduler::Base::SchedulerTimeline** SchedulerTimelines[0xE];
    /* 0x0E0 */ unsigned __int16 TimelineIds[0xE];
    /*       */ byte _gap_0xFC[0x4];
    /*       */ byte _gap_0x100[0x50];
    /*       */ byte _gap_0x150[0x4];
    /* 0x154 */ float TimelineSpeeds[0xE];
    /*       */ byte _gap_0x18C[0x4];
    /*       */ byte _gap_0x190[0x38];
    /* 0x1C8 */ Client::Game::Character::Character* Parent;
    /*       */ byte _gap_0x1D0[0x20];
};

__unaligned struct Client::Game::ActionTimelineManager /* Size=0x340 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ Client::Game::Character::Character* Parent;
    /* 0x010 */ Client::Game::ActionTimelineDriver Driver;
    /*       */ byte _gap_0x200[0xC0];
    /*       */ byte _gap_0x2C0[0x4];
    /* 0x2C4 */ float OverallSpeed;
    /*       */ byte _gap_0x2C8[0x18];
    /* 0x2E0 */ unsigned __int16 BaseOverride;
    /* 0x2E2 */ unsigned __int16 LipsOverride;
    /*       */ byte _gap_0x2E4[0x4];
    /*       */ byte _gap_0x2E8[0x18];
    /* 0x300 */ __int64 BannerTimelineSheet;
    /* 0x308 */ __int64 BannerTimelineRowDescriptor;
    /* 0x310 */ unsigned __int16 BannerTimelineRowId;
    /* 0x312 */ byte BannerFacialRowId;
    /*       */ byte _gap_0x313;
    /*       */ byte _gap_0x314[0x4];
    /* 0x318 */ float BannerRequestStartTimestamp;
    /*       */ byte _gap_0x31C[0x4];
    /*       */ byte _gap_0x320[0x8];
    /* 0x328 */ unsigned __int32 BannerTimelineNameOffset;
    /* 0x32C */ unsigned __int32 BannerTimelineAdditionalData;
    /* 0x330 */ unsigned __int32 BannerTimelineIcon;
    /* 0x334 */ unsigned __int16 BannerTimelineUnlockCondition;
    /* 0x336 */ unsigned __int16 BannerTimelineSortKey;
    /* 0x338 */ byte BannerTimelineType;
    /* 0x339 */ byte BannerTimelineAcceptClassJobCategory;
    /* 0x33A */ byte BannerTimelineCategory;
    /*       */ byte _gap_0x33B;
    /*       */ byte _gap_0x33C[0x2];
    /* 0x33E */ byte Flags1;
    /* 0x33F */ byte Flags2;
};

__unaligned struct Client::System::String::Utf8String /* Size=0x68 */
{
    /* 0x00 */ byte* StringPtr;
    /* 0x08 */ __int64 BufSize;
    /* 0x10 */ __int64 BufUsed;
    /* 0x18 */ __int64 StringLength;
    /* 0x20 */ byte IsEmpty;
    /* 0x21 */ byte IsUsingInlineBuffer;
    /* 0x22 */ byte InlineBuffer[0x40];
    /*      */ byte _gap_0x62[0x2];
    /*      */ byte _gap_0x64[0x4];
};

__unaligned struct Client::Game::Balloon /* Size=0x80 */
{
    /* 0x00 */ unsigned __int16 DefaultBalloonId;
    /* 0x02 */ unsigned __int16 NowPlayingBalloonId;
    /* 0x04 */ float PlayTimer;
    /* 0x08 */ Client::Game::BalloonType Type;
    /* 0x0C */ Client::Game::BalloonState State;
    /* 0x10 */ Client::System::String::Utf8String Text;
    /* 0x78 */ byte UnkBool;
    /*      */ byte _gap_0x79;
    /*      */ byte _gap_0x7A[0x2];
    /*      */ byte _gap_0x7C[0x4];
};

__unaligned struct Common::Math::Vector3 /* Size=0x10 */
{
    /* 0x00 */ float X;
    /* 0x04 */ float Y;
    /* 0x08 */ float Z;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Common::Math::Quaternion /* Size=0x10 */
{
    /* 0x00 */ float X;
    /* 0x04 */ float Y;
    /* 0x08 */ float Z;
    /* 0x0C */ float W;
};

__unaligned struct Client::Graphics::Scene::Object /* Size=0x80 */
{
    /* 0x00 */ Client::Graphics::Scene::Object::ObjectVTable* VTable;
    /*      */ byte _gap_0x8[0x10];
    /* 0x18 */ Client::Graphics::Scene::Object* ParentObject;
    /* 0x20 */ Client::Graphics::Scene::Object* PreviousSiblingObject;
    /* 0x28 */ Client::Graphics::Scene::Object* NextSiblingObject;
    /* 0x30 */ Client::Graphics::Scene::Object* ChildObject;
    /*      */ byte _gap_0x38[0x18];
    /* 0x50 */ Common::Math::Vector3 Position;
    /* 0x60 */ Common::Math::Quaternion Rotation;
    /* 0x70 */ Common::Math::Vector3 Scale;
};

__unaligned struct Common::Math::Matrix4x4 /* Size=0x40 */
{
    /* 0x00 */ float M11;
    /* 0x04 */ float M12;
    /* 0x08 */ float M13;
    /* 0x0C */ float M14;
    /* 0x10 */ float M21;
    /* 0x14 */ float M22;
    /* 0x18 */ float M23;
    /* 0x1C */ float M24;
    /* 0x20 */ float M31;
    /* 0x24 */ float M32;
    /* 0x28 */ float M33;
    /* 0x2C */ float M34;
    /* 0x30 */ float M41;
    /* 0x34 */ float M42;
    /* 0x38 */ float M43;
    /* 0x3C */ float M44;
};

__unaligned struct Client::Graphics::Scene::Camera /* Size=0xF0 */
{
    /* 0x00 */ Client::Graphics::Scene::Object Object;
    /* 0x80 */ Common::Math::Vector3 LookAtVector;
    /* 0x90 */ Common::Math::Vector3 Vector_1;
    /* 0xA0 */ Common::Math::Matrix4x4 ViewMatrix;
    /* 0xE0 */ Client::Graphics::Render::Camera* RenderCamera;
    /*      */ byte _gap_0xE8[0x8];
};

__unaligned struct Client::Game::CameraBase /* Size=0x110 */
{
    /* 0x000 */ void** vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Client::Graphics::Scene::Camera SceneCamera;
    /* 0x100 */ unsigned __int32 UnkUInt;
    /*       */ byte _gap_0x104[0x4];
    /* 0x108 */ unsigned __int32 UnkFlags;
    /*       */ byte _gap_0x10C[0x4];
};

__unaligned struct Client::Game::Camera /* Size=0x2B0 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /*       */ byte _gap_0x110[0x4];
    /* 0x114 */ float Distance;
    /* 0x118 */ float MinDistance;
    /* 0x11C */ float MaxDistance;
    /* 0x120 */ float FoV;
    /* 0x124 */ float MinFoV;
    /* 0x128 */ float MaxFoV;
    /*       */ byte _gap_0x12C[0x4];
    /*       */ byte _gap_0x130[0x48];
    /*       */ byte _gap_0x178[0x4];
    /* 0x17C */ float InterpDistance;
    /*       */ byte _gap_0x180[0x8];
    /* 0x188 */ float SavedDistance;
    /*       */ byte _gap_0x18C[0x4];
    /*       */ byte _gap_0x190[0x120];
};

__unaligned struct Client::Game::Camera3 /* Size=0x300 */
{
    /* 0x000 */ Client::Game::Camera Camera;
    /*       */ byte _gap_0x2B0[0x50];
};

__unaligned struct Client::Game::Camera4 /* Size=0x350 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /* 0x110 */ Client::Graphics::Scene::Camera SceneCamera0;
    /* 0x200 */ Client::Graphics::Scene::Camera SceneCamera1;
    /*       */ byte _gap_0x2F0[0x60];
};

__unaligned struct Client::Game::Event::EventId /* Size=0x4 */
{
    union {
    /* 0x0 */ unsigned __int32 Id;
    struct {
    /* 0x0 */ unsigned __int16 EntryId;
    /* 0x2 */ Client::Game::Event::EventHandlerStructType Type;
    } _union_struct_0x0;
    } _union_0x0;
};

__unaligned struct Client::Game::Object::GameObject /* Size=0x1A0 */
{
    /* 0x000 */ Client::Game::Object::GameObject::GameObjectVTable* VTable;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Common::Math::Vector3 DefaultPosition;
    /* 0x020 */ float DefaultRotation;
    /*       */ byte _gap_0x24[0x4];
    /*       */ byte _gap_0x28[0x8];
    /* 0x030 */ byte Name[0x40];
    /*       */ byte _gap_0x70[0x4];
    /* 0x074 */ unsigned __int32 ObjectID;
    /* 0x078 */ unsigned __int32 LayoutID;
    /*       */ byte _gap_0x7C[0x4];
    /* 0x080 */ unsigned __int32 DataID;
    /* 0x084 */ unsigned __int32 OwnerID;
    /* 0x088 */ unsigned __int16 ObjectIndex;
    /*       */ byte _gap_0x8A[0x2];
    /* 0x08C */ byte ObjectKind;
    /* 0x08D */ byte SubKind;
    /* 0x08E */ byte Gender;
    /*       */ byte _gap_0x8F;
    /* 0x090 */ byte YalmDistanceFromPlayerX;
    /* 0x091 */ byte TargetStatus;
    /* 0x092 */ byte YalmDistanceFromPlayerZ;
    /*       */ byte _gap_0x93;
    /*       */ byte _gap_0x94;
    /* 0x095 */ Client::Game::Object::ObjectTargetableFlags TargetableStatus;
    /*       */ byte _gap_0x96[0x2];
    /*       */ byte _gap_0x98[0x18];
    /* 0x0B0 */ Common::Math::Vector3 Position;
    /* 0x0C0 */ float Rotation;
    /* 0x0C4 */ float Scale;
    /* 0x0C8 */ float Height;
    /* 0x0CC */ float VfxScale;
    /* 0x0D0 */ float HitboxRadius;
    /*       */ byte _gap_0xD4[0x4];
    /*       */ byte _gap_0xD8[0x8];
    /* 0x0E0 */ Common::Math::Vector3 DrawOffset;
    /*       */ byte _gap_0xF0[0x4];
    /* 0x0F4 */ Client::Game::Event::EventId EventId;
    /* 0x0F8 */ unsigned __int32 FateId;
    /*       */ byte _gap_0xFC[0x4];
    /* 0x100 */ Client::Graphics::Scene::DrawObject* DrawObject;
    /*       */ byte _gap_0x108[0x8];
    /* 0x110 */ unsigned __int32 NamePlateIconId;
    /* 0x114 */ __int32 RenderFlags;
    /*       */ byte _gap_0x118[0x40];
    /* 0x158 */ Client::Game::Event::LuaActor* LuaActor;
    /*       */ byte _gap_0x160[0x40];
};

__unaligned struct Client::Game::Character::CharacterData /* Size=0x68 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ float ModelScale;
    /* 0x0C */ __int32 ModelCharaId;
    /* 0x10 */ __int32 ModelSkeletonId;
    /* 0x14 */ __int32 ModelCharaId_2;
    /* 0x18 */ __int32 ModelSkeletonId_2;
    /* 0x1C */ unsigned __int32 Health;
    /* 0x20 */ unsigned __int32 MaxHealth;
    /* 0x24 */ unsigned __int32 Mana;
    /* 0x28 */ unsigned __int32 MaxMana;
    /* 0x2C */ unsigned __int16 GatheringPoints;
    /* 0x2E */ unsigned __int16 MaxGatheringPoints;
    /* 0x30 */ unsigned __int16 CraftingPoints;
    /* 0x32 */ unsigned __int16 MaxCraftingPoints;
    /* 0x34 */ __int16 TransformationId;
    /* 0x36 */ unsigned __int16 TitleID;
    /*      */ byte _gap_0x38[0x2];
    /* 0x3A */ byte ClassJob;
    /* 0x3B */ byte Level;
    /*      */ byte _gap_0x3C[0x4];
    /*      */ byte _gap_0x40[0x4];
    /*      */ byte _gap_0x44[0x2];
    /* 0x46 */ byte ShieldValue;
    /*      */ byte _gap_0x47;
    /* 0x48 */ byte OnlineStatus;
    /* 0x49 */ byte Battalion;
    /*      */ byte _gap_0x4A;
    /* 0x4B */ byte Flags1;
    /* 0x4C */ byte Flags2;
    /* 0x4D */ byte CombatTagType;
    /*      */ byte _gap_0x4E[0x2];
    /* 0x50 */ Client::Game::Object::GameObjectID CombatTaggerId;
    /*      */ byte _gap_0x58[0x10];
};

__unaligned struct Client::Game::Control::EmoteController /* Size=0x40 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ unsigned __int16 EmoteId;
    /* 0x16 */ unsigned __int16 Unk1;
    /* 0x18 */ Client::Game::Object::GameObjectID Target;
    /*      */ byte _gap_0x20;
    /* 0x21 */ byte CPoseState;
    /*      */ byte _gap_0x22[0x2];
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x18];
};

__unaligned struct Client::Game::Character::Character::MountContainer /* Size=0x68 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Character* MountObject;
    /* 0x18 */ unsigned __int16 MountId;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ float DismountTimer;
    /* 0x20 */ byte Flags;
    /*      */ byte _gap_0x21;
    /*      */ byte _gap_0x22[0x2];
    /* 0x24 */ unsigned __int32 MountedObjectIds[0x7];
    /*      */ byte _gap_0x40[0x28];
};

__unaligned struct Client::Game::Character::Character::CompanionContainer /* Size=0x20 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Companion* CompanionObject;
    /* 0x18 */ unsigned __int16 CompanionId;
    /*      */ byte _gap_0x1A[0x2];
    /*      */ byte _gap_0x1C[0x4];
};

__unaligned struct Client::Game::Character::WeaponModelId /* Size=0x8 */
{
    union {
    struct {
    /* 0x0 */ unsigned __int16 Id;
    /* 0x2 */ unsigned __int16 Type;
    /* 0x4 */ unsigned __int16 Variant;
    /* 0x6 */ byte Stain;
    } _union_struct_0x0;
    /* 0x0 */ unsigned __int64 Value;
    } _union_0x0;
};

__unaligned struct Client::Game::Character::DrawObjectData /* Size=0x70 */
{
    /* 0x00 */ Client::Game::Character::WeaponModelId ModelId;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ void** VTable;
    /* 0x18 */ Client::Graphics::Scene::DrawObject* DrawObject;
    /*      */ byte _gap_0x20[0x40];
    /* 0x60 */ byte State;
    /*      */ byte _gap_0x61;
    /* 0x62 */ unsigned __int16 Flags1;
    /* 0x64 */ byte Flags2;
    /*      */ byte _gap_0x65;
    /*      */ byte _gap_0x66[0x2];
    /*      */ byte _gap_0x68[0x8];
};

__unaligned struct Client::Game::Character::EquipmentModelId /* Size=0x4 */
{
    union {
    struct {
    /* 0x0 */ unsigned __int16 Id;
    /* 0x2 */ byte Variant;
    /* 0x3 */ byte Stain;
    } _union_struct_0x0;
    /* 0x0 */ unsigned __int32 Value;
    } _union_0x0;
};

__unaligned struct Client::Game::Character::CustomizeData /* Size=0x1A */
{
    union {
    /* 0x00 */ byte Data[0x1A];
    struct {
    /* 0x00 */ byte Race;
    /* 0x01 */ byte Sex;
    /* 0x02 */ byte BodyType;
    /* 0x04 */ byte Clan;
    /* 0x14 */ byte LipColorFurPattern;
    } _union_struct_0x0;
    } _union_0x0;
};

__unaligned struct Client::Game::Character::DrawDataContainer /* Size=0x1A8 */
{
    /* 0x000 */ void** Vtable;
    /* 0x008 */ Client::Game::Character::Character* Parent;
    /* 0x010 */ Client::Game::Character::DrawObjectData WeaponData[0x3];
    /* 0x160 */ Client::Game::Character::EquipmentModelId Head;
    /* 0x164 */ Client::Game::Character::EquipmentModelId Top;
    /* 0x168 */ Client::Game::Character::EquipmentModelId Arms;
    /* 0x16C */ Client::Game::Character::EquipmentModelId Legs;
    /* 0x170 */ Client::Game::Character::EquipmentModelId Feet;
    /* 0x174 */ Client::Game::Character::EquipmentModelId Ear;
    /* 0x178 */ Client::Game::Character::EquipmentModelId Neck;
    /* 0x17C */ Client::Game::Character::EquipmentModelId Wrist;
    /* 0x180 */ Client::Game::Character::EquipmentModelId RFinger;
    /* 0x184 */ Client::Game::Character::EquipmentModelId LFinger;
    /* 0x188 */ Client::Game::Character::CustomizeData CustomizeData;
    /* 0x1A2 */ unsigned __int32 Unk18A;
    /* 0x1A6 */ byte Flags1;
    /* 0x1A7 */ byte Flags2;
};

__unaligned struct Client::Game::Character::Character::OrnamentContainer /* Size=0x78 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ Client::Game::Character::Ornament* OrnamentObject;
    /* 0x18 */ unsigned __int16 OrnamentId;
    /*      */ byte _gap_0x1A[0x2];
    /*      */ byte _gap_0x1C[0x4];
    /*      */ byte _gap_0x20[0x58];
};

__unaligned struct Client::Game::Character::Character::ReaperShroudContainer /* Size=0x50 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ void** VfxListenerVTable;
    /* 0x18 */ unsigned __int16 StanceChangeId;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ unsigned __int32 StanceChangeState;
    /* 0x20 */ float Timer;
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ void* CopyObject;
    /* 0x30 */ Client::Game::Character::Character::ReaperShroudContainer::ShroudFlags Flags;
    /*      */ byte _gap_0x34[0x4];
    /*      */ byte _gap_0x38[0x4];
    /* 0x3C */ unsigned __int16 NpcEquipId;
    /*      */ byte _gap_0x3E[0x2];
    /* 0x40 */ Client::Graphics::Vfx::VfxData* Vfx;
    /*      */ byte _gap_0x48[0x8];
};

__unaligned struct Client::Game::Control::GazeController::Gaze::TargetInformation /* Size=0x28 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Client::Game::Control::GazeController::Gaze::TargetInformation::TargetInfoType Type;
    /*      */ byte _gap_0xC[0x4];
    union {
    /* 0x10 */ Client::Game::Object::GameObjectID TargetId;
    /* 0x10 */ Common::Math::Vector3 Unk10;
    } _union_0x10;
    /* 0x20 */ __int32 Unk20;
    /*      */ byte _gap_0x24[0x4];
};

__unaligned struct Client::Game::Control::GazeController::Gaze /* Size=0x1E0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ Client::Game::Control::GazeController::Gaze::TargetInformation TargetInfo;
    /*       */ byte _gap_0x38[0x1A8];
};

__unaligned struct Client::Game::Control::GazeController /* Size=0x5E0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ Client::Game::Character::BattleChara* OwnerObject;
    /*       */ byte _gap_0x18[0x8];
    /* 0x020 */ Client::Game::Control::GazeController::Gaze Gazes[0x3];
    /*       */ byte _gap_0x5C0[0x4];
    /* 0x5C4 */ __int32 GazesCount;
    /*       */ byte _gap_0x5C8[0x18];
};

__unaligned struct Common::Math::Vector2 /* Size=0x8 */
{
    /* 0x0 */ float X;
    /* 0x4 */ float Y;
};

__unaligned struct Client::Game::Character::Character::GazeContainer /* Size=0x620 */
{
    /* 0x000 */ void** ContainerVTable;
    /* 0x008 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x010 */ Client::Game::Control::GazeController Controller;
    /* 0x5F0 */ Common::Math::Vector3 CameraVector;
    /* 0x600 */ byte FaceCameraFlag;
    /*       */ byte _gap_0x601;
    /*       */ byte _gap_0x602[0x2];
    /* 0x604 */ Common::Math::Vector2 BannerHeadDirection;
    /* 0x60C */ Common::Math::Vector2 BannerEyeDirection;
    /* 0x614 */ Client::Game::Character::Character::GazeContainer::BannerCameraFollowFlags BannerCameraFollowFlag;
    /*       */ byte _gap_0x615;
    /*       */ byte _gap_0x616[0x2];
    /*       */ byte _gap_0x618[0x8];
};

__unaligned struct Client::Game::Character::Character::VfxContainer /* Size=0xF0 */
{
    /* 0x00 */ void** ContainerVTable;
    /* 0x08 */ Client::Game::Character::BattleChara* OwnerObject;
    /* 0x10 */ void** VfxListenerVTable;
    /* 0x18 */ Client::Graphics::Vfx::VfxData* VfxData;
    /* 0x20 */ Client::Graphics::Vfx::VfxData* VfxData2;
    /*      */ byte _gap_0x28[0x20];
    /* 0x48 */ Client::Graphics::Vfx::VfxData* Omen;
    /*      */ byte _gap_0x50[0x80];
    /* 0xD0 */ unsigned __int16 VoiceId;
    /*      */ byte _gap_0xD2[0x2];
    /*      */ byte _gap_0xD4[0x4];
    /*      */ byte _gap_0xD8[0x18];
};

__unaligned struct Client::Game::Character::CharacterSetup /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x18];
};

__unaligned struct Client::Game::Character::Character /* Size=0x1BD0 */
{
    union {
    /* 0x0000 */ Client::Game::Object::GameObject GameObject;
    /* 0x0000 */ Client::Game::Character::Character::CharacterVTable* VTable;
    } _union_0x0;
    /* 0x01A0 */ Client::Game::Character::CharacterData CharacterData;
    /*        */ byte _gap_0x208[0x8];
    /* 0x0210 */ byte MovementBytes[0x420];
    /* 0x0630 */ Client::Game::Control::EmoteController EmoteController;
    /* 0x0670 */ Client::Game::Character::Character::MountContainer Mount;
    /* 0x06D8 */ Client::Game::Character::Character::CompanionContainer Companion;
    /* 0x06F8 */ Client::Game::Character::DrawDataContainer DrawData;
    /* 0x08A0 */ Client::Game::Character::Character::OrnamentContainer Ornament;
    /* 0x0918 */ Client::Game::Character::Character::ReaperShroudContainer ReaperShroud;
    /*        */ byte _gap_0x968[0x8];
    /* 0x0970 */ Client::Game::ActionTimelineManager ActionTimelineManager;
    /* 0x0CB0 */ Client::Game::Character::Character::GazeContainer Gaze;
    /*        */ byte _gap_0x12D0[0x20];
    /* 0x12F0 */ Client::Game::Character::Character::VfxContainer Vfx;
    /*        */ byte _gap_0x13E0[0x30];
    /* 0x1410 */ byte StatusFlags4;
    /*        */ byte _gap_0x1411;
    /*        */ byte _gap_0x1412[0x2];
    /*        */ byte _gap_0x1414[0x4];
    /* 0x1418 */ Client::Game::Character::CharacterSetup CharacterSetup;
    /*        */ byte _gap_0x1430[0x4F0];
    /* 0x1920 */ Client::Game::Balloon Balloon;
    /*        */ byte _gap_0x19A0[0x188];
    /* 0x1B28 */ float Alpha;
    /*        */ byte _gap_0x1B2C[0x4];
    /* 0x1B30 */ Client::Game::Character::Companion* CompanionObject;
    /*        */ byte _gap_0x1B38[0x8];
    /* 0x1B40 */ byte FreeCompanyTag[0x6];
    /*        */ byte _gap_0x1B46[0x2];
    /*        */ byte _gap_0x1B48[0x10];
    /* 0x1B58 */ Client::Game::Object::GameObjectID TargetId;
    /* 0x1B60 */ Client::Game::Object::GameObjectID SoftTargetId;
    /*        */ byte _gap_0x1B68[0x30];
    /* 0x1B98 */ unsigned __int32 NameID;
    /*        */ byte _gap_0x1B9C[0x4];
    /*        */ byte _gap_0x1BA0[0x8];
    /* 0x1BA8 */ unsigned __int32 CompanionOwnerID;
    /*        */ byte _gap_0x1BAC[0x4];
    /* 0x1BB0 */ unsigned __int16 CurrentWorld;
    /* 0x1BB2 */ unsigned __int16 HomeWorld;
    /*        */ byte _gap_0x1BB4[0x2];
    union {
    /* 0x1BB6 */ byte EventState;
    /* 0x1BB6 */ Client::Game::Character::Character::CharacterModes Mode;
    } _union_0x1BB6;
    /* 0x1BB7 */ byte ModeParam;
    /*        */ byte _gap_0x1BB8[0x2];
    /*        */ byte _gap_0x1BBA;
    /* 0x1BBB */ byte FreeCompanyCrestBitfield;
    /*        */ byte _gap_0x1BBC[0x4];
    /*        */ byte _gap_0x1BC0;
    /* 0x1BC1 */ byte StatusFlags3;
    /*        */ byte _gap_0x1BC2[0x2];
    /*        */ byte _gap_0x1BC4[0x4];
    /*        */ byte _gap_0x1BC8[0x8];
};

__unaligned struct Client::Game::Character::BattleChara /* Size=0x2F80 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /*        */ byte _gap_0x1BD0[0x13B0];
};

__unaligned struct Client::Game::Character::Character::CastInfo /* Size=0x170 */
{
    /* 0x000 */ byte IsCasting;
    /* 0x001 */ byte Interruptible;
    /* 0x002 */ Client::Game::ActionType ActionType;
    /*       */ byte _gap_0x3;
    /* 0x004 */ unsigned __int32 ActionID;
    /* 0x008 */ unsigned __int32 Unk_08;
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ unsigned __int32 CastTargetID;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x8];
    /* 0x020 */ Common::Math::Vector3 CastLocation;
    /* 0x030 */ unsigned __int32 Unk_30;
    /* 0x034 */ float CurrentCastTime;
    /* 0x038 */ float TotalCastTime;
    /* 0x03C */ float AdjustedTotalCastTime;
    /* 0x040 */ unsigned __int32 UsedActionId;
    /* 0x044 */ Client::Game::ActionType UsedActionType;
    /*       */ byte _gap_0x45;
    /*       */ byte _gap_0x46[0x2];
    /*       */ byte _gap_0x48[0x10];
    /* 0x058 */ unsigned __int64 ActionRecipientsObjectIdArray[0x20];
    /* 0x158 */ __int32 ActionRecipientsCount;
    /*       */ byte _gap_0x15C[0x4];
    /*       */ byte _gap_0x160[0x10];
};

__unaligned struct Client::Game::Status /* Size=0xC */
{
    /* 0x0 */ unsigned __int16 StatusID;
    union {
    /* 0x2 */ unsigned __int16 Param;
    /* 0x2 */ byte StackCount;
    } _union_0x2;
    /* 0x4 */ float RemainingTime;
    /* 0x8 */ unsigned __int32 SourceID;
};

__unaligned struct Client::Game::StatusManager /* Size=0x2F0 */
{
    /* 0x000 */ Client::Game::Character::Character* Owner;
    /* 0x008 */ Client::Game::Status Status[0x3C];
    /* 0x2D8 */ unsigned __int32 Flags1;
    /* 0x2DC */ unsigned __int16 Flags2;
    /*       */ byte _gap_0x2DE[0x2];
    /* 0x2E0 */ __int64 Unk_178;
    /* 0x2E8 */ byte NumValidStatuses;
    /*       */ byte _gap_0x2E9;
    /*       */ byte _gap_0x2EA[0x2];
    /*       */ byte _gap_0x2EC[0x4];
};

__unaligned struct Client::Game::Character::Character::ForayInfo /* Size=0x2 */
{
    /* 0x0 */ byte ForayRank;
    /* 0x1 */ Client::Game::Character::Character::EurekaElement Element;
};

__unaligned struct Client::Game::Character::Character::CharacterVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /*     */ __int64 _vf38;
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /*     */ __int64 _vf47;
    /*     */ __int64 _vf48;
    /*     */ __int64 _vf49;
    /*     */ __int64 _vf50;
    /*     */ __int64 _vf51;
    /*     */ __int64 _vf52;
    /*     */ __int64 _vf53;
    /*     */ __int64 _vf54;
    /*     */ __int64 _vf55;
    /*     */ __int64 _vf56;
    /*     */ __int64 _vf57;
    /*     */ __int64 _vf58;
    /*     */ __int64 _vf59;
    /*     */ __int64 _vf60;
    /*     */ __int64 _vf61;
    /*     */ __int64 _vf62;
    /*     */ __int64 _vf63;
    /*     */ __int64 _vf64;
    /*     */ __int64 _vf65;
    /*     */ __int64 _vf66;
    /*     */ __int64 _vf67;
    /*     */ __int64 _vf68;
    /*     */ __int64 _vf69;
    /*     */ __int64 _vf70;
    /*     */ __int64 _vf71;
    /*     */ __int64 _vf72;
    /*     */ __int64 _vf73;
    /*     */ __int64 _vf74;
    /*     */ __int64 _vf75;
    /*     */ __int64 _vf76;
    /*     */ __int64 _vf77;
    /*     */ __int64 _vf78;
    /* 0x278 */ Client::Game::StatusManager* (__fastcall *GetStatusManager)(Client::Game::Character::Character* a1);
    /*     */ __int64 _vf80;
    /* 0x288 */ Client::Game::Character::Character::CastInfo* (__fastcall *GetCastInfo)(Client::Game::Character::Character* a1);
    /*     */ __int64 _vf82;
    /*     */ __int64 _vf83;
    /*     */ __int64 _vf84;
    /* 0x2A8 */ Client::Game::Character::Character::ForayInfo* (__fastcall *GetForayInfo)(Client::Game::Character::Character* a1);
    /*     */ __int64 _vf86;
    /* 0x2B8 */ bool (__fastcall *IsMount)(Client::Game::Character::Character* a1);
};

__unaligned struct Client::Game::Character::CharacterManager /* Size=0x338 */
{
    /* 0x000 */ Client::Game::Character::BattleChara* BattleCharaList[0x64];
    /* 0x320 */ Client::Game::Character::BattleChara* BattleCharaMemory;
    /* 0x328 */ Client::Game::Character::Companion* CompanionMemory;
    /* 0x330 */ __int32 CompanionClassSize;
    /* 0x334 */ __int32 UpdateIndex;
};

__unaligned struct Client::Game::Character::Companion /* Size=0x1C90 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /*        */ byte _gap_0x1BD0[0xC0];
};

__unaligned struct Client::Game::Character::Ornament /* Size=0x1BF0 */
{
    /* 0x0000 */ Client::Game::Character::Character Character;
    /* 0x1BD0 */ unsigned __int32 OrnamentId;
    /* 0x1BD4 */ byte AttachmentPoint;
    /*        */ byte _gap_0x1BD5;
    /*        */ byte _gap_0x1BD6[0x2];
    /*        */ byte _gap_0x1BD8[0x18];
};

__unaligned struct Client::Game::Conditions /* Size=0x68 */
{
    /* 0x00 */ bool Flags[0x68];
};

__unaligned struct Client::Game::Control::CameraManager /* Size=0x180 */
{
    /* 0x000 */ Client::Game::Camera* Camera;
    /* 0x008 */ Client::Game::LowCutCamera* LowCutCamera;
    /* 0x010 */ Client::Game::LobbyCamera* LobbCamera;
    /* 0x018 */ Client::Game::Camera3* Camera3;
    /* 0x020 */ Client::Game::Camera4* Camera4;
    /*       */ byte _gap_0x28[0x20];
    /* 0x048 */ __int32 ActiveCameraIndex;
    /* 0x04C */ __int32 PreviousCameraIndex;
    /*       */ byte _gap_0x50[0x10];
    /* 0x060 */ Client::Game::CameraBase UnkCamera;
    /*       */ byte _gap_0x170[0x10];
};

__unaligned struct Client::Game::Control::GameObjectArray /* Size=0x12C0 */
{
    /* 0x0000 */ __int32 Length;
    /*        */ byte _gap_0x4[0x4];
    /* 0x0008 */ unsigned __int64 Objects[0x257];
};

__unaligned struct Client::Game::Control::TargetSystem /* Size=0x5370 */
{
    /*        */ byte _gap_0x0[0x80];
    /* 0x0080 */ Client::Game::Object::GameObject* Target;
    /* 0x0088 */ Client::Game::Object::GameObject* SoftTarget;
    /*        */ byte _gap_0x90[0x8];
    /* 0x0098 */ Client::Game::Object::GameObject* GPoseTarget;
    /*        */ byte _gap_0xA0[0x30];
    /* 0x00D0 */ Client::Game::Object::GameObject* MouseOverTarget;
    /*        */ byte _gap_0xD8[0x8];
    /* 0x00E0 */ Client::Game::Object::GameObject* MouseOverNameplateTarget;
    /*        */ byte _gap_0xE8[0x10];
    /* 0x00F8 */ Client::Game::Object::GameObject* FocusTarget;
    /*        */ byte _gap_0x100[0x10];
    /* 0x0110 */ Client::Game::Object::GameObject* PreviousTarget;
    /*        */ byte _gap_0x118[0x28];
    /* 0x0140 */ Client::Game::Object::GameObjectID TargetObjectId;
    /* 0x0148 */ Client::Game::Control::GameObjectArray ObjectFilterArray0;
    /*        */ byte _gap_0x1408[0x690];
    /* 0x1A98 */ Client::Game::Control::GameObjectArray ObjectFilterArray1;
    /* 0x2D58 */ Client::Game::Control::GameObjectArray ObjectFilterArray2;
    /* 0x4018 */ Client::Game::Control::GameObjectArray ObjectFilterArray3;
    /*        */ byte _gap_0x52D8[0x8];
    /* 0x52E0 */ unsigned __int32 TargetModes[0x8];
    /* 0x5300 */ unsigned __int32 TargetModeIndex;
    /*        */ byte _gap_0x5304[0x4];
    /*        */ byte _gap_0x5308[0x68];
};

__unaligned struct Client::Game::Control::Control /* Size=0x5B00 */
{
    /* 0x0000 */ Client::Game::Control::CameraManager CameraManager;
    /* 0x0180 */ Client::Game::Control::TargetSystem TargetSystem;
    /*        */ byte _gap_0x54F0[0x588];
    /*        */ byte _gap_0x5A78[0x2];
    /*        */ byte _gap_0x5A7A;
    /* 0x5A7B */ bool IsWalking;
    /*        */ byte _gap_0x5A7C[0x4];
    /*        */ byte _gap_0x5A80[0x68];
    /* 0x5AE8 */ unsigned __int32 LocalPlayerObjectId;
    /*        */ byte _gap_0x5AEC[0x4];
    /* 0x5AF0 */ Client::Game::Character::BattleChara* LocalPlayer;
    /*        */ byte _gap_0x5AF8[0x8];
};

__unaligned struct Client::Game::Control::GazeController::Gaze::GazeVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::Game::Control::GazeController::Gaze::TargetInformation::TargetInformationVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::Game::Control::GazeController::GazeControllerVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::Game::Control::InputManager /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

__unaligned struct Client::Game::CurrencyManager::SpecialCurrencyItem /* Size=0x20 */
{
    /* 0x00 */ byte SpecialId;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 MaxCount;
    /* 0x08 */ unsigned __int32 Count;
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x10];
};

__unaligned struct StdPairunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem /* Size=0x24 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ Client::Game::CurrencyManager::SpecialCurrencyItem Item2;
};

__unaligned struct StdMap::Nodeunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem /* Size=0x48 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem KeyValuePair;
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct StdMapunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::CurrencyManager::CurrencyItem /* Size=0x20 */
{
    /* 0x00 */ unsigned __int16 MaxCount;
    /* 0x02 */ unsigned __int16 Count;
    /* 0x04 */ bool IsUnlimited;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x18];
};

__unaligned struct StdPairunsignedint32ClientGameCurrencyManagerCurrencyItem /* Size=0x24 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ Client::Game::CurrencyManager::CurrencyItem Item2;
};

__unaligned struct StdMap::Nodeunsignedint32ClientGameCurrencyManagerCurrencyItem /* Size=0x48 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerCurrencyItem* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerCurrencyItem* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerCurrencyItem* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32ClientGameCurrencyManagerCurrencyItem KeyValuePair;
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct StdMapunsignedint32ClientGameCurrencyManagerCurrencyItem /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerCurrencyItem* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::CurrencyManager::ContentCurrencyItem /* Size=0x20 */
{
    /* 0x00 */ unsigned __int16 MaxCount;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int16 Count;
    /*      */ byte _gap_0x6[0x2];
    /* 0x08 */ bool IsUnlimited;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x10];
};

__unaligned struct StdPairunsignedint32ClientGameCurrencyManagerContentCurrencyItem /* Size=0x24 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ Client::Game::CurrencyManager::ContentCurrencyItem Item2;
};

__unaligned struct StdMap::Nodeunsignedint32ClientGameCurrencyManagerContentCurrencyItem /* Size=0x48 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerContentCurrencyItem* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerContentCurrencyItem* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerContentCurrencyItem* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32ClientGameCurrencyManagerContentCurrencyItem KeyValuePair;
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct StdMapunsignedint32ClientGameCurrencyManagerContentCurrencyItem /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameCurrencyManagerContentCurrencyItem* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::CurrencyManager /* Size=0x30 */
{
    /* 0x00 */ StdMapunsignedint32ClientGameCurrencyManagerSpecialCurrencyItem SpecialItemBucket;
    /* 0x10 */ StdMapunsignedint32ClientGameCurrencyManagerCurrencyItem ItemBucket;
    /* 0x20 */ StdMapunsignedint32ClientGameCurrencyManagerContentCurrencyItem ContentItemBucket;
};

__unaligned struct StdSet::NodeClientGameObjectGameObjectPtr /* Size=0x30 */
{
    /* 0x00 */ StdSet::NodeClientGameObjectGameObjectPtr* Left;
    /* 0x08 */ StdSet::NodeClientGameObjectGameObjectPtr* Parent;
    /* 0x10 */ StdSet::NodeClientGameObjectGameObjectPtr* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ Client::Game::Object::GameObject* Key;
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x8];
};

__unaligned struct StdSetClientGameObjectGameObjectPtr /* Size=0x10 */
{
    /* 0x00 */ StdSet::NodeClientGameObjectGameObjectPtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::Event::EventHandlerStructInfo /* Size=0x38 */
{
    /* 0x00 */ Client::Game::Event::EventId EventId;
    /* 0x04 */ byte Flags;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x30];
};

__unaligned struct Client::Game::Event::EventHandlerStruct /* Size=0x210 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ StdSetClientGameObjectGameObjectPtr EventObjects;
    /* 0x018 */ Client::Game::Event::EventSceneModuleUsualImpl* EventSceneModule;
    /* 0x020 */ Client::Game::Event::EventHandlerStructInfo Info;
    /*       */ byte _gap_0x58[0x70];
    /* 0x0C8 */ Client::System::String::Utf8String UnkString0;
    /*       */ byte _gap_0x130[0x38];
    /* 0x168 */ Client::System::String::Utf8String UnkString1;
    /*       */ byte _gap_0x1D0[0x40];
};

__unaligned struct Client::Game::Event::LuaEventHandlerStruct /* Size=0x330 */
{
    /* 0x000 */ Client::Game::Event::EventHandlerStruct EventHandler;
    /* 0x210 */ Common::Lua::LuaState* LuaState;
    /*       */ byte _gap_0x218[0x28];
    /* 0x240 */ Client::System::String::Utf8String LuaClass;
    /* 0x2A8 */ Client::System::String::Utf8String LuaKey;
    /*       */ byte _gap_0x310[0x20];
};

__unaligned struct Client::Game::Event::Director /* Size=0x4B8 */
{
    /* 0x000 */ Client::Game::Event::LuaEventHandlerStruct LuaEventHandler;
    /* 0x330 */ Client::Game::Event::EventHandlerStructInfo* EventHandlerInfo;
    /* 0x338 */ unsigned __int32 ContentId;
    /* 0x33C */ byte ContentFlags;
    /*       */ byte _gap_0x33D;
    /*       */ byte _gap_0x33E[0x2];
    /* 0x340 */ byte Sequence;
    /*       */ byte _gap_0x341;
    /* 0x342 */ byte UnionData[0xA];
    /*       */ byte _gap_0x34C[0x4];
    /* 0x350 */ Client::System::String::Utf8String String0;
    /* 0x3B8 */ Client::System::String::Utf8String String1;
    /* 0x420 */ Client::System::String::Utf8String String2;
    /*       */ byte _gap_0x488[0x30];
};

__unaligned struct Client::Game::Event::ModuleBase /* Size=0x40 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Common::Lua::LuaState* LuaState;
    /*      */ byte _gap_0x10[0x30];
};

__unaligned struct StdVectorClientGameEventDirectorPtr /* Size=0x18 */
{
    /* 0x00 */ Client::Game::Event::Director** First;
    /* 0x08 */ Client::Game::Event::Director** Last;
    /* 0x10 */ Client::Game::Event::Director** End;
};

__unaligned struct StdPairint64int64 /* Size=0x10 */
{
    /* 0x00 */ __int64 Item1;
    /* 0x08 */ __int64 Item2;
};

__unaligned struct StdPairunsignedint16StdPairint64int64 /* Size=0x18 */
{
    /* 0x00 */ unsigned __int16 Item1;
    /* 0x02 */ StdPairint64int64 Item2;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct StdMap::Nodeunsignedint16StdPairint64int64 /* Size=0x40 */
{
    /* 0x00 */ StdMap::Nodeunsignedint16StdPairint64int64* Left;
    /* 0x08 */ StdMap::Nodeunsignedint16StdPairint64int64* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint16StdPairint64int64* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint16StdPairint64int64 KeyValuePair;
    /*      */ byte _gap_0x34[0x4];
    /*      */ byte _gap_0x38[0x8];
};

__unaligned struct StdMapunsignedint16StdPairint64int64 /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint16StdPairint64int64* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::Event::DirectorModule /* Size=0xA0 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdVectorClientGameEventDirectorPtr DirectorList;
    /* 0x58 */ StdMapunsignedint16StdPairint64int64 DirectorFactories;
    /*      */ byte _gap_0x68[0x30];
    /* 0x98 */ Client::Game::InstanceContent::ContentDirector* ActiveContentDirector;
};

__unaligned struct StdPairunsignedint32ClientGameEventEventHandlerStructStructPtr /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ Client::Game::Event::EventHandlerStruct* Item2;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdMap::Nodeunsignedint32ClientGameEventEventHandlerStructStructPtr /* Size=0x38 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameEventEventHandlerStructStructPtr* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32ClientGameEventEventHandlerStructStructPtr* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32ClientGameEventEventHandlerStructStructPtr* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32ClientGameEventEventHandlerStructStructPtr KeyValuePair;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x8];
};

__unaligned struct StdMapunsignedint32ClientGameEventEventHandlerStructStructPtr /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientGameEventEventHandlerStructStructPtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::Event::EventHandlerStructModule /* Size=0xC0 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdMapunsignedint32ClientGameEventEventHandlerStructStructPtr EventHandlerMap;
    /* 0x50 */ StdMapunsignedint16StdPairint64int64 EventHandlerFactories;
    /*      */ byte _gap_0x60[0x60];
};

__unaligned struct Client::Game::Event::LuaActor /* Size=0x80 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Client::Game::Object::GameObject* Object;
    /* 0x10 */ Client::System::String::Utf8String LuaString;
    /* 0x78 */ Common::Lua::LuaState* LuaState;
};

__unaligned struct StdPairint64ClientGameEventLuaActor /* Size=0x88 */
{
    /* 0x00 */ __int64 Item1;
    /* 0x08 */ Client::Game::Event::LuaActor Item2;
};

__unaligned struct StdMap::Nodeint64ClientGameEventLuaActor /* Size=0xB0 */
{
    /* 0x00 */ StdMap::Nodeint64ClientGameEventLuaActor* Left;
    /* 0x08 */ StdMap::Nodeint64ClientGameEventLuaActor* Parent;
    /* 0x10 */ StdMap::Nodeint64ClientGameEventLuaActor* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairint64ClientGameEventLuaActor KeyValuePair;
    /*      */ byte _gap_0xA4[0x4];
    /*      */ byte _gap_0xA8[0x8];
};

__unaligned struct StdMapint64ClientGameEventLuaActor /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeint64ClientGameEventLuaActor* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::Event::LuaActorModule /* Size=0x50 */
{
    /* 0x00 */ Client::Game::Event::ModuleBase ModuleBase;
    /* 0x40 */ StdMapint64ClientGameEventLuaActor ActorMap;
};

__unaligned struct Client::Game::Event::EventSceneModuleImplBase /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Client::Game::Event::EventSceneModule* EventSceneModule;
};

__unaligned struct Client::Game::Event::EventSceneModuleUsualImpl /* Size=0x10 */
{
    /* 0x00 */ Client::Game::Event::EventSceneModuleImplBase ImplBase;
};

__unaligned struct Client::Game::Event::EventGPoseController /* Size=0x0 */
{
};

__unaligned struct Client::Game::Event::EventSceneModule /* Size=0x31C0 */
{
    /* 0x0000 */ Client::Game::Event::EventSceneModuleUsualImpl EventSceneModuleUsualImpl;
    /* 0x0010 */ Client::Game::Event::EventSceneModuleImplBase EventSceneModuleImplBase;
    /* 0x0020 */ Client::Game::Event::EventSceneModuleImplBase* EventSceneModuleImpl;
    /*        */ byte _gap_0x28[0x1C8];
    /* 0x01F0 */ Client::Game::Event::EventGPoseController EventGPoseController;
    /*        */ byte _gap_0x1F0[0x2FD0];
};

__unaligned struct Common::Lua::lua_State /* Size=0xB0 */
{
    /*      */ byte _gap_0x0[0xB0];
};

__unaligned struct Common::Lua::LuaState /* Size=0x28 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ Common::Lua::lua_State* State;
    /* 0x10 */ bool GCEnabled;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
    /* 0x18 */ __int64 LastGCRestart;
    /* 0x20 */ __int32 (__fastcall *db_errorfb)(Common::Lua::lua_State* a1);
};

__unaligned struct Common::Lua::LuaThread /* Size=0x28 */
{
    /* 0x00 */ Common::Lua::LuaState LuaState;
};

__unaligned struct Client::Game::Event::EventState /* Size=0x30 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ Client::Game::Object::GameObjectID ObjectId;
    /*      */ byte _gap_0x18[0x18];
};

__unaligned struct Client::Game::Event::EventFramework /* Size=0x3C10 */
{
    /* 0x0000 */ Client::Game::Event::EventHandlerStructModule EventHandlerModule;
    /* 0x00C0 */ Client::Game::Event::DirectorModule DirectorModule;
    /* 0x0160 */ Client::Game::Event::LuaActorModule LuaActorModule;
    /* 0x01B0 */ Client::Game::Event::EventSceneModule EventSceneModule;
    /* 0x3370 */ __int32 LoadState;
    /*        */ byte _gap_0x3374[0x4];
    /* 0x3378 */ Common::Lua::LuaState* LuaState;
    /* 0x3380 */ Common::Lua::LuaThread LuaThread;
    /*        */ byte _gap_0x33A8[0x30];
    /* 0x33D8 */ Client::Game::Event::EventState EventState1;
    /*        */ byte _gap_0x3408[0x30];
    /* 0x3438 */ Client::Game::Event::EventState EventState2;
    /*        */ byte _gap_0x3468[0x7A8];
};

__unaligned struct System::Numerics::Vector3 /* Size=0x0 */
{
    /* 0x0 */ float X;
    /* 0x4 */ float Y;
    /* 0x8 */ float Z;
};

__unaligned struct Client::Game::Fate::FateContext /* Size=0x1040 */
{
    /*        */ byte _gap_0x0[0x18];
    /* 0x0018 */ unsigned __int16 FateId;
    /*        */ byte _gap_0x1A[0x2];
    /*        */ byte _gap_0x1C[0x4];
    /* 0x0020 */ __int32 StartTimeEpoch;
    /*        */ byte _gap_0x24[0x4];
    /* 0x0028 */ __int16 Duration;
    /*        */ byte _gap_0x2A[0x2];
    /*        */ byte _gap_0x2C[0x4];
    /*        */ byte _gap_0x30[0x90];
    /* 0x00C0 */ Client::System::String::Utf8String Name;
    /* 0x0128 */ Client::System::String::Utf8String Description;
    /* 0x0190 */ Client::System::String::Utf8String Objective;
    /*        */ byte _gap_0x1F8[0x1B0];
    /*        */ byte _gap_0x3A8[0x4];
    /* 0x03AC */ byte State;
    /*        */ byte _gap_0x3AD;
    /*        */ byte _gap_0x3AE;
    /* 0x03AF */ byte HandInCount;
    /*        */ byte _gap_0x3B0[0x8];
    /* 0x03B8 */ byte Progress;
    /*        */ byte _gap_0x3B9;
    /*        */ byte _gap_0x3BA[0x2];
    /*        */ byte _gap_0x3BC[0x4];
    /*        */ byte _gap_0x3C0[0x4];
    /* 0x03C4 */ bool IsExpBonus;
    /*        */ byte _gap_0x3C5;
    /*        */ byte _gap_0x3C6[0x2];
    /*        */ byte _gap_0x3C8[0x10];
    /* 0x03D8 */ unsigned __int32 IconId;
    /*        */ byte _gap_0x3DC[0x4];
    /*        */ byte _gap_0x3E0[0x18];
    /*        */ byte _gap_0x3F8;
    /* 0x03F9 */ byte Level;
    /* 0x03FA */ byte MaxLevel;
    /*        */ byte _gap_0x3FB;
    /*        */ byte _gap_0x3FC[0x4];
    /*        */ byte _gap_0x400[0x50];
    /* 0x0450 */ System::Numerics::Vector3 Location;
    /*        */ byte _gap_0x450[0x10];
    /*        */ byte _gap_0x460[0x4];
    /* 0x0464 */ float Radius;
    /*        */ byte _gap_0x468[0x2F8];
    /* 0x0760 */ unsigned __int32 MapIconId;
    /*        */ byte _gap_0x764[0x4];
    /*        */ byte _gap_0x768[0x20];
    /*        */ byte _gap_0x788[0x4];
    /*        */ byte _gap_0x78C[0x2];
    /* 0x078E */ unsigned __int16 TerritoryId;
    /*        */ byte _gap_0x790[0x8B0];
};

__unaligned struct Client::Game::Fate::FateDirector /* Size=0x4F8 */
{
    /* 0x000 */ Client::Game::Event::Director Director;
    /* 0x4B8 */ byte FateLevel;
    /*       */ byte _gap_0x4B9;
    /*       */ byte _gap_0x4BA[0x2];
    /*       */ byte _gap_0x4BC[0x4];
    /* 0x4C0 */ unsigned __int32 FateNpcObjectId;
    /*       */ byte _gap_0x4C4[0x4];
    /*       */ byte _gap_0x4C8[0x4];
    /* 0x4CC */ unsigned __int16 FateId;
    /*       */ byte _gap_0x4CE[0x2];
    /*       */ byte _gap_0x4D0[0x28];
};

__unaligned struct StdVectorClientGameObjectGameObjectID /* Size=0x18 */
{
    /* 0x00 */ Client::Game::Object::GameObjectID* First;
    /* 0x08 */ Client::Game::Object::GameObjectID* Last;
    /* 0x10 */ Client::Game::Object::GameObjectID* End;
};

__unaligned struct StdVectorClientGameFateFateContextPtr /* Size=0x18 */
{
    /* 0x00 */ Client::Game::Fate::FateContext** First;
    /* 0x08 */ Client::Game::Fate::FateContext** Last;
    /* 0x10 */ Client::Game::Fate::FateContext** End;
};

__unaligned struct Client::Game::Fate::FateManager /* Size=0xB8 */
{
    /* 0x00 */ StdVectorClientGameObjectGameObjectID Unk_Vector;
    /* 0x18 */ Client::System::String::Utf8String Unk_String;
    /* 0x80 */ Client::Game::Fate::FateDirector* FateDirector;
    /* 0x88 */ Client::Game::Fate::FateContext* CurrentFate;
    /* 0x90 */ StdVectorClientGameFateFateContextPtr Fates;
    /* 0xA8 */ unsigned __int16 SyncedFateId;
    /*      */ byte _gap_0xAA[0x2];
    /* 0xAC */ byte FateJoined;
    /*      */ byte _gap_0xAD;
    /*      */ byte _gap_0xAE[0x2];
    /*      */ byte _gap_0xB0[0x8];
};

__unaligned struct Client::Game::Gauge::JobGauge /* Size=0x8 */
{
    /*     */ byte _gap_0x0[0x8];
};

__unaligned struct Client::Game::Gauge::WhiteMageGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /*      */ byte _gap_0x8[0x2];
    /* 0x0A */ __int16 LilyTimer;
    /* 0x0C */ byte Lily;
    /* 0x0D */ byte BloodLily;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::ScholarGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Aetherflow;
    /* 0x09 */ byte FairyGauge;
    /* 0x0A */ __int16 SeraphTimer;
    /* 0x0C */ byte DismissedFairy;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::AstrologianGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 Timer;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC;
    /* 0x0D */ byte Card;
    /* 0x0E */ byte Seals;
    /*      */ byte _gap_0xF;
};

__unaligned struct Client::Game::Gauge::SageGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 AddersgallTimer;
    /* 0x0A */ byte Addersgall;
    /* 0x0B */ byte Addersting;
    /* 0x0C */ byte Eukrasia;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::BardGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 SongTimer;
    /*      */ byte _gap_0xA[0x2];
    /* 0x0C */ byte Repertoire;
    /* 0x0D */ byte SoulVoice;
    /* 0x0E */ Client::Game::Gauge::SongFlags SongFlags;
    /*      */ byte _gap_0xF;
};

__unaligned struct Client::Game::Gauge::MachinistGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 OverheatTimeRemaining;
    /* 0x0A */ __int16 SummonTimeRemaining;
    /* 0x0C */ byte Heat;
    /* 0x0D */ byte Battery;
    /* 0x0E */ byte LastSummonBatteryPower;
    /* 0x0F */ byte TimerActive;
};

__unaligned struct Client::Game::Gauge::DancerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Feathers;
    /* 0x09 */ byte Esprit;
    /* 0x0A */ byte DanceSteps[0x4];
    /* 0x0E */ byte StepIndex;
    /*      */ byte _gap_0xF;
};

__unaligned struct Client::Game::Gauge::BlackMageGauge /* Size=0x30 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 EnochianTimer;
    /* 0x0A */ __int16 ElementTimeRemaining;
    /* 0x0C */ signed __int8 ElementStance;
    /* 0x0D */ byte UmbralHearts;
    /* 0x0E */ byte PolyglotStacks;
    /* 0x0F */ Client::Game::Gauge::EnochianFlags EnochianFlags;
    /*      */ byte _gap_0x10[0x20];
};

__unaligned struct Client::Game::Gauge::SummonerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 SummonTimer;
    /* 0x0A */ unsigned __int16 AttunementTimer;
    /* 0x0C */ byte ReturnSummon;
    /* 0x0D */ byte ReturnSummonGlam;
    /* 0x0E */ byte Attunement;
    /* 0x0F */ Client::Game::Gauge::AetherFlags AetherFlags;
};

__unaligned struct Client::Game::Gauge::RedMageGauge /* Size=0x50 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte WhiteMana;
    /* 0x09 */ byte BlackMana;
    /* 0x0A */ byte ManaStacks;
    /*      */ byte _gap_0xB;
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x40];
};

__unaligned struct Client::Game::Gauge::MonkGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Chakra;
    /* 0x09 */ Client::Game::Gauge::BeastChakraType BeastChakra1;
    /* 0x0A */ Client::Game::Gauge::BeastChakraType BeastChakra2;
    /* 0x0B */ Client::Game::Gauge::BeastChakraType BeastChakra3;
    /* 0x0C */ Client::Game::Gauge::NadiFlags Nadi;
    /*      */ byte _gap_0xD;
    /* 0x0E */ unsigned __int16 BlitzTimeRemaining;
};

__unaligned struct Client::Game::Gauge::DragoonGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int16 LotdTimer;
    /* 0x0A */ byte LotdState;
    /* 0x0B */ byte EyeCount;
    /* 0x0C */ byte FirstmindsFocusCount;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::NinjaGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ unsigned __int16 HutonTimer;
    /* 0x0A */ byte Ninki;
    /* 0x0B */ byte HutonManualCasts;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::Gauge::SamuraiGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /*      */ byte _gap_0x8[0x2];
    /* 0x0A */ Client::Game::Gauge::KaeshiAction Kaeshi;
    /* 0x0B */ byte Kenki;
    /* 0x0C */ byte MeditationStacks;
    /* 0x0D */ Client::Game::Gauge::SenFlags SenFlags;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::ReaperGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Soul;
    /* 0x09 */ byte Shroud;
    /* 0x0A */ unsigned __int16 EnshroudedTimeRemaining;
    /* 0x0C */ byte LemureShroud;
    /* 0x0D */ byte VoidShroud;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::Gauge::DarkKnightGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Blood;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 DarksideTimer;
    /* 0x0C */ byte DarkArtsState;
    /*      */ byte _gap_0xD;
    /* 0x0E */ unsigned __int16 ShadowTimer;
};

__unaligned struct Client::Game::Gauge::PaladinGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte OathGauge;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::Gauge::WarriorGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte BeastGauge;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::Gauge::GunbreakerGauge /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte Ammo;
    /*      */ byte _gap_0x9;
    /* 0x0A */ __int16 MaxTimerDuration;
    /* 0x0C */ byte AmmoComboStep;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::JobGaugeManager /* Size=0x60 */
{
    /* 0x00 */ Client::Game::Gauge::JobGauge* CurrentGauge;
    union {
    /* 0x08 */ Client::Game::Gauge::JobGauge EmptyGauge;
    /* 0x08 */ Client::Game::Gauge::WhiteMageGauge WhiteMage;
    /* 0x08 */ Client::Game::Gauge::ScholarGauge Scholar;
    /* 0x08 */ Client::Game::Gauge::AstrologianGauge Astrologian;
    /* 0x08 */ Client::Game::Gauge::SageGauge Sage;
    /* 0x08 */ Client::Game::Gauge::BardGauge Bard;
    /* 0x08 */ Client::Game::Gauge::MachinistGauge Machinist;
    /* 0x08 */ Client::Game::Gauge::DancerGauge Dancer;
    /* 0x08 */ Client::Game::Gauge::BlackMageGauge BlackMage;
    /* 0x08 */ Client::Game::Gauge::SummonerGauge Summoner;
    /* 0x08 */ Client::Game::Gauge::RedMageGauge RedMage;
    /* 0x08 */ Client::Game::Gauge::MonkGauge Monk;
    /* 0x08 */ Client::Game::Gauge::DragoonGauge Dragoon;
    /* 0x08 */ Client::Game::Gauge::NinjaGauge Ninja;
    /* 0x08 */ Client::Game::Gauge::SamuraiGauge Samurai;
    /* 0x08 */ Client::Game::Gauge::ReaperGauge Reaper;
    /* 0x08 */ Client::Game::Gauge::DarkKnightGauge DarkKnight;
    /* 0x08 */ Client::Game::Gauge::PaladinGauge Paladin;
    /* 0x08 */ Client::Game::Gauge::WarriorGauge Warrior;
    /* 0x08 */ Client::Game::Gauge::GunbreakerGauge Gunbreaker;
    } _union_0x8;
    /* 0x58 */ byte ClassJobID;
    /*      */ byte _gap_0x59;
    /*      */ byte _gap_0x5A[0x2];
    /*      */ byte _gap_0x5C[0x4];
};

__unaligned struct Client::Game::GameMain /* Size=0x40E0 */
{
    /* 0x0000 */ unsigned __int32 ActiveFestivals[0x4];
    /*        */ byte _gap_0x10[0x30];
    /* 0x0040 */ unsigned __int32 QueuedFestivals[0x4];
    /*        */ byte _gap_0x50[0xA88];
    /* 0x0AD8 */ Client::Game::JobGaugeManager JobGaugeManager;
    /*        */ byte _gap_0xB38[0x3548];
    /* 0x4080 */ unsigned __int32 TerritoryLoadState;
    /* 0x4084 */ unsigned __int32 NextTerritoryTypeId;
    /* 0x4088 */ unsigned __int32 CurrentTerritoryTypeId;
    /* 0x408C */ unsigned __int32 CurrentTerritoryIntendedUseId;
    /*        */ byte _gap_0x4090[0x4];
    /* 0x4094 */ unsigned __int16 CurrentContentFinderConditionId;
    /*        */ byte _gap_0x4096[0x2];
    /*        */ byte _gap_0x4098[0x8];
    /* 0x40A0 */ unsigned __int32 CurrentMapId;
    /*        */ byte _gap_0x40A4[0x4];
    /*        */ byte _gap_0x40A8[0x8];
    /* 0x40B0 */ float MilisecondCounter;
    /* 0x40B4 */ unsigned __int32 RuntimeSeconds;
    /* 0x40B8 */ bool RuntimeSecondsChanged;
    /*        */ byte _gap_0x40B9;
    /*        */ byte _gap_0x40BA[0x2];
    /* 0x40BC */ float Runtime;
    /* 0x40C0 */ __int64 CurrentTerritoryTypeRow;
    /* 0x40C8 */ __int64 CurrentTerritoryIntendedUseRow;
    /* 0x40D0 */ __int64 NextTerritoryTypeRow;
    /* 0x40D8 */ __int64 NextTerritoryIntendedUseRow;
};

__unaligned struct Client::Game::GcArmyMember /* Size=0x50 */
{
    /* 0x00 */ unsigned __int32 Face;
    /* 0x04 */ unsigned __int32 ENpcResidentId;
    /* 0x08 */ byte Race;
    /* 0x09 */ byte Sex;
    /* 0x0A */ byte ClassJob;
    /* 0x0B */ byte Level;
    /* 0x0C */ unsigned __int32 Experience;
    /*      */ byte _gap_0x10[0x2];
    /* 0x12 */ Client::Game::GcArmyMemberFlag Flags;
    /* 0x13 */ byte CandidateCategory;
    /* 0x14 */ unsigned __int32 EnlistmentTimestamp;
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ byte CaptureTactics;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E;
    /* 0x1F */ byte ActiveTrait;
    /* 0x20 */ byte ActiveTraitCond;
    /*      */ byte _gap_0x21;
    /* 0x22 */ byte InactiveTrait;
    /* 0x23 */ byte InactiveTraitCond;
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ unsigned __int32 GlamourMainHand;
    /* 0x2C */ unsigned __int32 GlamourOffHand;
    /* 0x30 */ unsigned __int32 GlamourHead;
    /* 0x34 */ unsigned __int32 GlamourBody;
    /* 0x38 */ unsigned __int32 GlamourHands;
    /* 0x3C */ unsigned __int32 GlamourLegs;
    /* 0x40 */ unsigned __int32 GlamourFeet;
    /* 0x44 */ byte StainMainHand;
    /* 0x45 */ byte StainOffHand;
    /* 0x46 */ byte StainHead;
    /* 0x47 */ byte StainBody;
    /* 0x48 */ byte StainHands;
    /* 0x49 */ byte StainLegs;
    /* 0x4A */ byte StainFeet;
    /* 0x4B */ byte MasteryIndependent;
    /* 0x4C */ byte MasteryOffensive;
    /* 0x4D */ byte MasteryDefensive;
    /* 0x4E */ byte MasteryBalanced;
    /*      */ byte _gap_0x4F;
};

__unaligned struct Client::Game::GcArmyData /* Size=0xB18 */
{
    /* 0x000 */ Client::Game::GcArmyMember Members[0x8];
    /* 0x280 */ byte Progress;
    /*       */ byte _gap_0x281;
    /* 0x282 */ unsigned __int16 CurrentExpedition;
    /*       */ byte _gap_0x284[0x4];
    /* 0x288 */ unsigned __int16 BonusPhysical;
    /* 0x28A */ unsigned __int16 BonusMental;
    /* 0x28C */ unsigned __int16 BonusTactical;
    /*       */ byte _gap_0x28E[0x2];
    /*       */ byte _gap_0x290[0x68];
    /*       */ byte _gap_0x2F8[0x4];
    /* 0x2FC */ unsigned __int32 MissionRewardExperience;
    /*       */ byte _gap_0x300[0x70];
    /* 0x370 */ unsigned __int32 RecruitENpcResidentId;
    /*       */ byte _gap_0x374[0x4];
    /* 0x378 */ Client::Game::Character::CustomizeData RecruitCustomizeData;
    /*       */ byte _gap_0x392[0x2];
    /*       */ byte _gap_0x394[0x4];
    /*       */ byte _gap_0x398[0x28];
    /* 0x3C0 */ Client::Game::GcArmyMember RecruitMember;
    /*       */ byte _gap_0x410[0x60];
    /* 0x470 */ byte MemberCount;
    /*       */ byte _gap_0x471;
    /*       */ byte _gap_0x472[0x2];
    /*       */ byte _gap_0x474[0x4];
    /*       */ byte _gap_0x478[0x6A0];
};

__unaligned struct Client::Game::GcArmyManager /* Size=0x10 */
{
    /* 0x00 */ Client::Game::GcArmyData* Data;
    /* 0x08 */ unsigned __int32 LastMissionCompleteNotificationTimestamp;
    /* 0x0C */ unsigned __int32 LastTrainingCompleteNotificationTimestamp;
};

__unaligned struct Client::Game::Group::PartyMember /* Size=0x390 */
{
    /* 0x000 */ Client::Game::StatusManager StatusManager;
    /* 0x2F0 */ float X;
    /* 0x2F4 */ float Y;
    /* 0x2F8 */ float Z;
    /*       */ byte _gap_0x2FC[0x4];
    /* 0x300 */ __int64 ContentID;
    /* 0x308 */ unsigned __int32 ObjectID;
    /* 0x30C */ unsigned __int32 Unk_ObjectID_1;
    /* 0x310 */ unsigned __int32 Unk_ObjectID_2;
    /* 0x314 */ unsigned __int32 CurrentHP;
    /* 0x318 */ unsigned __int32 MaxHP;
    /* 0x31C */ unsigned __int16 CurrentMP;
    /* 0x31E */ unsigned __int16 MaxMP;
    /* 0x320 */ unsigned __int16 TerritoryType;
    /* 0x322 */ unsigned __int16 HomeWorld;
    /* 0x324 */ byte Name[0x40];
    /* 0x364 */ byte Sex;
    /* 0x365 */ byte ClassJob;
    /* 0x366 */ byte Level;
    /* 0x367 */ byte DamageShield;
    /* 0x368 */ byte Unk_Struct_208__0;
    /*       */ byte _gap_0x369;
    /*       */ byte _gap_0x36A[0x2];
    /* 0x36C */ unsigned __int32 Unk_Struct_208__4;
    /* 0x370 */ unsigned __int16 Unk_Struct_208__8;
    /*       */ byte _gap_0x372[0x2];
    /* 0x374 */ unsigned __int32 Unk_Struct_208__C;
    /* 0x378 */ unsigned __int16 Unk_Struct_208__10;
    /* 0x37A */ unsigned __int16 Unk_Struct_208__14;
    /*       */ byte _gap_0x37C[0x4];
    /* 0x380 */ byte Flags;
    /*       */ byte _gap_0x381;
    /*       */ byte _gap_0x382[0x2];
    /*       */ byte _gap_0x384[0x4];
    /*       */ byte _gap_0x388[0x8];
};

__unaligned struct Client::Game::Group::GroupManager /* Size=0x63F0 */
{
    /* 0x0000 */ Client::Game::Group::PartyMember PartyMembers[0x8];
    /* 0x1C80 */ Client::Game::Group::PartyMember AllianceMembers[0x14];
    /* 0x63C0 */ unsigned __int32 Unk_3D40;
    /* 0x63C4 */ unsigned __int16 Unk_3D44;
    /*        */ byte _gap_0x63C6[0x2];
    /* 0x63C8 */ __int64 PartyId;
    /* 0x63D0 */ __int64 PartyId_2;
    /* 0x63D8 */ unsigned __int32 PartyLeaderIndex;
    /* 0x63DC */ byte MemberCount;
    /* 0x63DD */ byte Unk_3D5D;
    /*        */ byte _gap_0x63DE;
    /* 0x63DF */ byte Unk_3D5F;
    /* 0x63E0 */ byte Unk_3D60;
    /* 0x63E1 */ byte AllianceFlags;
    /*        */ byte _gap_0x63E2[0x2];
    /*        */ byte _gap_0x63E4[0x4];
    /*        */ byte _gap_0x63E8[0x8];
};

__unaligned struct Client::Game::Housing::HousingFurniture /* Size=0x30 */
{
    /* 0x00 */ unsigned __int32 Id;
    /* 0x04 */ byte Stain;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ Common::Math::Vector3 Position;
    /* 0x20 */ float Rotation;
    /* 0x24 */ __int32 Index;
    /*      */ byte _gap_0x28[0x8];
};

__unaligned struct Client::Game::Housing::HousingManager /* Size=0xE0 */
{
    /* 0x00 */ Client::Game::Housing::HousingTerritory* CurrentTerritory;
    /* 0x08 */ Client::Game::Housing::HousingOutdoorTerritory* OutdoorTerritory;
    /* 0x10 */ Client::Game::Housing::HousingTerritory* IndoorTerritory;
    /* 0x18 */ Client::Game::Housing::HousingWorkshopTerritory* WorkshopTerritory;
    /*      */ byte _gap_0x20[0xC0];
};

__unaligned struct Client::Game::Housing::HousingObjectManager /* Size=0xC98 */
{
    /*       */ byte _gap_0x0[0x18];
    /* 0x018 */ Client::Game::Object::GameObject* Objects[0x190];
};

__unaligned struct Client::Game::Housing::HousingTerritory /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /* 0x10 */ Client::Game::Housing::HousingFurniture Furniture[0x2DC];
    /*     */ byte _gap_0x8950[0x18];
    /* 0x8968 */ Client::Game::Housing::HousingObjectManager HousingObjectManager;
    /*     */ byte _gap_0x9600[0xA0];
    /* 0x96A0 */ unsigned __int32 HouseID;
};

__unaligned struct Client::Game::Housing::PlotDetail /* Size=0x10 */
{
    /* 0x00 */ Client::Game::Housing::PlotState State;
    /* 0x01 */ Client::Game::Housing::PlotSize Size;
    /* 0x02 */ bool IsOpen;
    /* 0x03 */ bool Unk03;
    /* 0x04 */ Client::Game::Housing::PlotOwnerType OwnerType;
    /*      */ byte _gap_0x8[0x8];
};

__unaligned struct Client::Game::Housing::HousingOutdoorTerritory /* Size=0xAE30 */
{
    /* 0x0000 */ Client::Game::Housing::HousingTerritory HousingTerritory;
    /*        */ byte _gap_0x0[0x96A8];
    /* 0x96A8 */ signed __int8 StandingInPlot;
    /*        */ byte _gap_0x96A9;
    /* 0x96AA */ signed __int8 EditingFixturesOfPlot;
    /*        */ byte _gap_0x96AB;
    /*        */ byte _gap_0x96AC[0x4];
    /* 0x96B0 */ signed __int8 EditingFurnishingsOfPlot;
    /*        */ byte _gap_0x96B1;
    /*        */ byte _gap_0x96B2[0x2];
    /*        */ byte _gap_0x96B4[0x4];
    /* 0x96B8 */ Client::Game::Housing::PlotDetail Plot[0x3C];
    /* 0x9A78 */ Client::Game::Housing::ApartmentBuildingState ApartmentBuilding[0x2];
    /*        */ byte _gap_0x9A7A[0x2];
    /*        */ byte _gap_0x9A7C[0x4];
    /*        */ byte _gap_0x9A80[0x13B0];
};

__unaligned struct Client::Game::Housing::HousingWorkshopAirshipGathered /* Size=0x38 */
{
    /* 0x00 */ unsigned __int32 ExpGained;
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x4];
    /* 0x0C */ unsigned __int32 ItemIdPrimary;
    /* 0x10 */ unsigned __int32 ItemIdAdditional;
    /* 0x14 */ unsigned __int16 ItemCountPrimary;
    /* 0x16 */ unsigned __int16 ItemCountAdditional;
    /* 0x18 */ unsigned __int32 Unk1Primary;
    /* 0x1C */ unsigned __int32 Unk1Additional;
    /* 0x20 */ unsigned __int32 Unk2Primary;
    /* 0x24 */ unsigned __int32 Unk2Additional;
    /* 0x28 */ unsigned __int32 Unk3Primary;
    /* 0x2C */ unsigned __int32 Unk3Additional;
    /*      */ byte _gap_0x30[0x2];
    /* 0x32 */ bool AirshipItemValidPrimary;
    /* 0x33 */ bool AirshipItemValidAdditional;
    /*      */ byte _gap_0x34[0x4];
};

__unaligned struct Client::Game::Housing::HousingWorkshopAirshipSubData /* Size=0x1C0 */
{
    /*       */ byte _gap_0x0[0x4];
    /* 0x004 */ unsigned __int32 RegisterTime;
    /*       */ byte _gap_0x8[0x4];
    /* 0x00C */ byte RankId;
    /*       */ byte _gap_0xD;
    /*       */ byte _gap_0xE[0x2];
    /* 0x010 */ unsigned __int32 ReturnTime;
    /* 0x014 */ unsigned __int32 CurrentExp;
    /* 0x018 */ unsigned __int32 NextLevelExp;
    /*       */ byte _gap_0x1C[0x4];
    /* 0x020 */ unsigned __int16 HullId;
    /* 0x022 */ unsigned __int16 SternId;
    /* 0x024 */ unsigned __int16 BowId;
    /* 0x026 */ unsigned __int16 BridgeId;
    /* 0x028 */ unsigned __int16 Surveillance;
    /* 0x02A */ unsigned __int16 Retrieval;
    /* 0x02C */ unsigned __int16 Speed;
    /* 0x02E */ unsigned __int16 Range;
    /* 0x030 */ unsigned __int16 Favor;
    /*       */ byte _gap_0x32[0x2];
    /*       */ byte _gap_0x34[0x2];
    /*       */ byte _gap_0x36;
    /* 0x037 */ byte Name[0x14];
    /*       */ byte _gap_0x4B;
    /*       */ byte _gap_0x4C[0x4];
    /*       */ byte _gap_0x50[0x4];
    /* 0x054 */ Client::Game::Housing::HousingWorkshopAirshipGathered GatheredData[0x5];
    /*       */ byte _gap_0x16C[0x4];
    /*       */ byte _gap_0x170[0x30];
    /* 0x1A0 */ Client::System::String::Utf8String* Log;
    /*       */ byte _gap_0x1A8[0x18];
};

__unaligned struct Client::Game::Housing::HousingWorkshopAirshipData /* Size=0x28F8 */
{
    /* 0x0000 */ Client::Game::Housing::HousingWorkshopAirshipSubData DataList[0x4];
    /*        */ byte _gap_0x700[0x70];
    /* 0x0770 */ byte ActiveAirshipId;
    /* 0x0771 */ byte AirshipCount;
    /*        */ byte _gap_0x772[0x2];
    /*        */ byte _gap_0x774[0x4];
    /* 0x0778 */ Client::System::String::Utf8String AirshipLogList[0x52];
    /*        */ byte _gap_0x28C8[0x30];
};

__unaligned struct Client::Game::Housing::HousingWorkshopSubmarineGathered /* Size=0x38 */
{
    /* 0x00 */ byte Point;
    /* 0x01 */ Client::Game::Housing::SubmarineRating PointRating;
    /* 0x02 */ byte UnlockedPoint;
    /* 0x03 */ bool FirstExploration;
    /* 0x04 */ bool AdditionalSubmarineUnlocked;
    /* 0x05 */ bool DoubleDip;
    /* 0x06 */ unsigned __int16 UnknownUshort;
    /* 0x08 */ unsigned __int32 FavorLine;
    /* 0x0C */ unsigned __int32 ExpGained;
    /* 0x10 */ unsigned __int32 ItemIdPrimary;
    /* 0x14 */ unsigned __int32 ItemIdAdditional;
    /* 0x18 */ unsigned __int16 ItemCountPrimary;
    /* 0x1A */ unsigned __int16 ItemCountAdditional;
    /* 0x1C */ bool ItemHQPrimary;
    /* 0x1D */ bool ItemHQAdditional;
    /* 0x1E */ byte UnknownPrimary;
    /* 0x1F */ byte UnknownAdditional;
    /* 0x20 */ unsigned __int32 SurveyLinePrimary;
    /* 0x24 */ unsigned __int32 SurveyLineAdditional;
    /* 0x28 */ unsigned __int32 YieldLinePrimary;
    /* 0x2C */ unsigned __int32 YieldLineAdditional;
    /* 0x30 */ unsigned __int32 DiscoveredLinePrimary;
    /* 0x34 */ unsigned __int32 DiscoveredLineAdditional;
};

__unaligned struct Client::Game::Housing::HousingWorkshopSubmersibleSubData /* Size=0x2320 */
{
    /* 0x0000 */ Client::Game::Housing::HousingWorkshopSubmersibleData* Parent;
    /*        */ byte _gap_0x8[0x4];
    /*        */ byte _gap_0xC[0x2];
    /* 0x000E */ byte RankId;
    /*        */ byte _gap_0xF;
    /* 0x0010 */ unsigned __int32 RegisterTime;
    /* 0x0014 */ unsigned __int32 ReturnTime;
    /* 0x0018 */ unsigned __int32 CurrentExp;
    /* 0x001C */ unsigned __int32 NextLevelExp;
    /*        */ byte _gap_0x20[0x2];
    /* 0x0022 */ byte Name[0x14];
    /*        */ byte _gap_0x36[0x2];
    /*        */ byte _gap_0x38[0x2];
    /* 0x003A */ unsigned __int16 HullId;
    /* 0x003C */ unsigned __int16 SternId;
    /* 0x003E */ unsigned __int16 BowId;
    /* 0x0040 */ unsigned __int16 BridgeId;
    /* 0x0042 */ byte CurrentExplorationPoints[0x5];
    /*        */ byte _gap_0x47;
    /*        */ byte _gap_0x48[0x2];
    /* 0x004A */ unsigned __int16 SurveillanceBase;
    /* 0x004C */ unsigned __int16 RetrievalBase;
    /* 0x004E */ unsigned __int16 SpeedBase;
    /* 0x0050 */ unsigned __int16 RangeBase;
    /* 0x0052 */ unsigned __int16 FavorBase;
    /* 0x0054 */ unsigned __int16 SurveillanceBonus;
    /* 0x0056 */ unsigned __int16 RetrievalBonus;
    /* 0x0058 */ unsigned __int16 SpeedBonus;
    /* 0x005A */ unsigned __int16 RangeBonus;
    /* 0x005C */ unsigned __int16 FavorBonus;
    /*        */ byte _gap_0x5E[0x2];
    /* 0x0060 */ Client::Game::Housing::SubmarineRating SubmarineRating;
    /*        */ byte _gap_0x61;
    /* 0x0062 */ unsigned __int16 LogSpeed;
    /* 0x0064 */ Client::Game::Housing::HousingWorkshopSubmarineGathered GatheredData[0x5];
    /*        */ byte _gap_0x17C[0x4];
    /*        */ byte _gap_0x180[0x30];
    /* 0x01B0 */ Client::System::String::Utf8String LogList[0x52];
    /*        */ byte _gap_0x2300[0x20];
};

__unaligned struct Client::Game::Housing::HousingWorkshopSubmersibleData /* Size=0x8F40 */
{
    /* 0x0000 */ Client::Game::Housing::HousingWorkshopSubmersibleSubData DataList[0x4];
    /* 0x8C80 */ Client::Game::Housing::HousingWorkshopSubmersibleSubData* DataPointerList[0x5];
    /*        */ byte _gap_0x8CA8[0x298];
};

__unaligned struct Client::Game::Housing::HousingWorkshopTerritory /* Size=0xB8C0 */
{
    /*        */ byte _gap_0x0[0x68];
    /* 0x0068 */ Client::Game::Housing::HousingWorkshopAirshipData Airship;
    /* 0x2960 */ Client::Game::Housing::HousingWorkshopSubmersibleData Submersible;
    /*        */ byte _gap_0xB8A0[0x20];
};

__unaligned struct Client::Game::InstanceContent::ContentDirector /* Size=0xC48 */
{
    union {
    /* 0x000 */ Client::Game::Event::Director Director;
    /* 0x000 */ Client::Game::InstanceContent::ContentDirector::ContentDirectorVTable* VTable;
    } _union_0x0;
    /*       */ byte _gap_0x4B8[0x750];
    /* 0xC08 */ float ContentTimeLeft;
    /*       */ byte _gap_0xC0C[0x4];
    /*       */ byte _gap_0xC10[0x38];
};

__unaligned struct Client::Game::InstanceContent::ContentDirector::ContentDirectorVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /*     */ __int64 _vf38;
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /*     */ __int64 _vf47;
    /*     */ __int64 _vf48;
    /*     */ __int64 _vf49;
    /*     */ __int64 _vf50;
    /*     */ __int64 _vf51;
    /*     */ __int64 _vf52;
    /*     */ __int64 _vf53;
    /*     */ __int64 _vf54;
    /*     */ __int64 _vf55;
    /*     */ __int64 _vf56;
    /*     */ __int64 _vf57;
    /*     */ __int64 _vf58;
    /*     */ __int64 _vf59;
    /*     */ __int64 _vf60;
    /*     */ __int64 _vf61;
    /*     */ __int64 _vf62;
    /*     */ __int64 _vf63;
    /*     */ __int64 _vf64;
    /*     */ __int64 _vf65;
    /*     */ __int64 _vf66;
    /*     */ __int64 _vf67;
    /*     */ __int64 _vf68;
    /*     */ __int64 _vf69;
    /*     */ __int64 _vf70;
    /*     */ __int64 _vf71;
    /*     */ __int64 _vf72;
    /*     */ __int64 _vf73;
    /*     */ __int64 _vf74;
    /*     */ __int64 _vf75;
    /*     */ __int64 _vf76;
    /*     */ __int64 _vf77;
    /*     */ __int64 _vf78;
    /*     */ __int64 _vf79;
    /*     */ __int64 _vf80;
    /*     */ __int64 _vf81;
    /*     */ __int64 _vf82;
    /*     */ __int64 _vf83;
    /*     */ __int64 _vf84;
    /*     */ __int64 _vf85;
    /*     */ __int64 _vf86;
    /*     */ __int64 _vf87;
    /*     */ __int64 _vf88;
    /*     */ __int64 _vf89;
    /*     */ __int64 _vf90;
    /*     */ __int64 _vf91;
    /*     */ __int64 _vf92;
    /*     */ __int64 _vf93;
    /*     */ __int64 _vf94;
    /*     */ __int64 _vf95;
    /*     */ __int64 _vf96;
    /*     */ __int64 _vf97;
    /*     */ __int64 _vf98;
    /*     */ __int64 _vf99;
    /*     */ __int64 _vf100;
    /*     */ __int64 _vf101;
    /*     */ __int64 _vf102;
    /*     */ __int64 _vf103;
    /*     */ __int64 _vf104;
    /*     */ __int64 _vf105;
    /*     */ __int64 _vf106;
    /*     */ __int64 _vf107;
    /*     */ __int64 _vf108;
    /*     */ __int64 _vf109;
    /*     */ __int64 _vf110;
    /*     */ __int64 _vf111;
    /*     */ __int64 _vf112;
    /*     */ __int64 _vf113;
    /*     */ __int64 _vf114;
    /*     */ __int64 _vf115;
    /*     */ __int64 _vf116;
    /*     */ __int64 _vf117;
    /*     */ __int64 _vf118;
    /*     */ __int64 _vf119;
    /*     */ __int64 _vf120;
    /*     */ __int64 _vf121;
    /*     */ __int64 _vf122;
    /*     */ __int64 _vf123;
    /*     */ __int64 _vf124;
    /*     */ __int64 _vf125;
    /*     */ __int64 _vf126;
    /*     */ __int64 _vf127;
    /*     */ __int64 _vf128;
    /*     */ __int64 _vf129;
    /*     */ __int64 _vf130;
    /*     */ __int64 _vf131;
    /*     */ __int64 _vf132;
    /*     */ __int64 _vf133;
    /*     */ __int64 _vf134;
    /*     */ __int64 _vf135;
    /*     */ __int64 _vf136;
    /*     */ __int64 _vf137;
    /*     */ __int64 _vf138;
    /*     */ __int64 _vf139;
    /*     */ __int64 _vf140;
    /*     */ __int64 _vf141;
    /*     */ __int64 _vf142;
    /*     */ __int64 _vf143;
    /*     */ __int64 _vf144;
    /*     */ __int64 _vf145;
    /*     */ __int64 _vf146;
    /*     */ __int64 _vf147;
    /*     */ __int64 _vf148;
    /*     */ __int64 _vf149;
    /*     */ __int64 _vf150;
    /*     */ __int64 _vf151;
    /*     */ __int64 _vf152;
    /*     */ __int64 _vf153;
    /*     */ __int64 _vf154;
    /*     */ __int64 _vf155;
    /*     */ __int64 _vf156;
    /*     */ __int64 _vf157;
    /*     */ __int64 _vf158;
    /*     */ __int64 _vf159;
    /*     */ __int64 _vf160;
    /*     */ __int64 _vf161;
    /*     */ __int64 _vf162;
    /*     */ __int64 _vf163;
    /*     */ __int64 _vf164;
    /*     */ __int64 _vf165;
    /*     */ __int64 _vf166;
    /*     */ __int64 _vf167;
    /*     */ __int64 _vf168;
    /*     */ __int64 _vf169;
    /*     */ __int64 _vf170;
    /*     */ __int64 _vf171;
    /*     */ __int64 _vf172;
    /*     */ __int64 _vf173;
    /*     */ __int64 _vf174;
    /*     */ __int64 _vf175;
    /*     */ __int64 _vf176;
    /*     */ __int64 _vf177;
    /*     */ __int64 _vf178;
    /*     */ __int64 _vf179;
    /*     */ __int64 _vf180;
    /*     */ __int64 _vf181;
    /*     */ __int64 _vf182;
    /*     */ __int64 _vf183;
    /*     */ __int64 _vf184;
    /*     */ __int64 _vf185;
    /*     */ __int64 _vf186;
    /*     */ __int64 _vf187;
    /*     */ __int64 _vf188;
    /*     */ __int64 _vf189;
    /*     */ __int64 _vf190;
    /*     */ __int64 _vf191;
    /*     */ __int64 _vf192;
    /*     */ __int64 _vf193;
    /*     */ __int64 _vf194;
    /*     */ __int64 _vf195;
    /*     */ __int64 _vf196;
    /*     */ __int64 _vf197;
    /*     */ __int64 _vf198;
    /*     */ __int64 _vf199;
    /*     */ __int64 _vf200;
    /*     */ __int64 _vf201;
    /*     */ __int64 _vf202;
    /*     */ __int64 _vf203;
    /*     */ __int64 _vf204;
    /*     */ __int64 _vf205;
    /*     */ __int64 _vf206;
    /*     */ __int64 _vf207;
    /*     */ __int64 _vf208;
    /*     */ __int64 _vf209;
    /*     */ __int64 _vf210;
    /*     */ __int64 _vf211;
    /*     */ __int64 _vf212;
    /*     */ __int64 _vf213;
    /*     */ __int64 _vf214;
    /*     */ __int64 _vf215;
    /*     */ __int64 _vf216;
    /*     */ __int64 _vf217;
    /*     */ __int64 _vf218;
    /*     */ __int64 _vf219;
    /*     */ __int64 _vf220;
    /*     */ __int64 _vf221;
    /*     */ __int64 _vf222;
    /*     */ __int64 _vf223;
    /*     */ __int64 _vf224;
    /*     */ __int64 _vf225;
    /*     */ __int64 _vf226;
    /*     */ __int64 _vf227;
    /*     */ __int64 _vf228;
    /*     */ __int64 _vf229;
    /*     */ __int64 _vf230;
    /*     */ __int64 _vf231;
    /*     */ __int64 _vf232;
    /*     */ __int64 _vf233;
    /*     */ __int64 _vf234;
    /*     */ __int64 _vf235;
    /*     */ __int64 _vf236;
    /*     */ __int64 _vf237;
    /*     */ __int64 _vf238;
    /*     */ __int64 _vf239;
    /*     */ __int64 _vf240;
    /*     */ __int64 _vf241;
    /*     */ __int64 _vf242;
    /*     */ __int64 _vf243;
    /*     */ __int64 _vf244;
    /*     */ __int64 _vf245;
    /*     */ __int64 _vf246;
    /*     */ __int64 _vf247;
    /*     */ __int64 _vf248;
    /*     */ __int64 _vf249;
    /*     */ __int64 _vf250;
    /*     */ __int64 _vf251;
    /*     */ __int64 _vf252;
    /*     */ __int64 _vf253;
    /*     */ __int64 _vf254;
    /*     */ __int64 _vf255;
    /*     */ __int64 _vf256;
    /*     */ __int64 _vf257;
    /*     */ __int64 _vf258;
    /*     */ __int64 _vf259;
    /*     */ __int64 _vf260;
    /*     */ __int64 _vf261;
    /*     */ __int64 _vf262;
    /*     */ __int64 _vf263;
    /*     */ __int64 _vf264;
    /*     */ __int64 _vf265;
    /*     */ __int64 _vf266;
    /*     */ __int64 _vf267;
    /*     */ __int64 _vf268;
    /*     */ __int64 _vf269;
    /*     */ __int64 _vf270;
    /*     */ __int64 _vf271;
    /*     */ __int64 _vf272;
    /*     */ __int64 _vf273;
    /*     */ __int64 _vf274;
    /*     */ __int64 _vf275;
    /*     */ __int64 _vf276;
    /*     */ __int64 _vf277;
    /*     */ __int64 _vf278;
    /*     */ __int64 _vf279;
    /*     */ __int64 _vf280;
    /*     */ __int64 _vf281;
    /*     */ __int64 _vf282;
    /*     */ __int64 _vf283;
    /*     */ __int64 _vf284;
    /*     */ __int64 _vf285;
    /*     */ __int64 _vf286;
    /*     */ __int64 _vf287;
    /*     */ __int64 _vf288;
    /*     */ __int64 _vf289;
    /*     */ __int64 _vf290;
    /*     */ __int64 _vf291;
    /*     */ __int64 _vf292;
    /*     */ __int64 _vf293;
    /*     */ __int64 _vf294;
    /*     */ __int64 _vf295;
    /*     */ __int64 _vf296;
    /*     */ __int64 _vf297;
    /*     */ __int64 _vf298;
    /*     */ __int64 _vf299;
    /*     */ __int64 _vf300;
    /*     */ __int64 _vf301;
    /*     */ __int64 _vf302;
    /*     */ __int64 _vf303;
    /*     */ __int64 _vf304;
    /*     */ __int64 _vf305;
    /*     */ __int64 _vf306;
    /*     */ __int64 _vf307;
    /*     */ __int64 _vf308;
    /*     */ __int64 _vf309;
    /*     */ __int64 _vf310;
    /*     */ __int64 _vf311;
    /*     */ __int64 _vf312;
    /* 0x9C8 */ unsigned __int32 (__fastcall *GetContentTimeMax)(Client::Game::InstanceContent::ContentDirector* a1);
};

__unaligned struct Client::Game::InstanceContent::InstanceContentDirector /* Size=0x1CB0 */
{
    /* 0x0000 */ Client::Game::InstanceContent::ContentDirector ContentDirector;
    /*        */ byte _gap_0xC48[0x80];
    /*        */ byte _gap_0xCC8[0x4];
    /* 0x0CCC */ unsigned __int16 ContentTimeMax;
    /*        */ byte _gap_0xCCE[0x2];
    /*        */ byte _gap_0xCD0[0x10];
    /*        */ byte _gap_0xCE0[0x4];
    /* 0x0CE4 */ Client::Game::InstanceContent::InstanceContentType InstanceContentType;
    /*        */ byte _gap_0xCE5;
    /*        */ byte _gap_0xCE6[0x2];
    /*        */ byte _gap_0xCE8[0xFC8];
};

__unaligned struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonPartyInfo /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectId;
    /* 0x4 */ signed __int8 RoomIndex;
    /*     */ byte _gap_0x5;
    /*     */ byte _gap_0x6[0x2];
};

__unaligned struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonItemInfo /* Size=0x3 */
{
    /* 0x0 */ byte ItemId;
    /* 0x1 */ byte Count;
    /* 0x2 */ byte Flags;
};

__unaligned struct Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonChestInfo /* Size=0x2 */
{
    /* 0x0 */ byte ChestType;
    /* 0x1 */ signed __int8 RoomIndex;
};

__unaligned struct Client::Game::InstanceContent::InstanceContentDeepDungeon /* Size=0x27D8 */
{
    /* 0x0000 */ Client::Game::InstanceContent::InstanceContentDirector InstanceContentDirector;
    /*        */ byte _gap_0x1CB0[0x98];
    /* 0x1D48 */ Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonPartyInfo Party[0x4];
    /* 0x1D68 */ Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonItemInfo Items[0x10];
    /* 0x1D98 */ Client::Game::InstanceContent::InstanceContentDeepDungeon::DeepDungeonChestInfo Chests[0x10];
    /*        */ byte _gap_0x1DB8[0x10];
    /* 0x1DC8 */ unsigned __int32 BonusLootItemId;
    /* 0x1DCC */ byte Floor;
    /* 0x1DCD */ byte ReturnProgress;
    /* 0x1DCE */ byte PassageProgress;
    /*        */ byte _gap_0x1DCF;
    /* 0x1DD0 */ byte WeaponLevel;
    /* 0x1DD1 */ byte ArmorLevel;
    /* 0x1DD2 */ byte HoardCount;
    /*        */ byte _gap_0x1DD3;
    /*        */ byte _gap_0x1DD4[0x4];
    /*        */ byte _gap_0x1DD8[0xA00];
};

__unaligned struct Client::Game::InstanceContent::InstanceContentOceanFishing::FishDataStruct /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 ItemId;
    /* 0x04 */ unsigned __int16 FishParamId;
    /* 0x06 */ unsigned __int16 NqAmount;
    /* 0x08 */ unsigned __int16 HqAmount;
    /*      */ byte _gap_0xA[0x2];
    /* 0x0C */ unsigned __int32 TotalPoints;
};

__unaligned struct Client::Game::InstanceContent::InstanceContentOceanFishing::IndividualResultStruct /* Size=0x22 */
{
    /*      */ byte _gap_0x0[0x2];
    /* 0x02 */ unsigned __int32 TotalPoints;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x2];
    /* 0x0A */ unsigned __int32 ExperiencePoints;
    /* 0x0E */ unsigned __int16 Scrip1Amount;
    /* 0x10 */ unsigned __int16 Scrip2Amount;
    /* 0x12 */ byte Bonuses[0x10];
};

__unaligned struct Client::Game::InstanceContent::InstanceContentOceanFishing::AllResultStruct /* Size=0x28 */
{
    /* 0x00 */ unsigned __int16 WorldId;
    /* 0x02 */ unsigned __int16 CaughtFish;
    /* 0x04 */ unsigned __int16 TotalPoints;
    /*      */ byte _gap_0x6[0x2];
    /* 0x08 */ byte PlayerName[0x20];
};

__unaligned struct Client::Game::InstanceContent::InstanceContentOceanFishing /* Size=0x2300 */
{
    /* 0x0000 */ Client::Game::InstanceContent::InstanceContentDirector InstanceContentDirector;
    /*        */ byte _gap_0x1CB0[0x20];
    /* 0x1CD0 */ unsigned __int32 CurrentRoute;
    /* 0x1CD4 */ Client::Game::InstanceContent::InstanceContentOceanFishing::OceanFishingStatus Status;
    /* 0x1CD8 */ byte CurrentZone;
    /*        */ byte _gap_0x1CD9;
    /*        */ byte _gap_0x1CDA[0x2];
    /* 0x1CDC */ unsigned __int32 Duration;
    /* 0x1CE0 */ unsigned __int32 TimeOffset;
    /* 0x1CE4 */ unsigned __int32 WeatherID;
    /* 0x1CE8 */ bool SpectralCurrentActive;
    /*        */ byte _gap_0x1CE9;
    /*        */ byte _gap_0x1CEA[0x2];
    /*        */ byte _gap_0x1CEC[0x4];
    /*        */ byte _gap_0x1CF0[0x48];
    /*        */ byte _gap_0x1D38[0x4];
    /* 0x1D3C */ Client::Game::InstanceContent::InstanceContentOceanFishing::FishDataStruct FishData[0x3C];
    /*        */ byte _gap_0x20FC[0x4];
    /* 0x2100 */ byte AllResultSize;
    /* 0x2101 */ byte LocalIndexInAllResult;
    /* 0x2102 */ Client::Game::InstanceContent::InstanceContentOceanFishing::IndividualResultStruct IndividualResult;
    /* 0x2124 */ Client::Game::InstanceContent::InstanceContentOceanFishing::AllResultStruct LocalPlayerAllResult;
    /* 0x214C */ Client::Game::InstanceContent::InstanceContentOceanFishing::AllResultStruct AllResult[0xA];
    /*        */ byte _gap_0x22DC[0x4];
    /* 0x22E0 */ unsigned __int32 Mission1Type;
    /* 0x22E4 */ unsigned __int32 Mission2Type;
    /* 0x22E8 */ unsigned __int32 Mission3Type;
    /* 0x22EC */ unsigned __int16 Mission1Progress;
    /* 0x22EE */ unsigned __int16 Mission2Progress;
    /* 0x22F0 */ unsigned __int16 Mission3Progress;
    /*        */ byte _gap_0x22F2[0x2];
    /*        */ byte _gap_0x22F4[0x4];
    /*        */ byte _gap_0x22F8[0x8];
};

__unaligned struct Client::Game::InstanceContent::PublicContentDirector /* Size=0x1090 */
{
    /* 0x0000 */ Client::Game::InstanceContent::ContentDirector ContentDirector;
    /* 0x0C48 */ unsigned __int32 NameOffset;
    /* 0x0C4C */ unsigned __int32 MapIcon;
    /* 0x0C50 */ unsigned __int32 TextDataStart;
    /* 0x0C54 */ unsigned __int32 TextDataEnd;
    /* 0x0C58 */ unsigned __int32 StartCutscene;
    /* 0x0C5C */ unsigned __int32 LGBEventRange;
    /* 0x0C60 */ unsigned __int32 LGBPopRange;
    /* 0x0C64 */ unsigned __int32 EndCutscene;
    /* 0x0C68 */ unsigned __int16 Timelimit;
    /* 0x0C6A */ unsigned __int16 ContentFinderCondition;
    /* 0x0C6C */ unsigned __int16 AdditionalData;
    /* 0x0C6E */ unsigned __int16 Unknown0;
    /* 0x0C70 */ unsigned __int16 Unknown1;
    /* 0x0C72 */ unsigned __int16 Unknown2;
    /* 0x0C74 */ unsigned __int16 Unknown3;
    /* 0x0C76 */ Client::Game::InstanceContent::PublicContentDirectorType Type;
    /* 0x0C77 */ byte Unknown4;
    /*        */ byte _gap_0xC78[0x418];
};

__unaligned struct Client::Game::InventoryContainer /* Size=0x18 */
{
    /* 0x00 */ Client::Game::InventoryItem* Items;
    /* 0x08 */ Client::Game::InventoryType Type;
    /* 0x0C */ unsigned __int32 Size;
    /* 0x10 */ byte Loaded;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::Game::InventoryItem /* Size=0x38 */
{
    /* 0x00 */ Client::Game::InventoryType Container;
    /* 0x04 */ __int16 Slot;
    /* 0x06 */ bool IsSymbolic;
    /*      */ byte _gap_0x7;
    union {
    /* 0x08 */ unsigned __int32 ItemID;
    struct {
    /* 0x08 */ unsigned __int16 LinkedItemSlot;
    /* 0x0A */ unsigned __int16 LinkedInventoryType;
    } _union_struct_0x8;
    } _union_0x8;
    /* 0x0C */ unsigned __int32 Quantity;
    /* 0x10 */ unsigned __int16 Spiritbond;
    /* 0x12 */ unsigned __int16 Condition;
    /* 0x14 */ Client::Game::InventoryItem::ItemFlags Flags;
    /*      */ byte _gap_0x15;
    /*      */ byte _gap_0x16[0x2];
    /* 0x18 */ unsigned __int64 CrafterContentID;
    /* 0x20 */ unsigned __int16 Materia[0x5];
    /* 0x2A */ byte MateriaGrade[0x5];
    /* 0x2F */ byte Stain;
    /* 0x30 */ unsigned __int32 GlamourID;
    /*      */ byte _gap_0x34[0x4];
};

__unaligned struct Client::Game::InventoryManager /* Size=0x3620 */
{
    /*        */ byte _gap_0x0[0x1E08];
    /* 0x1E08 */ Client::Game::InventoryContainer* Inventories;
    /*        */ byte _gap_0x1E10[0x1810];
};

__unaligned struct Client::Game::LobbyCamera /* Size=0x300 */
{
    /* 0x000 */ Client::Game::Camera Camera;
    /*       */ byte _gap_0x2B0[0x48];
    /* 0x2F8 */ void* LobbyExcelSheet;
};

__unaligned struct Client::Game::LowCutCamera /* Size=0x2E0 */
{
    /* 0x000 */ Client::Game::CameraBase CameraBase;
    /*       */ byte _gap_0x110[0x1D0];
};

__unaligned struct Client::Game::MirageManager::GlamourPlate /* Size=0x3C */
{
    /* 0x00 */ unsigned __int32 ItemIds[0xC];
    /* 0x30 */ byte StainIds[0xC];
};

__unaligned struct Client::Game::MirageManager /* Size=0x1478 */
{
    /* 0x0000 */ bool IsApplyingGlamourPlate;
    /*        */ byte _gap_0x1;
    /*        */ byte _gap_0x2[0x2];
    /* 0x0004 */ unsigned __int32 PrismBoxItemIds[0x320];
    /* 0x0C84 */ byte PrismBoxStainIds[0x320];
    /* 0x0FA4 */ bool PrismBoxRequested;
    /* 0x0FA5 */ bool PrismBoxLoaded;
    /*        */ byte _gap_0xFA6[0x2];
    /* 0x0FA8 */ Client::Game::MirageManager::GlamourPlate GlamourPlates[0x14];
    /* 0x1458 */ bool GlamourPlatesRequested;
    /* 0x1459 */ bool GlamourPlatesLoaded;
    /*        */ byte _gap_0x145A[0x2];
    /*        */ byte _gap_0x145C[0x4];
    /*        */ byte _gap_0x1460[0x18];
};

__unaligned struct Client::Game::MJI::MJIFarmPasture /* Size=0x4 */
{
    /* 0x0 */ byte Level;
    /* 0x1 */ byte HoursToCompletion;
    /* 0x2 */ bool UnderConstruction;
    /* 0x3 */ byte EligibleForCare;
};

__unaligned struct Client::Game::MJI::MJIWorkshops /* Size=0x1C */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ byte PlaceId[0x4];
    /* 0x0C */ byte GlamourLevel[0x4];
    /* 0x10 */ byte HoursToCompletion[0x4];
    /* 0x14 */ byte BuildingLevel[0x4];
    /* 0x18 */ byte UnderConstruction[0x4];
};

__unaligned struct Client::Game::MJI::MJIGranaries /* Size=0x12 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ byte PlaceId[0x2];
    /* 0x0A */ byte GlamourLevel[0x2];
    /* 0x0C */ byte HoursToCompletion[0x2];
    /* 0x0E */ byte BuildingLevel[0x2];
    /* 0x10 */ byte UnderConstruction[0x2];
};

__unaligned struct Client::Game::MJI::IslandState /* Size=0xE8 */
{
    /* 0x00 */ bool CanEditIsland;
    /* 0x01 */ byte CurrentRank;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 CurrentXP;
    /* 0x08 */ byte CurrentProgress;
    /* 0x09 */ byte VillageDevelopmentLevel;
    /* 0x0A */ byte PathsGlamourId;
    /* 0x0B */ byte GroundsGlamourId;
    /* 0x0C */ byte SlopesGlamourId;
    /* 0x0D */ byte UnlockedKeyItems[0x3];
    /* 0x10 */ byte UnlockedRecipes[0x3];
    /*      */ byte _gap_0x13;
    /* 0x14 */ byte LockedPouchItems[0x6D];
    /* 0x81 */ Client::Game::MJI::MJIFarmPasture Farm;
    /* 0x85 */ Client::Game::MJI::MJIFarmPasture Pasture;
    /* 0x89 */ bool PastureUnderCare;
    /* 0x8A */ unsigned __int16 PastureDailyCareFee;
    /* 0x8C */ unsigned __int16 FarmDailyCareFee;
    /* 0x8E */ byte LandmarkHoursToCompletion[0x5];
    /* 0x93 */ byte LandmarkIds[0x5];
    /* 0x98 */ byte LandmarkUnderConstruction[0x5];
    /* 0x9D */ byte LandmarkRotation[0x5];
    /*      */ byte _gap_0xA2[0x2];
    /*      */ byte _gap_0xA4[0x4];
    /* 0xA8 */ Client::Game::MJI::MJIWorkshops Workshops;
    /*      */ byte _gap_0xC4[0x4];
    /* 0xC8 */ Client::Game::MJI::MJIGranaries Granaries;
    /*      */ byte _gap_0xDA[0x2];
    /*      */ byte _gap_0xDC[0x4];
    /* 0xE0 */ byte CabinLevel;
    /* 0xE1 */ byte CabinGlamour;
    /*      */ byte _gap_0xE2[0x2];
    /*      */ byte _gap_0xE4[0x4];
};

__unaligned struct Client::Game::MJI::MJIAnimal /* Size=0x34 */
{
    /* 0x00 */ byte SlotId;
    /* 0x01 */ byte Nickname[0x18];
    /*      */ byte _gap_0x19;
    /*      */ byte _gap_0x1A[0x2];
    /* 0x1C */ unsigned __int32 BNPCNameId;
    /* 0x20 */ unsigned __int32 ObjectId;
    /* 0x24 */ byte AnimalType;
    /* 0x25 */ byte FoodLevel;
    /* 0x26 */ byte Mood;
    /* 0x27 */ bool ManualLeavingsAvailable;
    /* 0x28 */ bool UnderCare;
    /* 0x29 */ bool WasUnderCare;
    /* 0x2A */ bool CareHalted;
    /*      */ byte _gap_0x2B;
    /* 0x2C */ unsigned __int32 AutoFoodItemId;
    /* 0x30 */ byte AutoAvailableLeavings1;
    /* 0x31 */ byte AutoAvailableLeavings2;
    /*      */ byte _gap_0x32[0x2];
};

__unaligned struct Client::Game::MJI::MJIBuildingPlacement /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ unsigned __int32 PlaceId;
    /* 0x08 */ unsigned __int16 SgbId;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::MJI::MJIFarmPasturePlacement /* Size=0xC */
{
    /*     */ byte _gap_0x0[0x8];
    /* 0x8 */ byte SgbId;
    /*     */ byte _gap_0x9;
    /*     */ byte _gap_0xA[0x2];
};

__unaligned struct StdVectorunsignedint32 /* Size=0x18 */
{
    /* 0x00 */ unsigned __int32* First;
    /* 0x08 */ unsigned __int32* Last;
    /* 0x10 */ unsigned __int32* End;
};

__unaligned struct Client::Game::MJI::MJIFarmState /* Size=0x148 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ void* vtbl2;
    /*       */ byte _gap_0x10[0x8];
    /* 0x018 */ bool LayoutInitialized;
    /*       */ byte _gap_0x19;
    /* 0x01A */ unsigned __int16 ReactionEventObjectRowId;
    /*       */ byte _gap_0x1C[0x4];
    /* 0x020 */ byte SeedType[0x14];
    /* 0x034 */ byte GrowthLevel[0x14];
    /* 0x048 */ byte WaterLevel[0x14];
    /* 0x05C */ byte GardenerYield[0x14];
    /* 0x070 */ Client::Game::MJI::FarmSlotFlags FarmSlotFlags[0x14];
    /*       */ byte _gap_0x84[0x4];
    /* 0x088 */ unsigned __int32 PlotObjectIndex[0x14];
    /* 0x0D8 */ unsigned __int32 LayoutId[0x14];
    /* 0x128 */ StdVectorunsignedint32 SeedItemIds;
    /* 0x140 */ __int32 ExpectedTotalYield;
    /* 0x144 */ bool SlotUpdatePending;
    /* 0x145 */ byte SlotUpdateIndex;
    /*       */ byte _gap_0x146[0x2];
};

__unaligned struct Client::Game::MJI::MJIFavorState /* Size=0x50 */
{
    /* 0x00 */ Client::Game::MJI::MJIManager* Manager;
    /*      */ byte _gap_0x8[0x10];
    /* 0x18 */ byte CraftObjectIds[0x9];
    /* 0x21 */ byte NumDelivered[0x9];
    /* 0x2A */ byte Flags1[0x9];
    /* 0x33 */ byte Flags2[0x9];
    /* 0x3C */ byte NumScheduled[0x9];
    /*      */ byte _gap_0x45;
    /*      */ byte _gap_0x46[0x2];
    /* 0x48 */ __int32 UpdateState;
    /*      */ byte _gap_0x4C[0x4];
};

__unaligned struct Client::Game::MJI::MJIGranaryState /* Size=0x48 */
{
    /* 0x00 */ byte ActiveExpeditionId;
    /* 0x01 */ byte RemainingDays;
    /* 0x02 */ byte RareResourcePouchId;
    /*      */ byte _gap_0x3;
    /* 0x04 */ __int16 RareResourceCount;
    /* 0x06 */ byte NormalResourcePouchIds[0x14];
    /* 0x1A */ __int16 NormalResourceCounts[0x14];
    /*      */ byte _gap_0x42[0x2];
    /* 0x44 */ unsigned __int32 FinishTime;
};

__unaligned struct Client::Game::MJI::MJIGranariesState /* Size=0x98 */
{
    /* 0x00 */ Client::Game::MJI::MJIGranaryState Granary[0x2];
    /*      */ byte _gap_0x90[0x8];
};

__unaligned struct Client::Game::MJI::MJILandmarkPlacement /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte HoursToCompletion;
    /* 0x09 */ byte LandmarkId;
    /* 0x0A */ unsigned __int16 UnderConstruction;
    /* 0x0C */ unsigned __int16 Rotation;
    /*      */ byte _gap_0xE[0x2];
};

__unaligned struct Client::Game::MJI::MJIManager /* Size=0x440 */
{
    /*       */ byte _gap_0x0[0x4];
    /*       */ byte _gap_0x4[0x2];
    /* 0x006 */ byte IsPlayerInSanctuary;
    /*       */ byte _gap_0x7;
    /* 0x008 */ Client::Game::MJI::MJIAllowedVisitors AllowedVisitors;
    /*       */ byte _gap_0x9;
    /*       */ byte _gap_0xA[0x2];
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ unsigned __int32 CurrentMode;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x4];
    /* 0x01C */ unsigned __int32 CurrentModeItem;
    /*       */ byte _gap_0x20[0x8];
    /* 0x028 */ Client::Game::MJI::IslandState IslandState;
    /*       */ byte _gap_0x110[0x18];
    /* 0x128 */ Client::Game::MJI::MJIPastureHandler* PastureHandler;
    /* 0x130 */ Client::Game::MJI::MJIFarmState* FarmState;
    /*       */ byte _gap_0x138[0x8];
    /* 0x140 */ Client::Game::MJI::MJIGranariesState* GranariesState;
    /*       */ byte _gap_0x148[0x20];
    /* 0x168 */ Client::Game::MJI::MJIFavorState* FavorState;
    /*       */ byte _gap_0x170[0x60];
    /*       */ byte _gap_0x1D0[0x4];
    /* 0x1D4 */ Client::Game::MJI::MJILandmarkPlacement LandmarkPlacements[0x5];
    /* 0x224 */ Client::Game::MJI::MJIBuildingPlacement BuildingPlacements[0x6];
    /* 0x284 */ Client::Game::MJI::MJIBuildingPlacement CabinPlacement;
    /* 0x294 */ Client::Game::MJI::MJIFarmPasturePlacement FarmPlacements[0x3];
    /* 0x2B8 */ Client::Game::MJI::MJIFarmPasturePlacement PasturePlacements[0x3];
    /*       */ byte _gap_0x2DC[0x4];
    /* 0x2E0 */ unsigned __int16 RequestDemandCraftId;
    /*       */ byte _gap_0x2E2[0x2];
    /* 0x2E4 */ __int32 RequestDemandType;
    /* 0x2E8 */ bool DemandDirty;
    /*       */ byte _gap_0x2E9;
    /*       */ byte _gap_0x2EA[0x2];
    /*       */ byte _gap_0x2EC[0x4];
    /* 0x2F0 */ byte CurrentPopularity;
    /* 0x2F1 */ byte NextPopularity;
    /* 0x2F2 */ byte SupplyAndDemandShifts[0x5B];
    /*       */ byte _gap_0x34D;
    /*       */ byte _gap_0x34E[0x2];
    /*       */ byte _gap_0x350[0x58];
    /* 0x3A8 */ byte CurrentCycleDay;
    /* 0x3A9 */ byte CraftworksRestDays[0x4];
    /*       */ byte _gap_0x3AD;
    /*       */ byte _gap_0x3AE[0x2];
    /*       */ byte _gap_0x3B0[0x40];
    /*       */ byte _gap_0x3F0[0x4];
    /*       */ byte _gap_0x3F4[0x2];
    /* 0x3F6 */ unsigned __int32 CurrentGroove;
    /*       */ byte _gap_0x3FA[0x2];
    /*       */ byte _gap_0x3FC[0x4];
    /*       */ byte _gap_0x400[0x40];
};

__unaligned struct Client::Game::MJI::MJIMinionSlot /* Size=0xC */
{
    /* 0x0 */ byte SlotId;
    /*     */ byte _gap_0x1;
    /*     */ byte _gap_0x2[0x2];
    /* 0x4 */ unsigned __int32 ObjectId;
    /* 0x8 */ unsigned __int16 MinionId;
    /* 0xA */ byte PopAreaId;
    /*     */ byte _gap_0xB;
};

__unaligned struct StdPairunsignedint32unsignedint32 /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 Item1;
    /* 0x4 */ unsigned __int32 Item2;
};

__unaligned struct StdPairunsignedint32StdPairunsignedint32unsignedint32 /* Size=0xC */
{
    /* 0x0 */ unsigned __int32 Item1;
    /* 0x4 */ StdPairunsignedint32unsignedint32 Item2;
};

__unaligned struct StdMap::Nodeunsignedint32StdPairunsignedint32unsignedint32 /* Size=0x30 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32StdPairunsignedint32unsignedint32* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32StdPairunsignedint32unsignedint32* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32StdPairunsignedint32unsignedint32* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32StdPairunsignedint32unsignedint32 KeyValuePair;
    /*      */ byte _gap_0x28[0x8];
};

__unaligned struct StdMapunsignedint32StdPairunsignedint32unsignedint32 /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32StdPairunsignedint32unsignedint32* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct StdPairunsignedint32int32 /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 Item1;
    /* 0x4 */ __int32 Item2;
};

__unaligned struct StdMap::Nodeunsignedint32int32 /* Size=0x30 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32int32* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32int32* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32int32* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32int32 KeyValuePair;
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x8];
};

__unaligned struct StdMapunsignedint32int32 /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32int32* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::Game::MJI::MJIPastureHandler /* Size=0xB78 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x2C0];
    /* 0x2C8 */ StdMapunsignedint32StdPairunsignedint32unsignedint32 AnimalToLeavingItemIds;
    /* 0x2D8 */ StdMapunsignedint32int32 AvailableMammetLeavings;
    /* 0x2E8 */ Client::Game::MJI::MJIAnimal MJIAnimals[0x14];
    /* 0x6F8 */ bool RoamingMinions[0x200];
    /* 0x8F8 */ Client::Game::MJI::MJIMinionSlot MinionSlots[0x32];
    /*       */ byte _gap_0xB50[0x28];
};

__unaligned struct Client::Game::RankData /* Size=0x4 */
{
    /* 0x0 */ byte Counts[0x4];
};

__unaligned struct Client::Game::MonsterNoteRankInfo /* Size=0x40 */
{
    /* 0x00 */ Client::Game::RankData RankDataArray[0xA];
    /* 0x28 */ __int64 Flags;
    /* 0x30 */ __int32 Rank;
    /* 0x34 */ __int32 Unknown2;
    /* 0x38 */ __int32 Index;
    /* 0x3C */ __int32 Unknown3;
};

__unaligned struct Client::Game::MonsterNoteManager /* Size=0x460 */
{
    /* 0x000 */ Client::Game::MonsterNoteRankInfo RankDataArray[0xC];
    /*       */ byte _gap_0x300[0x160];
};

__unaligned struct Client::Game::Object::ClientObjectManager /* Size=0x0 */
{
};

__unaligned struct Client::Graphics::Scene::DrawObject /* Size=0x90 */
{
    /* 0x00 */ Client::Graphics::Scene::Object Object;
    /*      */ byte _gap_0x80[0x8];
    /* 0x88 */ byte Flags;
    /*      */ byte _gap_0x89;
    /*      */ byte _gap_0x8A[0x2];
    /*      */ byte _gap_0x8C[0x4];
};

__unaligned struct Client::Game::Object::GameObject::GameObjectVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /* 0x8 */ Client::Game::Object::GameObjectID (__fastcall *GetObjectID)(Client::Game::Object::GameObject* a1);
    /* 0x10 */ byte (__fastcall *GetObjectKind)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf3;
    /* 0x20 */ bool (__fastcall *GetIsTargetable)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf5;
    /* 0x30 */ byte* (__fastcall *GetName)(Client::Game::Object::GameObject* a1);
    /* 0x38 */ float (__fastcall *GetRadius)(Client::Game::Object::GameObject* a1);
    /* 0x40 */ float (__fastcall *GetHeight)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /* 0x80 */ void (__fastcall *EnableDraw)(Client::Game::Object::GameObject* a1);
    /* 0x88 */ void (__fastcall *DisableDraw)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /* 0xD8 */ Client::Graphics::Scene::DrawObject* (__fastcall *GetDrawObject)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /* 0xF0 */ void (__fastcall *Highlight)(Client::Game::Object::GameObject* a1, Client::Game::Object::ObjectHighlightColor a2);
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /* 0x130 */ void (__fastcall *SetReadyToDraw)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /* 0x178 */ unsigned __int32 (__fastcall *GetNpcID)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf48;
    /*     */ __int64 _vf49;
    /*     */ __int64 _vf50;
    /*     */ __int64 _vf51;
    /*     */ __int64 _vf52;
    /*     */ __int64 _vf53;
    /*     */ __int64 _vf54;
    /*     */ __int64 _vf55;
    /*     */ __int64 _vf56;
    /* 0x1C8 */ bool (__fastcall *IsDead)(Client::Game::Object::GameObject* a1);
    /* 0x1D0 */ bool (__fastcall *IsNotMounted)(Client::Game::Object::GameObject* a1);
    /*     */ __int64 _vf59;
    /*     */ __int64 _vf60;
    /* 0x1E8 */ bool (__fastcall *IsCharacter)(Client::Game::Object::GameObject* a1);
};

__unaligned struct Client::Game::Object::GameObjectManager /* Size=0x3888 */
{
    /*        */ byte _gap_0x0[0x4];
    /* 0x0004 */ byte Active;
    /*        */ byte _gap_0x5;
    /*        */ byte _gap_0x6[0x2];
    /*        */ byte _gap_0x8[0x10];
    /* 0x0018 */ __int64 ObjectList[0x257];
    /* 0x12D0 */ __int64 ObjectListFiltered[0x257];
    /* 0x2588 */ __int64 ObjectList3[0x257];
    /* 0x3840 */ __int32 ObjectListFilteredCount;
    /* 0x3844 */ __int32 ObjectList3Count;
    /*        */ byte _gap_0x3848[0x40];
};

__unaligned struct Client::Game::QuestManager /* Size=0xF58 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ Application::Network::WorkDefinitions::QuestWork NormalQuests[0x1E];
    /*       */ byte _gap_0x2E0[0x2D8];
    /* 0x5B8 */ Application::Network::WorkDefinitions::DailyQuestWork DailyQuests[0xC];
    /*       */ byte _gap_0x678[0x30];
    /* 0x6A8 */ Application::Network::WorkDefinitions::TrackingWork TrackedQuests[0x5];
    /*       */ byte _gap_0x6F8[0x4D0];
    /* 0xBC8 */ Application::Network::WorkDefinitions::BeastReputationWork BeastReputation[0x11];
    /* 0xCD8 */ Application::Network::WorkDefinitions::LeveWork LeveQuests[0x10];
    /* 0xE58 */ byte NumLeveAllowances;
    /*       */ byte _gap_0xE59;
    /*       */ byte _gap_0xE5A[0x2];
    /*       */ byte _gap_0xE5C[0x4];
    /*       */ byte _gap_0xE60[0xE0];
    /* 0xF40 */ byte NumAcceptedQuests;
    /*       */ byte _gap_0xF41;
    /*       */ byte _gap_0xF42[0x2];
    /*       */ byte _gap_0xF44[0x4];
    /*       */ byte _gap_0xF48[0x8];
    /* 0xF50 */ byte NumAcceptedLeveQuests;
    /*       */ byte _gap_0xF51;
    /*       */ byte _gap_0xF52[0x2];
    /*       */ byte _gap_0xF54[0x4];
};

__unaligned struct Client::Game::RaceChocoboManager /* Size=0x26 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte MaximumSpeed;
    /* 0x09 */ byte Acceleration;
    /* 0x0A */ byte Endurance;
    /* 0x0B */ byte Stamina;
    /* 0x0C */ byte Cunning;
    /* 0x0D */ byte Parameters;
    /* 0x0E */ __int16 Father;
    /* 0x10 */ __int16 Mother;
    /* 0x12 */ byte AbilityHereditary;
    /* 0x13 */ byte AbilityLearned;
    /*      */ byte _gap_0x14[0x2];
    /* 0x16 */ __int16 NameFirst;
    /* 0x18 */ __int16 NameLast;
    /* 0x1A */ byte Rank;
    /*      */ byte _gap_0x1B;
    /* 0x1C */ __int16 ExperienceCurrent;
    /* 0x1E */ __int16 ExperienceMax;
    /* 0x20 */ byte Color;
    /* 0x21 */ byte GearHead;
    /* 0x22 */ byte GearBody;
    /* 0x23 */ byte GearLegs;
    /* 0x24 */ byte SessionsAvailable;
    /*      */ byte _gap_0x25;
};

__unaligned struct Client::Game::RecastDetail /* Size=0x14 */
{
    /* 0x00 */ byte IsActive;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 ActionID;
    /* 0x08 */ float Elapsed;
    /* 0x0C */ float Total;
    /*      */ byte _gap_0x10[0x4];
};

__unaligned struct Client::Game::ReconstructionBoxData /* Size=0xA8 */
{
    /*      */ byte _gap_0x0[0xA0];
    /* 0xA0 */ unsigned __int16 Donated;
    /*      */ byte _gap_0xA2[0x2];
    /*      */ byte _gap_0xA4[0x2];
    /* 0xA6 */ unsigned __int16 Allowance;
};

__unaligned struct Client::Game::ReconstructionBoxManager /* Size=0x10 */
{
    /* 0x00 */ Client::Game::ReconstructionBoxData* ReconstructionBoxData;
    /* 0x08 */ void* UnknownDataPointer;
};

__unaligned struct Client::Game::RetainerManager::Retainer /* Size=0x48 */
{
    /* 0x00 */ unsigned __int64 RetainerID;
    /* 0x08 */ byte Name[0x20];
    /* 0x28 */ bool Available;
    /* 0x29 */ byte ClassJob;
    /* 0x2A */ byte Level;
    /* 0x2B */ byte ItemCount;
    /* 0x2C */ unsigned __int32 Gil;
    /* 0x30 */ Client::Game::RetainerManager::RetainerTown Town;
    /* 0x31 */ byte MarkerItemCount;
    /*      */ byte _gap_0x32[0x2];
    /* 0x34 */ unsigned __int32 MarketExpire;
    /* 0x38 */ unsigned __int32 VentureID;
    /* 0x3C */ unsigned __int32 VentureComplete;
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct Client::Game::RetainerManager /* Size=0x310 */
{
    /* 0x000 */ Client::Game::RetainerManager::Retainer Retainers[0xA];
    /* 0x2D0 */ byte DisplayOrder[0xA];
    /* 0x2DA */ byte Ready;
    /* 0x2DB */ byte MaxRetainerEntitlement;
    /*       */ byte _gap_0x2DC[0x4];
    /* 0x2E0 */ unsigned __int64 LastSelectedRetainerId;
    /* 0x2E8 */ unsigned __int32 RetainerObjectId;
    /*       */ byte _gap_0x2EC[0x4];
    /*       */ byte _gap_0x2F0[0x20];
};

__unaligned struct Client::Game::SatisfactionSupplyManager /* Size=0x31F */
{
    /*       */ byte _gap_0x0;
    /* 0x001 */ byte BonusGuaranteeRowId;
    /* 0x002 */ unsigned __int16 SatisfactionArray[0xA];
    /* 0x016 */ byte SatisfactionRankArray[0xA];
    /* 0x020 */ byte UsedAllowanceArray[0xA];
    /* 0x02A */ Client::Game::SatisfactionSupplyNpc CurrentNpc;
    /* 0x02C */ __int16 CurrentSupplyRowId;
    /* 0x02E */ __int16 CurrentSupplySubRowIds[0x4];
    /* 0x036 */ __int16 CurrentSupplyRewardRowIds[0x4];
    /*       */ byte _gap_0x3E[0x2];
    /*       */ byte _gap_0x40[0x2D8];
    /*       */ byte _gap_0x318[0x4];
    /*       */ byte _gap_0x31C[0x2];
    /*       */ byte _gap_0x31E;
};

__unaligned struct Client::Game::SavedAppearanceSlot /* Size=0x140 */
{
    /* 0x000 */ unsigned __int32 Magic;
    /* 0x004 */ unsigned __int32 Version;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Client::Game::Character::CustomizeData CustomizeData;
    /*       */ byte _gap_0x2A[0x2];
    /*       */ byte _gap_0x2C[0x4];
    /* 0x030 */ byte LabelBytes[0x40];
    /*       */ byte _gap_0x70[0xC0];
    /*       */ byte _gap_0x130[0x4];
    /* 0x134 */ bool IsCreated;
    /*       */ byte _gap_0x135;
    /*       */ byte _gap_0x136[0x2];
    /*       */ byte _gap_0x138[0x4];
    /* 0x13C */ byte SlotIndex;
    /*       */ byte _gap_0x13D;
    /*       */ byte _gap_0x13E[0x2];
};

__unaligned struct Client::Game::SavedAppearanceManager /* Size=0x9EB8 */
{
    /* 0x0000 */ Client::Game::SavedAppearanceManager::SavedAppearanceManagerVTable* VTable;
    /* 0x0008 */ Client::Game::SavedAppearanceSlot Slot[0x28];
    /*        */ byte _gap_0x3208[0x6CB0];
};

__unaligned struct Client::Game::SavedAppearanceManager::SavedAppearanceManagerVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /* 0x8 */ bool (__fastcall *IsSlotCreated)(Client::Game::SavedAppearanceManager* a1, byte a2);
    /* 0x10 */ Client::Game::SavedAppearanceSlot* (__fastcall *GetSlot)(Client::Game::SavedAppearanceManager* a1, byte a2);
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /* 0x30 */ unsigned __int32 (__fastcall *GetSlotCount)(Client::Game::SavedAppearanceManager* a1);
};

__unaligned struct Client::Game::TitleList /* Size=0x68 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte TitlesUnlockBitmask[0x5C];
    /* 0x64 */ bool DataPending;
    /* 0x65 */ bool DataReceived;
    /* 0x66 */ bool DataRequested;
    /*      */ byte _gap_0x67;
};

__unaligned struct Client::Game::UI::Achievement /* Size=0x558 */
{
    /* 0x000 */ void** vtbl;
    /* 0x008 */ Client::Game::UI::Achievement::AchievementState State;
    /* 0x00C */ byte CompletedAchievements[0x1AC];
    /*       */ byte _gap_0x1B8[0x20];
    /*       */ byte _gap_0x1D8[0x4];
    /* 0x1DC */ Client::Game::UI::Achievement::AchievementState ProgressRequestState;
    /* 0x1E0 */ unsigned __int32 ProgressAchievementId;
    /* 0x1E4 */ unsigned __int32 ProgressCurrent;
    /* 0x1E8 */ unsigned __int32 ProgressMax;
    /*       */ byte _gap_0x1EC[0x4];
    /*       */ byte _gap_0x1F0[0x368];
};

__unaligned struct Client::Game::UI::AreaInstance /* Size=0x28 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ void* vtbl;
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ __int32 Instance;
    /*      */ byte _gap_0x24[0x4];
};

__unaligned struct Client::Game::UI::Buddy::BuddyMember /* Size=0x300 */
{
    /* 0x000 */ unsigned __int32 ObjectID;
    /* 0x004 */ unsigned __int32 CurrentHealth;
    /* 0x008 */ unsigned __int32 MaxHealth;
    /* 0x00C */ byte DataID;
    /* 0x00D */ byte Synced;
    /*       */ byte _gap_0xE[0x2];
    /* 0x010 */ Client::Game::StatusManager StatusManager;
};

__unaligned struct Client::Game::UI::CompanionInfo /* Size=0x48 */
{
    /* 0x00 */ Client::Game::UI::Buddy::BuddyMember* Companion;
    /* 0x08 */ float TimeLeft;
    /* 0x0C */ byte BuddyEquipUnlockBitmask[0xC];
    /* 0x18 */ byte BardingHead;
    /* 0x19 */ byte BardingChest;
    /* 0x1A */ byte BardingFeet;
    /* 0x1B */ byte NameBytes[0x15];
    /* 0x30 */ unsigned __int32 CurrentXP;
    /* 0x34 */ byte Rank;
    /* 0x35 */ byte Stars;
    /* 0x36 */ byte SkillPoints;
    /* 0x37 */ byte DefenderLevel;
    /* 0x38 */ byte AttackerLevel;
    /* 0x39 */ byte HealerLevel;
    /* 0x3A */ byte ActiveCommand;
    /* 0x3B */ byte FavoriteFeed;
    /* 0x3C */ byte CurrentColorStainId;
    /* 0x3D */ byte Mounted;
    /*      */ byte _gap_0x3E[0x2];
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct Client::Game::UI::PetInfo /* Size=0x10 */
{
    /* 0x00 */ Client::Game::UI::Buddy::BuddyMember* Pet;
    /* 0x08 */ byte Order;
    /* 0x09 */ byte Stance;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Game::UI::DutyHelperInfo /* Size=0x28 */
{
    /* 0x00 */ Client::Game::UI::Buddy::BuddyMember* DutyHelpers;
    /*      */ byte _gap_0x8;
    /* 0x09 */ bool HasHelpers;
    /*      */ byte _gap_0xA[0x2];
    /* 0x0C */ unsigned __int32 ENpcIds[0x7];
};

__unaligned struct Client::Game::UI::Buddy /* Size=0x1B80 */
{
    /* 0x0000 */ Client::Game::UI::Buddy::BuddyMember Companion;
    /* 0x0300 */ Client::Game::UI::Buddy::BuddyMember Pet;
    /* 0x0600 */ Client::Game::UI::Buddy::BuddyMember BattleBuddies[0x7];
    /* 0x1B00 */ Client::Game::UI::CompanionInfo CompanionInfo;
    /* 0x1B48 */ Client::Game::UI::PetInfo PetInfo;
    /* 0x1B58 */ Client::Game::UI::DutyHelperInfo DutyHelperInfo;
};

__unaligned struct Client::Game::UI::Cabinet /* Size=0x84 */
{
    /* 0x00 */ Client::Game::UI::Cabinet::CabinetState State;
    /* 0x04 */ byte UnlockedItems[0x80];
};

__unaligned struct Client::Game::UI::Chain /* Size=0x8 */
{
    /* 0x0 */ float RemainingTime;
    /* 0x4 */ float MaxTime;
};

__unaligned struct Client::Game::UI::ContentsFinderQueueInfo /* Size=0x90 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ byte QueuedContentFinderConditionId1;
    /*      */ byte _gap_0x5;
    /*      */ byte _gap_0x6[0x2];
    /*      */ byte _gap_0x8[0x4];
    /* 0x0C */ byte QueuedContentFinderConditionId2;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ byte QueuedContentFinderConditionId3;
    /*      */ byte _gap_0x15;
    /*      */ byte _gap_0x16[0x2];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ byte QueuedContentFinderConditionId4;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ byte QueuedContentFinderConditionId5;
    /*      */ byte _gap_0x25;
    /*      */ byte _gap_0x26[0x2];
    /* 0x28 */ unsigned __int32 QueuedClassJobId;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x10];
    /* 0x40 */ __int32 EnteredQueueTimestamp;
    /* 0x44 */ __int32 QueueReadyTimestamp;
    /*      */ byte _gap_0x48[0x8];
    /*      */ byte _gap_0x50[0x4];
    /*      */ byte _gap_0x54;
    /* 0x55 */ Client::Game::UI::ContentsFinderQueueInfo::QueueStates QueueState;
    /*      */ byte _gap_0x56[0x2];
    /*      */ byte _gap_0x58[0x2];
    /* 0x5A */ byte QueuedContentRouletteId;
    /*      */ byte _gap_0x5B;
    /* 0x5C */ signed __int8 PositionInQueue;
    /*      */ byte _gap_0x5D;
    /*      */ byte _gap_0x5E[0x2];
    /*      */ byte _gap_0x60[0x4];
    /*      */ byte _gap_0x64[0x2];
    /*      */ byte _gap_0x66;
    /* 0x67 */ byte AverageWaitTime;
    /*      */ byte _gap_0x68[0x10];
    /*      */ byte _gap_0x78[0x4];
    /* 0x7C */ Client::Game::UI::ContentsFinderQueueInfo::PoppedContentTypes PoppedContentType;
    /*      */ byte _gap_0x7D;
    /*      */ byte _gap_0x7E[0x2];
    /* 0x80 */ unsigned __int32 PoppedContentId;
    /*      */ byte _gap_0x84[0x4];
    /* 0x88 */ bool PoppedContentIsUnrestrictedParty;
    /* 0x89 */ bool PoppedContentIsMinimalIL;
    /* 0x8A */ bool PoppedContentIsLevelSync;
    /* 0x8B */ bool PoppedContentIsSilenceEcho;
    /* 0x8C */ bool PoppedContentIsExplorerMode;
    /*      */ byte _gap_0x8D;
    /*      */ byte _gap_0x8E[0x2];
};

__unaligned struct Client::Game::UI::ContentsFinder /* Size=0xB0 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x10];
    /* 0x18 */ Client::Game::UI::ContentsFinder::LootRule LootRules;
    /* 0x19 */ bool IsUnrestrictedParty;
    /* 0x1A */ bool IsMinimalIL;
    /* 0x1B */ bool IsSilenceEcho;
    /* 0x1C */ bool IsExplorerMode;
    /* 0x1D */ bool IsLevelSync;
    /* 0x1E */ bool IsLimitedLevelingRoulette;
    /*      */ byte _gap_0x1F;
    /* 0x20 */ Client::Game::UI::ContentsFinderQueueInfo QueueInfo;
};

__unaligned struct Client::Game::UI::ContentsNote /* Size=0xB8 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte CompletionFlags[0xB];
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ byte SelectedTab;
    /* 0x1D */ byte DisplayCount;
    /*      */ byte _gap_0x1E[0x2];
    /* 0x20 */ __int32 DisplayID[0x11];
    /* 0x64 */ __int32 DisplayStatus[0x11];
    /*      */ byte _gap_0xA8[0x10];
};

__unaligned struct Client::Game::UI::ExtraInspectDataEntry /* Size=0x8 */
{
    /* 0x0 */ __int32 Key;
    /* 0x4 */ __int32 Value;
};

__unaligned struct Client::Game::UI::FieldMarker /* Size=0x20 */
{
    /* 0x00 */ System::Numerics::Vector3 Position;
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ __int32 X;
    /* 0x14 */ __int32 Y;
    /* 0x18 */ __int32 Z;
    /* 0x1C */ bool Active;
    /*      */ byte _gap_0x1D;
    /*      */ byte _gap_0x1E[0x2];
};

__unaligned struct Client::Game::UI::HateInfo /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 ObjectId;
    /* 0x4 */ __int32 Enmity;
};

__unaligned struct Client::Game::UI::Hate /* Size=0x108 */
{
    /* 0x000 */ Client::Game::UI::HateInfo HateArray[0x20];
    /* 0x100 */ __int32 HateArrayLength;
    /* 0x104 */ unsigned __int32 HateTargetId;
};

__unaligned struct Client::Game::UI::HaterInfo /* Size=0x48 */
{
    /* 0x00 */ byte Name[0x40];
    /* 0x40 */ unsigned __int32 ObjectId;
    /* 0x44 */ __int32 Enmity;
};

__unaligned struct Client::Game::UI::Hater /* Size=0x908 */
{
    /* 0x000 */ Client::Game::UI::HaterInfo HaterArray[0x20];
    /* 0x900 */ __int32 HaterArrayLength;
    /*       */ byte _gap_0x904[0x4];
};

__unaligned struct Client::Game::UI::Hotbar /* Size=0x8 */
{
    union {
    /* 0x0 */ Client::UI::Misc::RaptureHotbarModule::ClearCallback* ClearCallback;
    /* 0x0 */ Client::Game::UI::Hotbar::HotbarVTable* VTable;
    } _union_0x0;
};

__unaligned struct Client::UI::Misc::UserFileManager::UserFileEvent /* Size=0x40 */
{
    /* 0x00 */ Client::UI::Misc::UserFileManager::UserFileEvent::UserFileEventVTable* VTable;
    /* 0x08 */ unsigned __int64 CharacterContentID;
    /* 0x10 */ __int64 UserFileManager;
    /* 0x18 */ __int64 TempDataPtr;
    /* 0x20 */ unsigned __int32 TempDataBytesWritten;
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x8];
    /* 0x30 */ byte FileName[0xC];
    /* 0x3C */ bool Unk3C;
    /* 0x3D */ bool IsSavePending;
    /* 0x3E */ bool HasChanges;
    /* 0x3F */ bool IsVirtual;
};

__unaligned struct Client::UI::Misc::HotBarSlot /* Size=0xE0 */
{
    /* 0x00 */ Client::System::String::Utf8String PopUpHelp;
    /* 0x68 */ byte CostText[0x20];
    /* 0x88 */ byte PopUpKeybindHint[0x20];
    /* 0xA8 */ byte KeybindHint[0x10];
    /* 0xB8 */ unsigned __int32 CommandId;
    /* 0xBC */ unsigned __int32 IconA;
    /* 0xC0 */ unsigned __int32 IconB;
    /* 0xC4 */ unsigned __int16 UNK_0xC4;
    /*      */ byte _gap_0xC6;
    /* 0xC7 */ Client::UI::Misc::HotbarSlotType CommandType;
    /* 0xC8 */ Client::UI::Misc::HotbarSlotType IconTypeA;
    /* 0xC9 */ Client::UI::Misc::HotbarSlotType IconTypeB;
    /* 0xCA */ byte CostType;
    /* 0xCB */ byte CostDisplayMode;
    /* 0xCC */ __int32 Icon;
    /* 0xD0 */ unsigned __int32 CostValue;
    /* 0xD4 */ unsigned __int32 UNK_0xD4;
    /* 0xD8 */ unsigned __int32 UNK_0xD8;
    /* 0xDC */ byte UNK_0xDC;
    /* 0xDD */ byte UNK_0xDD;
    /* 0xDE */ byte UNK_0xDE;
    /* 0xDF */ byte IsLoaded;
};

__unaligned struct Client::UI::Misc::HotBar /* Size=0xE00 */
{
    /* 0x000 */ Client::UI::Misc::HotBarSlot Slots[0x10];
};

__unaligned struct Client::UI::Misc::SavedHotBarSlot /* Size=0x5 */
{
    /* 0x0 */ Client::UI::Misc::HotbarSlotType CommandType;
    /* 0x1 */ unsigned __int32 CommandId;
};

__unaligned struct Client::UI::Misc::SavedHotBar /* Size=0x50 */
{
    /* 0x00 */ Client::UI::Misc::SavedHotBarSlot Slots[0x10];
};

__unaligned struct Client::UI::Misc::SavedHotBarGroup /* Size=0x5A0 */
{
    /* 0x000 */ Client::UI::Misc::SavedHotBar HotBars[0x12];
};

__unaligned struct Client::UI::Misc::DutyActionSlot /* Size=0xE8 */
{
    /* 0x00 */ Client::UI::Misc::HotBarSlot Slot;
    /* 0xE0 */ byte PrimaryCostType;
    /* 0xE1 */ bool IsActive;
    /*      */ byte _gap_0xE2[0x2];
    /*      */ byte _gap_0xE4[0x4];
};

__unaligned struct Client::UI::Misc::RaptureHotbarModule /* Size=0x288F8 */
{
    /* 0x00000 */ Client::UI::Misc::UserFileManager::UserFileEvent UserFileEvent;
    /* 0x00040 */ void** InputCodeModifiedInterfaceVTable;
    /* 0x00048 */ Client::UI::UIModule* UiModule;
    /* 0x00050 */ bool ModuleReady;
    /* 0x00051 */ byte ActiveHotbarClassJobId;
    /* 0x00052 */ bool DatFileLoadedSuccessfully;
    /*         */ byte _gap_0x53;
    /* 0x00054 */ bool ExpacJobHotbarsCreated[0xC];
    /* 0x00060 */ bool PvPHotbarsCreated[0x16];
    /* 0x00076 */ bool ClearCallbackPresent;
    /*         */ byte _gap_0x77;
    /* 0x00078 */ unsigned __int32 MateriaMeldState;
    /* 0x0007C */ byte HotbarShareStateBitmask[0x4];
    /* 0x00080 */ byte HotbarShareStateBitmask2[0x4];
    /*         */ byte _gap_0x84[0x4];
    /* 0x00088 */ Client::UI::Misc::RaptureHotbarModule::ClearCallback* ClearCallbackPtr;
    /* 0x00090 */ Client::UI::Misc::HotBar HotBars[0x12];
    /* 0x0FC90 */ Client::UI::Misc::HotBar PetHotBar;
    /* 0x10A90 */ Client::UI::Misc::HotBar PetCrossHotBar;
    /* 0x11890 */ Client::UI::Misc::HotBarSlot ScratchSlot;
    /* 0x11970 */ unsigned __int32 PetHotbarMode;
    /* 0x11974 */ Client::UI::Misc::SavedHotBarGroup SavedHotBars[0x41];
    /* 0x28714 */ Client::UI::Misc::CrossHotbarFlags CrossHotbarFlags;
    /*         */ byte _gap_0x28716[0x2];
    /* 0x28718 */ unsigned __int32 GrandCompanyId;
    /* 0x2871C */ bool PvPHotbarsActive;
    /* 0x2871D */ bool ShowPvPHotbarSwapNotification;
    /*         */ byte _gap_0x2871E[0x2];
    /* 0x28720 */ Client::UI::Misc::DutyActionSlot DutyActionSlots[0x2];
    /* 0x288F0 */ bool DutyActionsPresent;
    /*         */ byte _gap_0x288F1;
    /*         */ byte _gap_0x288F2[0x2];
    /*         */ byte _gap_0x288F4[0x4];
};

__unaligned struct Client::Game::UI::Hotbar::HotbarVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /* 0x8 */ bool (__fastcall *ResetAllHotbars)(Client::Game::UI::Hotbar* a1, Client::UI::Misc::RaptureHotbarModule* a2);
    /* 0x10 */ bool (__fastcall *ResetPvEHotbarsForClass)(Client::Game::UI::Hotbar* a1, Client::UI::Misc::RaptureHotbarModule* a2, __int32 a3);
    /* 0x18 */ byte (__fastcall *ResetPvPHotbarsForClass)(Client::Game::UI::Hotbar* a1, Client::UI::Misc::RaptureHotbarModule* a2, unsigned __int32 a3);
};

__unaligned struct Client::Game::UI::Inspect /* Size=0x278 */
{
    /*       */ byte _gap_0x0[0x8];
    /*       */ byte _gap_0x8[0x4];
    /* 0x00C */ unsigned __int32 ObjectID;
    /* 0x010 */ byte Type;
    /*       */ byte _gap_0x11;
    /* 0x012 */ __int16 WorldId;
    /* 0x014 */ byte Name[0x40];
    /* 0x054 */ byte PSNOnlineID[0x11];
    /*       */ byte _gap_0x65;
    /*       */ byte _gap_0x66[0x2];
    /*       */ byte _gap_0x68[0x8];
    /*       */ byte _gap_0x70[0x4];
    /*       */ byte _gap_0x74;
    /* 0x075 */ byte ClassJobId;
    /* 0x076 */ byte Level;
    /* 0x077 */ byte SyncedLevel;
    /*       */ byte _gap_0x78;
    /* 0x079 */ unsigned __int16 AverageItemLevel;
    /* 0x07B */ unsigned __int16 TitleId;
    /* 0x07D */ byte GrandCompanyIndex;
    /* 0x07E */ byte GrandCompanyRank;
    /* 0x07F */ Client::Game::Character::CustomizeData CustomizeData;
    /* 0x099 */ byte BuddyEquipTop;
    /* 0x09A */ byte BuddyEquipBody;
    /* 0x09B */ byte BuddyEquipLegs;
    /*       */ byte _gap_0x9C[0x4];
    /*       */ byte _gap_0xA0[0x30];
    /*       */ byte _gap_0xD0[0x4];
    /*       */ byte _gap_0xD4[0x2];
    /*       */ byte _gap_0xD6;
    /* 0x0D7 */ unsigned __int32 BaseParams[0x4A];
    /*       */ byte _gap_0x1FF;
    /*       */ byte _gap_0x200;
    /* 0x201 */ byte GearVisibilityFlag;
    /*       */ byte _gap_0x202[0x2];
    /*       */ byte _gap_0x204[0x4];
    /*       */ byte _gap_0x208[0x8];
    /* 0x210 */ byte BuddyOwnerName[0x40];
    /* 0x250 */ byte BuddyRank;
    /* 0x251 */ byte BuddyStain;
    /* 0x252 */ byte BuddyDefenderLevel;
    /* 0x253 */ byte BuddyAttackerLevel;
    /* 0x254 */ byte BuddyHealerLevel;
    /*       */ byte _gap_0x255;
    /*       */ byte _gap_0x256[0x2];
    /*       */ byte _gap_0x258[0x2];
    /*       */ byte _gap_0x25A;
    /* 0x25B */ byte ExtraInspectData[0x18];
    /*       */ byte _gap_0x273;
    /*       */ byte _gap_0x274[0x4];
};

__unaligned struct Client::Game::UI::LimitBreakController /* Size=0x10 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte BarCount;
    /*      */ byte _gap_0x9;
    /* 0x0A */ unsigned __int16 CurrentValue;
    /* 0x0C */ unsigned __int32 BarValue;
};

__unaligned struct Client::Game::UI::LootItem /* Size=0x40 */
{
    /* 0x00 */ unsigned __int32 ChestObjectId;
    /* 0x04 */ unsigned __int32 ChestItemIndex;
    /* 0x08 */ unsigned __int32 ItemId;
    /* 0x0C */ unsigned __int16 ItemCount;
    /*      */ byte _gap_0xE[0x2];
    /*      */ byte _gap_0x10[0x10];
    /* 0x20 */ Client::Game::UI::RollState RollState;
    /* 0x24 */ Client::Game::UI::RollResult RollResult;
    /* 0x28 */ unsigned __int32 RollValue;
    /* 0x2C */ float Time;
    /* 0x30 */ float MaxTime;
    /*      */ byte _gap_0x34[0x4];
    /* 0x38 */ Client::Game::UI::LootMode LootMode;
    /*      */ byte _gap_0x3C[0x4];
};

__unaligned struct Client::Game::UI::Loot /* Size=0x6A0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ Client::Game::UI::LootItem ItemArray[0x10];
    /* 0x410 */ __int32 SelectedIndex;
    /*       */ byte _gap_0x414[0x4];
    /* 0x418 */ unsigned __int32 UnkObjectId;
    /*       */ byte _gap_0x41C[0x4];
    /*       */ byte _gap_0x420[0x258];
    /* 0x678 */ unsigned __int32 UnkObjectId2;
    /*       */ byte _gap_0x67C[0x4];
    /*       */ byte _gap_0x680[0x20];
};

__unaligned struct StdVectorClientGameUIMapMarkerData /* Size=0x18 */
{
    /* 0x00 */ Client::Game::UI::MapMarkerData* First;
    /* 0x08 */ Client::Game::UI::MapMarkerData* Last;
    /* 0x10 */ Client::Game::UI::MapMarkerData* End;
};

__unaligned struct Client::Game::UI::MarkerInfo /* Size=0x90 */
{
    /*      */ byte _gap_0x0[0x4];
    /* 0x04 */ unsigned __int32 ObjectiveId;
    /* 0x08 */ Client::System::String::Utf8String Label;
    /* 0x70 */ StdVectorClientGameUIMapMarkerData MarkerData;
    /*      */ byte _gap_0x88[0x2];
    /*      */ byte _gap_0x8A;
    /* 0x8B */ bool ShouldRender;
    /*      */ byte _gap_0x8C[0x4];
};

__unaligned struct StdList::NodeClientGameUIMarkerInfo /* Size=0xA0 */
{
    /* 0x00 */ StdList::NodeClientGameUIMarkerInfo* Next;
    /* 0x08 */ StdList::NodeClientGameUIMarkerInfo* Previous;
    /* 0x10 */ Client::Game::UI::MarkerInfo Value;
};

__unaligned struct StdListClientGameUIMarkerInfo /* Size=0x10 */
{
    /* 0x00 */ StdList::NodeClientGameUIMarkerInfo* Head;
    /* 0x08 */ unsigned __int64 Size;
};

__unaligned struct Client::Game::UI::Map /* Size=0x4000 */
{
    /*        */ byte _gap_0x0[0x98];
    /* 0x0098 */ Client::Game::UI::MarkerInfo QuestData[0x1E];
    /* 0x1178 */ Client::Game::UI::MarkerInfo LevequestData[0x10];
    /*        */ byte _gap_0x1A78[0x78];
    /* 0x1AF0 */ StdVectorClientGameUIMapMarkerData ActiveLevequest;
    /*        */ byte _gap_0x1B08[0x10];
    /* 0x1B18 */ StdListClientGameUIMarkerInfo UnacceptedQuests;
    /*        */ byte _gap_0x1B28[0x38];
    /* 0x1B60 */ StdListClientGameUIMarkerInfo GuildLeveAssignments;
    /*        */ byte _gap_0x1B70[0x38];
    /* 0x1BA8 */ StdListClientGameUIMarkerInfo GuildOrderGuides;
    /* 0x1BB8 */ Client::Game::UI::MarkerInfo HousingData[0x3E];
    /* 0x3E98 */ StdListClientGameUIMarkerInfo TripleTriad;
    /* 0x3EA8 */ StdListClientGameUIMarkerInfo CustomTalk;
    /*        */ byte _gap_0x3EB8[0x98];
    /* 0x3F50 */ StdListClientGameUIMarkerInfo GemstoneTraders;
    /*        */ byte _gap_0x3F60[0xA0];
};

__unaligned struct Client::Game::UI::MapMarkerContainer /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerContainer::LinkedList* List;
    /* 0x8 */ __int32 Size;
};

__unaligned struct Client::Game::UI::MapMarkerContainer::LinkedList /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerNode* First;
    /* 0x8 */ Client::Game::UI::MapMarkerNode* Last;
};

__unaligned struct Client::Game::UI::MapMarkerData /* Size=0x48 */
{
    /* 0x00 */ unsigned __int32 LevelId;
    /* 0x04 */ unsigned __int32 ObjectiveId;
    /* 0x08 */ Client::System::String::Utf8String* TooltipString;
    /* 0x10 */ unsigned __int32 IconId;
    /*      */ byte _gap_0x14[0x4];
    /* 0x18 */ float X;
    /* 0x1C */ float Y;
    /* 0x20 */ float Z;
    /* 0x24 */ float Radius;
    /*      */ byte _gap_0x28[0x4];
    /* 0x2C */ unsigned __int32 MapId;
    /* 0x30 */ unsigned __int32 PlaceNameZoneId;
    /* 0x34 */ unsigned __int32 PlaceNameId;
    /*      */ byte _gap_0x38[0x4];
    /* 0x3C */ unsigned __int16 RecommendedLevel;
    /* 0x3E */ unsigned __int16 TerritoryTypeId;
    /*      */ byte _gap_0x40[0x8];
};

__unaligned struct Client::Game::UI::MapMarkerNode /* Size=0x0 */
{
    /* 0x0 */ Client::Game::UI::MapMarkerNode* Next;
    /* 0x8 */ Client::Game::UI::MapMarkerNode* Previous;
    /* 0x10 */ Client::Game::UI::MarkerInfo Data;
};

__unaligned struct Client::Game::UI::MarkingController /* Size=0x2E0 */
{
    /*       */ byte _gap_0x0[0x10];
    /* 0x010 */ __int64 MarkerArray[0x11];
    /* 0x098 */ unsigned __int32 LetterMarkerArray[0x1A];
    /* 0x100 */ __int64 MarkerTimeArray[0x11];
    /*       */ byte _gap_0x188[0x58];
    /* 0x1E0 */ Client::Game::UI::FieldMarker FieldMarkerArray[0x8];
};

__unaligned struct Client::Game::UI::MobHunt::KillCounts /* Size=0x14 */
{
    /* 0x00 */ __int32 Counts[0x5];
};

__unaligned struct Client::Game::UI::MobHunt /* Size=0x198 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ byte AvailableMarkId[0x12];
    /* 0x01A */ byte ObtainedMarkId[0x12];
    /* 0x02C */ Client::Game::UI::MobHunt::KillCounts CurrentKills[0x12];
    /* 0x194 */ __int32 ObtainedFlags;
};

__unaligned struct Client::Game::UI::PlayerState /* Size=0x818 */
{
    /* 0x000 */ byte IsLoaded;
    /* 0x001 */ byte CharacterName[0x40];
    /* 0x041 */ byte PSNOnlineID[0x11];
    /*       */ byte _gap_0x52[0x2];
    /*       */ byte _gap_0x54[0x4];
    /*       */ byte _gap_0x58[0x8];
    /*       */ byte _gap_0x60[0x4];
    /* 0x064 */ unsigned __int32 ObjectId;
    /* 0x068 */ unsigned __int64 ContentId;
    /* 0x070 */ unsigned __int32 PenaltyTimestamps[0x2];
    /*       */ byte _gap_0x78;
    /* 0x079 */ byte MaxLevel;
    /* 0x07A */ byte MaxExpansion;
    /* 0x07B */ byte Sex;
    /* 0x07C */ byte Race;
    /* 0x07D */ byte Tribe;
    /* 0x07E */ byte CurrentClassJobId;
    /*       */ byte _gap_0x7F;
    /* 0x080 */ __int64 CurrentClassJobRow;
    /* 0x088 */ __int16 CurrentLevel;
    /* 0x08A */ __int16 ClassJobLevelArray[0x20];
    /*       */ byte _gap_0xCA[0x2];
    /* 0x0CC */ __int32 ClassJobExpArray[0x20];
    /* 0x14C */ __int16 SyncedLevel;
    /* 0x14E */ byte IsLevelSynced;
    /* 0x14F */ bool HasPremiumSaddlebag;
    /*       */ byte _gap_0x150[0x2];
    /* 0x152 */ byte GuardianDeity;
    /* 0x153 */ byte BirthMonth;
    /* 0x154 */ byte BirthDay;
    /* 0x155 */ byte FirstClass;
    /* 0x156 */ byte StartTown;
    /* 0x157 */ byte QuestSpecialFlags;
    /*       */ byte _gap_0x158[0x18];
    /* 0x170 */ __int32 BaseStrength;
    /* 0x174 */ __int32 BaseDexterity;
    /* 0x178 */ __int32 BaseVitality;
    /* 0x17C */ __int32 BaseIntelligence;
    /* 0x180 */ __int32 BaseMind;
    /* 0x184 */ __int32 BasePiety;
    /* 0x188 */ __int32 Attributes[0x4A];
    /* 0x2B0 */ byte GrandCompany;
    /* 0x2B1 */ byte GCRankMaelstrom;
    /* 0x2B2 */ byte GCRankTwinAdders;
    /* 0x2B3 */ byte GCRankImmortalFlames;
    /* 0x2B4 */ unsigned __int16 HomeAetheryteId;
    /* 0x2B6 */ byte FavouriteAetheryteCount;
    /*       */ byte _gap_0x2B7;
    /* 0x2B8 */ unsigned __int16 FavouriteAetheryteArray[0x4];
    /* 0x2C0 */ unsigned __int16 FreeAetheryteId;
    /* 0x2C2 */ unsigned __int16 FreeAetherytePlayStationPlus;
    /* 0x2C4 */ unsigned __int32 BaseRestedExperience;
    /*       */ byte _gap_0x2C8[0x10];
    /*       */ byte _gap_0x2D8[0x4];
    /*       */ byte _gap_0x2DC;
    /* 0x2DD */ byte OwnedMountsBitmask[0x23];
    /* 0x300 */ byte UnlockedOrnamentsBitmask[0x6];
    /* 0x306 */ byte NumOwnedMounts;
    /*       */ byte _gap_0x307;
    /*       */ byte _gap_0x308[0xA8];
    /*       */ byte _gap_0x3B0[0x4];
    /* 0x3B4 */ byte CaughtFishBitmask[0x9F];
    /*       */ byte _gap_0x453;
    /*       */ byte _gap_0x454[0x4];
    /* 0x458 */ unsigned __int32 NumFishCaught;
    /* 0x45C */ unsigned __int32 FishingBait;
    /* 0x460 */ byte UnlockedSpearfishingNotebookBitmask[0x7];
    /* 0x467 */ byte CaughtSpearfishBitmask[0x24];
    /*       */ byte _gap_0x48B;
    /* 0x48C */ unsigned __int32 NumSpearfishCaught;
    /*       */ byte _gap_0x490[0x4];
    /* 0x494 */ byte ContentRouletteCompletion[0xC];
    /* 0x4A0 */ __int16 PlayerCommendations;
    /* 0x4A2 */ byte SelectedPoses[0x7];
    /* 0x4A9 */ byte PlayerStateFlags1;
    /* 0x4AA */ byte PlayerStateFlags2;
    /* 0x4AB */ byte PlayerStateFlags3;
    /*       */ byte _gap_0x4AC[0x4];
    /*       */ byte _gap_0x4B0[0x20];
    /*       */ byte _gap_0x4D0[0x4];
    /* 0x4D4 */ byte SightseeingLogUnlockState;
    /* 0x4D5 */ byte SightseeingLogUnlockStateEx;
    /* 0x4D6 */ byte UnlockedAdventureExPhaseBitmask[0x1];
    /*       */ byte _gap_0x4D7;
    /*       */ byte _gap_0x4D8[0x28];
    /* 0x500 */ byte UnlockedAdventureBitmask[0x25];
    /*       */ byte _gap_0x525;
    /*       */ byte _gap_0x526[0x2];
    /*       */ byte _gap_0x528;
    /* 0x529 */ byte UnlockFlags[0x2C];
    /*       */ byte _gap_0x555;
    /*       */ byte _gap_0x556[0x2];
    /*       */ byte _gap_0x558;
    /* 0x559 */ byte DeliveryLevel;
    /*       */ byte _gap_0x55A;
    /* 0x55B */ byte MeisterFlag;
    /*       */ byte _gap_0x55C[0x4];
    /* 0x560 */ unsigned __int32 SquadronMissionCompletionTimestamp;
    /* 0x564 */ unsigned __int32 SquadronTrainingCompletionTimestamp;
    /* 0x568 */ unsigned __int16 ActiveGcArmyExpedition;
    /* 0x56A */ unsigned __int16 ActiveGcArmyTraining;
    /* 0x56C */ bool HasNewGcArmyCandidate;
    /*       */ byte _gap_0x56D;
    /* 0x56E */ byte UnlockedMinerFolkloreTomeBitmask[0x2];
    /* 0x570 */ byte UnlockedBotanistFolkloreTomeBitmask[0x2];
    /* 0x572 */ byte UnlockedFishingFolkloreTomeBitmask[0x2];
    /*       */ byte _gap_0x574[0x4];
    /*       */ byte _gap_0x578[0x100];
    /*       */ byte _gap_0x678[0x4];
    /* 0x67C */ byte WeeklyBingoOrderData[0x10];
    /* 0x68C */ byte WeeklyBingoRewardData[0x4];
    /* 0x690 */ unsigned __int16 _weeklyBingoStickers;
    /*       */ byte _gap_0x692[0x2];
    /* 0x694 */ unsigned __int32 _weeklyBingoFlags;
    /* 0x698 */ byte _weeklyBingoTaskStatus[0x4];
    /* 0x69C */ byte WeeklyBingoRequestOpenBingoNo;
    /*       */ byte _gap_0x69D;
    /*       */ byte _gap_0x69E[0x2];
    /*       */ byte _gap_0x6A0[0x38];
    /* 0x6D8 */ byte WeeklyBingoExpMultiplier;
    /* 0x6D9 */ bool WeeklyBingoUnk63;
    /*       */ byte _gap_0x6DA[0x2];
    /*       */ byte _gap_0x6DC[0x4];
    /*       */ byte _gap_0x6E0[0x90];
    /* 0x770 */ byte MentorVersion;
    /*       */ byte _gap_0x771;
    /*       */ byte _gap_0x772[0x2];
    /* 0x774 */ unsigned __int32 DesynthesisLevels[0x8];
    /*       */ byte _gap_0x794[0x4];
    /*       */ byte _gap_0x798[0x80];
};

__unaligned struct Client::Game::UI::PvPProfile /* Size=0x7C */
{
    /* 0x00 */ byte IsLoaded;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ unsigned __int32 ExperienceMaelstrom;
    /* 0x08 */ unsigned __int32 ExperienceTwinAdder;
    /* 0x0C */ unsigned __int32 ExperienceImmortalFlames;
    /* 0x10 */ byte RankMaelstrom;
    /* 0x11 */ byte RankTwinAdder;
    /* 0x12 */ byte RankImmortalFlames;
    /*      */ byte _gap_0x13;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x4];
    /*      */ byte _gap_0x1C[0x2];
    /* 0x1E */ byte Series;
    /* 0x1F */ byte SeriesCurrentRank;
    /* 0x20 */ byte SeriesClaimedRank;
    /*      */ byte _gap_0x21;
    /* 0x22 */ unsigned __int16 SeriesExperience;
    /* 0x24 */ byte PreviousSeriesClaimedRank;
    /* 0x25 */ byte PreviousSeriesRank;
    /*      */ byte _gap_0x26[0x2];
    /* 0x28 */ unsigned __int32 FrontlineTotalMatches;
    /* 0x2C */ unsigned __int32 FrontlineTotalFirstPlace;
    /* 0x30 */ unsigned __int32 FrontlineTotalSecondPlace;
    /* 0x34 */ unsigned __int32 FrontlineTotalThirdPlace;
    /* 0x38 */ unsigned __int16 FrontlineWeeklyMatches;
    /* 0x3A */ unsigned __int16 FrontlineWeeklyFirstPlace;
    /* 0x3C */ unsigned __int16 FrontlineWeeklySecondPlace;
    /* 0x3E */ unsigned __int16 FrontlineWeeklyThirdPlace;
    /*      */ byte _gap_0x40;
    /* 0x41 */ byte CrystallineConflictSeason;
    /* 0x42 */ unsigned __int16 CrystallineConflictCasualMatches;
    /* 0x44 */ unsigned __int16 CrystallineConflictCasualMatchesWon;
    /* 0x46 */ unsigned __int16 CrystallineConflictRankedMatches;
    /* 0x48 */ unsigned __int16 CrystallineConflictRankedMatchesWon;
    /*      */ byte _gap_0x4A[0x2];
    /*      */ byte _gap_0x4C[0x2];
    /* 0x4E */ unsigned __int16 CrystallineConflictCurrentCrystalCredit;
    /* 0x50 */ unsigned __int16 CrystallineConflictHighestCrystalCredit;
    /*      */ byte _gap_0x52[0x2];
    /* 0x54 */ byte CrystallineConflictCurrentRank;
    /* 0x55 */ byte CrystallineConflictHighestRank;
    /* 0x56 */ byte CrystallineConflictCurrentRiser;
    /* 0x57 */ byte CrystallineConflictHighestRiser;
    /* 0x58 */ byte CrystallineConflictCurrentRisingStars;
    /* 0x59 */ byte CrystallineConflictHighestRisingStars;
    /*      */ byte _gap_0x5A[0x2];
    /*      */ byte _gap_0x5C[0x4];
    /*      */ byte _gap_0x60[0x8];
    /*      */ byte _gap_0x68[0x4];
    /* 0x6C */ unsigned __int32 RivalWingsTotalMatches;
    /* 0x70 */ unsigned __int32 RivalWingsTotalMatchesWon;
    /* 0x74 */ unsigned __int32 RivalWingsWeeklyMatches;
    /* 0x78 */ unsigned __int32 RivalWingsWeeklyMatchesWon;
};

__unaligned struct Client::Game::UI::RecipeNote /* Size=0x628 */
{
    /* 0x000 */ unsigned __int32 Jobs[0x8];
    /*       */ byte _gap_0x20[0x98];
    /* 0x0B8 */ Client::Game::UI::RecipeNote::RecipeData* RecipeList;
    /*       */ byte _gap_0xC0[0x568];
};

__unaligned struct Client::Game::UI::RecipeNote::RecipeCrystal /* Size=0x2 */
{
    /* 0x0 */ signed __int8 Id;
    /* 0x1 */ byte Amount;
};

__unaligned struct Client::Game::UI::RecipeNote::RecipeData /* Size=0x3D0 */
{
    /* 0x000 */ Client::Game::UI::RecipeNote::RecipeEntry* Recipes;
    /*       */ byte _gap_0x8[0x3B0];
    /* 0x3B8 */ unsigned __int16 SelectedIndex;
    /*       */ byte _gap_0x3BA[0x2];
    /*       */ byte _gap_0x3BC[0x4];
    /*       */ byte _gap_0x3C0[0x10];
};

__unaligned struct Client::Game::UI::RecipeNote::RecipeIngredient /* Size=0x88 */
{
    /*      */ byte _gap_0x0[0x10];
    /* 0x10 */ Client::System::String::Utf8String Name;
    /* 0x78 */ unsigned __int32 ItemId;
    /* 0x7C */ unsigned __int32 IconId;
    /*      */ byte _gap_0x80[0x2];
    /* 0x82 */ byte Amount;
    /* 0x83 */ byte Flags;
    /*      */ byte _gap_0x84[0x4];
};

__unaligned struct Client::Game::UI::RecipeNote::RecipeEntry /* Size=0x500 */
{
    /* 0x000 */ Client::Game::UI::RecipeNote::RecipeIngredient Ingredients[0x8];
    /* 0x440 */ Client::Game::UI::RecipeNote::RecipeCrystal Crystals[0x2];
    /*       */ byte _gap_0x444[0x4];
    /* 0x448 */ Client::System::String::Utf8String ItemName;
    /* 0x4B0 */ unsigned __int32 IconId;
    /* 0x4B4 */ unsigned __int32 ItemId;
    /* 0x4B8 */ unsigned __int32 StatusRequired;
    /* 0x4BC */ unsigned __int32 ItemRequired;
    /*       */ byte _gap_0x4C0[0x2];
    /* 0x4C2 */ unsigned __int16 RecipeId;
    /* 0x4C4 */ unsigned __int16 Difficulty;
    /*       */ byte _gap_0x4C6[0x2];
    /* 0x4C8 */ unsigned __int32 Quality;
    /* 0x4CC */ unsigned __int16 Durability;
    /* 0x4CE */ byte MaterialQualityFactor;
    /*       */ byte _gap_0x4CF;
    /* 0x4D0 */ unsigned __int16 RequiredCraftsmanship;
    /* 0x4D2 */ unsigned __int16 RequiredControl;
    /* 0x4D4 */ unsigned __int16 QuickSynthCraftsmanship;
    /* 0x4D6 */ unsigned __int16 QuickSynthControl;
    /* 0x4D8 */ unsigned __int16 SecretRecipeBook;
    /*       */ byte _gap_0x4DA[0x2];
    /* 0x4DC */ unsigned __int32 RequiredQuality;
    /* 0x4E0 */ unsigned __int16 SuggestedCraftsmanship;
    /* 0x4E2 */ unsigned __int16 ConditionsFlag;
    /*       */ byte _gap_0x4E4[0x2];
    /* 0x4E6 */ byte AmountResult;
    /* 0x4E7 */ byte CraftType;
    /* 0x4E8 */ byte ClassJobLevel;
    /*       */ byte _gap_0x4E9;
    /* 0x4EA */ byte Stars;
    /*       */ byte _gap_0x4EB;
    /*       */ byte _gap_0x4EC[0x2];
    /* 0x4EE */ byte Flags;
    /* 0x4EF */ byte Flags2;
    /* 0x4F0 */ unsigned __int32 Number;
    /* 0x4F4 */ unsigned __int16 RecipeLevelTableId;
    /* 0x4F6 */ unsigned __int16 PatchNumber;
    /*       */ byte _gap_0x4F8[0x8];
};

__unaligned struct Client::Game::UI::RelicNote /* Size=0x18 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ byte RelicID;
    /* 0x09 */ byte RelicNoteID;
    /* 0x0A */ byte MonsterProgress[0xA];
    /* 0x14 */ __int32 ObjectiveProgress;
};

__unaligned struct Component::GUI::AtkEventInterface /* Size=0x8 */
{
    /* 0x0 */ void** vtbl;
};

__unaligned struct Client::Game::UI::Revive /* Size=0x30 */
{
    /* 0x00 */ Component::GUI::AtkEventInterface AtkEventInterface;
    /*      */ byte _gap_0x8[0x8];
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ float Timer;
    /*      */ byte _gap_0x18[0x8];
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ byte ReviveState;
    /*      */ byte _gap_0x25;
    /*      */ byte _gap_0x26[0x2];
    /*      */ byte _gap_0x28[0x8];
};

__unaligned struct Client::Game::UI::RouletteController /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x70];
};

__unaligned struct Client::Game::UI::SelectUseTicketInvoker /* Size=0x28 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ Client::Game::UI::Telepo* Telepo;
    /*      */ byte _gap_0x18[0x10];
};

__unaligned struct StdVectorClientGameUITeleportInfo /* Size=0x18 */
{
    /* 0x00 */ Client::Game::UI::TeleportInfo* First;
    /* 0x08 */ Client::Game::UI::TeleportInfo* Last;
    /* 0x10 */ Client::Game::UI::TeleportInfo* End;
};

__unaligned struct Client::Game::UI::Telepo /* Size=0x58 */
{
    /* 0x00 */ void* vtbl;
    /*      */ byte _gap_0x8[0x8];
    /* 0x10 */ StdVectorClientGameUITeleportInfo TeleportList;
    /* 0x28 */ Client::Game::UI::SelectUseTicketInvoker UseTicketInvoker;
    /*      */ byte _gap_0x50[0x8];
};

__unaligned struct Client::Game::UI::TeleportInfo /* Size=0x20 */
{
    /* 0x00 */ unsigned __int32 AetheryteId;
    /* 0x04 */ unsigned __int32 GilCost;
    /* 0x08 */ unsigned __int16 TerritoryId;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x8];
    /* 0x18 */ byte Ward;
    /* 0x19 */ byte Plot;
    /* 0x1A */ byte SubIndex;
    /* 0x1B */ byte IsFavourite;
    /*      */ byte _gap_0x1C[0x4];
};

__unaligned struct Client::Game::UI::TerritoryInfo /* Size=0x60 */
{
    /*      */ byte _gap_0x0[0x18];
    /*      */ byte _gap_0x18[0x4];
    /* 0x1C */ __int32 InSanctuary;
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ unsigned __int32 AreaPlaceNameID;
    /* 0x28 */ unsigned __int32 SubAreaPlaceNameID;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x30];
};

__unaligned struct Client::Game::UI::WeaponState /* Size=0x18 */
{
    /* 0x00 */ bool IsUnsheathed;
    /*      */ byte _gap_0x1;
    /*      */ byte _gap_0x2[0x2];
    /* 0x04 */ float SheatheCooldown;
    /* 0x08 */ float AutoSheathTimer;
    /* 0x0C */ bool AutoSheatheState;
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
    /* 0x10 */ bool IsAutoAttacking;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::Game::UI::UIState /* Size=0x17D10 */
{
    /* 0x00000 */ Client::Game::UI::Hotbar Hotbar;
    /* 0x00008 */ Client::Game::UI::Hate Hate;
    /* 0x00110 */ Client::Game::UI::Hater Hater;
    /* 0x00A18 */ Client::Game::UI::Chain Chain;
    /* 0x00A20 */ Client::Game::UI::WeaponState WeaponState;
    /* 0x00A38 */ Client::Game::UI::PlayerState PlayerState;
    /* 0x01250 */ Client::Game::UI::Revive Revive;
    /* 0x01280 */ Client::Game::UI::Inspect Inspect;
    /* 0x014F8 */ Client::Game::UI::Telepo Telepo;
    /* 0x01550 */ Client::Game::UI::Cabinet Cabinet;
    /*         */ byte _gap_0x15D4[0x4];
    /* 0x015D8 */ Client::Game::UI::Achievement Achievement;
    /* 0x01B30 */ Client::Game::UI::Buddy Buddy;
    /*         */ byte _gap_0x36B0[0x4];
    /* 0x036B4 */ Client::Game::UI::PvPProfile PvPProfile;
    /*         */ byte _gap_0x3730[0x8];
    /* 0x03738 */ Client::Game::UI::ContentsNote ContentsNote;
    /* 0x037F0 */ Client::Game::UI::RelicNote RelicNote;
    /*         */ byte _gap_0x3808[0x48];
    /* 0x03850 */ Client::Game::UI::AreaInstance AreaInstance;
    /*         */ byte _gap_0x3878[0x4A0];
    /* 0x03D18 */ Client::Game::UI::Loot Loot;
    /*         */ byte _gap_0x43B8[0x628];
    /* 0x049E0 */ Client::Game::UI::RecipeNote RecipeNote;
    /*         */ byte _gap_0x5008[0x6558];
    /* 0x0B560 */ Client::Game::Event::Director* ActiveDirector;
    /*         */ byte _gap_0xB568[0x140];
    /* 0x0B6A8 */ Client::Game::Fate::FateDirector* FateDirector;
    /*         */ byte _gap_0xB6B0[0x140];
    /* 0x0B7F0 */ Client::Game::UI::Map Map;
    /* 0x0F7F0 */ Client::Game::UI::MarkingController MarkingController;
    /* 0x0FAD0 */ Client::Game::UI::LimitBreakController LimitBreakController;
    /* 0x0FAE0 */ void* TitleController;
    /* 0x0FAE8 */ Client::Game::TitleList TitleList;
    /*         */ byte _gap_0xFB50[0x2C48];
    /* 0x12798 */ Client::Game::UI::RouletteController RouletteController;
    /*         */ byte _gap_0x12808[0x60];
    /* 0x12868 */ Client::Game::UI::ContentsFinder ContentsFinder;
    /*         */ byte _gap_0x12918[0x68];
    /* 0x12980 */ Client::Game::UI::MobHunt MobHunt;
    /*         */ byte _gap_0x12B18[0x4E38];
    /*         */ byte _gap_0x17950[0x4];
    /* 0x17954 */ byte UnlockLinkBitmask[0x40];
    /* 0x17994 */ byte UnlockedAetherytesBitmask[0x1A];
    /* 0x179AE */ byte UnlockedHowtoBitmask[0x24];
    /* 0x179D2 */ byte UnlockedCompanionsBitmask[0x40];
    /* 0x17A12 */ byte ChocoboTaxiStandsBitmask[0xB];
    /*         */ byte _gap_0x17A1D;
    /* 0x17A1E */ byte CutsceneSeenBitmask[0x9F];
    /* 0x17ABD */ byte UnlockedTripleTriadCardsBitmask[0x33];
    /*         */ byte _gap_0x17AF0[0x8];
    /* 0x17AF8 */ unsigned __int64 UnlockedTripleTriadCardsCount;
    /*         */ byte _gap_0x17B00[0x210];
};

__unaligned struct Client::Graphics::Animation::AnimationResourceHandle /* Size=0x0 */
{
};

__unaligned struct Client::Graphics::ByteColor /* Size=0x4 */
{
    /* 0x0 */ byte R;
    /* 0x1 */ byte G;
    /* 0x2 */ byte B;
    /* 0x3 */ byte A;
};

__unaligned struct Client::Graphics::Environment::EnvState /* Size=0x258 */
{
    /*       */ byte _gap_0x0[0x128];
    /*       */ byte _gap_0x128[0x4];
    /* 0x12C */ float Rain;
    /*       */ byte _gap_0x130[0x128];
};

__unaligned struct Client::Graphics::Environment::EnvSoundState /* Size=0x68 */
{
    /*      */ byte _gap_0x0[0x68];
};

__unaligned struct Client::Graphics::Environment::EnvSimulator /* Size=0x310 */
{
    /*       */ byte _gap_0x0[0x310];
};

__unaligned struct Client::Graphics::ReferencedClassBase /* Size=0x10 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ unsigned __int32 RefCount;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::Graphics::Render::Camera /* Size=0x130 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /*       */ byte _gap_0x10[0x40];
    /* 0x050 */ Common::Math::Matrix4x4 ProjectionMatrix;
    /*       */ byte _gap_0x90[0x18];
    /* 0x0A8 */ float FoV;
    /* 0x0AC */ float AspectRatio;
    /* 0x0B0 */ float NearPlane;
    /* 0x0B4 */ float FarPlane;
    /*       */ byte _gap_0xB8[0x78];
};

__unaligned struct Client::Graphics::Render::ShadowCamera /* Size=0x150 */
{
    /* 0x000 */ Client::Graphics::Render::Camera Camera;
    /*       */ byte _gap_0x130[0x20];
};

__unaligned struct Client::Graphics::Environment::EnvManager /* Size=0x910 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ Client::Graphics::Scene::EnvScene* EnvScene;
    /* 0x010 */ float DayTimeSeconds;
    /* 0x014 */ float ActiveTransitionTime;
    /* 0x018 */ float CurrentTransitionTime;
    /* 0x01C */ float TransitionProgress;
    /*       */ byte _gap_0x20[0x4];
    /*       */ byte _gap_0x24[0x2];
    /*       */ byte _gap_0x26;
    /* 0x027 */ byte ActiveWeather;
    /* 0x028 */ float TransitionTime;
    /*       */ byte _gap_0x2C[0x4];
    /* 0x030 */ Client::Graphics::Scene::EnvSpace* EnvSpace;
    /*       */ byte _gap_0x38[0x18];
    /* 0x050 */ Client::Graphics::Environment::EnvState EnvState;
    /*       */ byte _gap_0x2A8[0xE0];
    /* 0x388 */ Client::Graphics::Environment::EnvSoundState EnvSoundState;
    /*       */ byte _gap_0x3F0[0x10];
    /* 0x400 */ Client::Graphics::Environment::EnvSimulator EnvSimulator;
    /*       */ byte _gap_0x710[0x40];
    /* 0x750 */ Client::Graphics::Render::ShadowCamera ShadowCamera;
    /*       */ byte _gap_0x8A0[0x50];
    /*       */ byte _gap_0x8F0[0x4];
    /* 0x8F4 */ unsigned __int32 UnkFlags;
    /*       */ byte _gap_0x8F8[0x18];
};

__unaligned struct Client::Graphics::Kernel::ConstantBuffer /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x20];
    /* 0x20 */ __int32 ByteSize;
    /* 0x24 */ __int32 Flags;
    /* 0x28 */ void* UnsafeSourcePointer;
    /*      */ byte _gap_0x30[0x40];
};

struct Client::Graphics::Kernel::ConstantBufferPointer; /* Size=unknown due to generic type with parameters */
struct Client::Graphics::Kernel::CVector; /* Size=unknown due to generic type with parameters */
__unaligned struct Client::Graphics::Kernel::Device /* Size=0x258 */
{
    /*       */ byte _gap_0x0[0x8];
    /* 0x008 */ void* ContextArray;
    /* 0x010 */ void* RenderThread;
    /*       */ byte _gap_0x18[0x58];
    /* 0x070 */ Client::Graphics::Kernel::SwapChain* SwapChain;
    /*       */ byte _gap_0x78[0x2];
    /* 0x07A */ byte RequestResolutionChange;
    /*       */ byte _gap_0x7B;
    /*       */ byte _gap_0x7C[0x4];
    /*       */ byte _gap_0x80[0x8];
    /* 0x088 */ unsigned __int32 Width;
    /* 0x08C */ unsigned __int32 Height;
    /* 0x090 */ float AspectRatio;
    /* 0x094 */ float GammaCorrection;
    /* 0x098 */ __int32 ColorFilter;
    /* 0x09C */ float ColorFilterRange;
    /*       */ byte _gap_0xA0[0x4];
    /* 0x0A4 */ __int32 FrameRateDivider;
    /*       */ byte _gap_0xA8[0x108];
    /* 0x1B0 */ void* hWnd;
    /*       */ byte _gap_0x1B8[0x8];
    /* 0x1C0 */ unsigned __int32 NewWidth;
    /* 0x1C4 */ unsigned __int32 NewHeight;
    /* 0x1C8 */ __int32 FrameRate;
    /*       */ byte _gap_0x1CC[0x4];
    /*       */ byte _gap_0x1D0[0x50];
    /* 0x220 */ __int32 D3DFeatureLevel;
    /*       */ byte _gap_0x224[0x4];
    /* 0x228 */ void* DXGIFactory;
    /* 0x230 */ void* DXGIOutput;
    /* 0x238 */ void* D3D11Forwarder;
    /* 0x240 */ void* D3D11DeviceContext;
    /*       */ byte _gap_0x248[0x8];
    /* 0x250 */ void* ImmediateContext;
};

__unaligned struct Client::Graphics::Kernel::Notifier /* Size=0x18 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::Graphics::Kernel::Notifier* Next;
    /* 0x10 */ Client::Graphics::Kernel::Notifier* Prev;
};

__unaligned struct Client::Graphics::Kernel::PVShader /* Size=0x60 */
{
    /*      */ byte _gap_0x0[0x28];
    /* 0x28 */ Client::Graphics::Kernel::PVShader::ResourceEntry* ConstantBuffers;
    /* 0x30 */ Client::Graphics::Kernel::PVShader::ResourceEntry* Samplers;
    /* 0x38 */ Client::Graphics::Kernel::PVShader::ResourceEntry* Unknowns;
    /* 0x40 */ unsigned __int16 ConstantBufferCount;
    /*      */ byte _gap_0x42[0x2];
    /* 0x44 */ unsigned __int16 SamplerCount;
    /*      */ byte _gap_0x46[0x2];
    /* 0x48 */ unsigned __int16 UnkCount;
    /*      */ byte _gap_0x4A[0x2];
    /* 0x4C */ unsigned __int16 Unk2Count;
    /*      */ byte _gap_0x4E[0x2];
    /*      */ byte _gap_0x50[0x8];
    /* 0x58 */ unsigned __int32 DxbcBlobSize;
    /*      */ byte _gap_0x5C[0x4];
};

__unaligned struct Client::Graphics::Kernel::PixelShader /* Size=0x68 */
{
    /* 0x00 */ Client::Graphics::Kernel::PVShader Shader;
    /* 0x60 */ void* DirectXObject;
};

__unaligned struct Client::Graphics::Kernel::PVShader::ResourceEntry /* Size=0x8 */
{
    /* 0x0 */ unsigned __int16 Slot;
    /* 0x2 */ unsigned __int16 Size;
    /* 0x4 */ unsigned __int32 Id;
};

__unaligned struct Client::Graphics::Kernel::ShaderNode /* Size=0x38 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::Graphics::Kernel::ShaderPackage* OwnerPackage;
    /* 0x10 */ unsigned __int32 PassNum;
    /* 0x14 */ byte PassIndices[0x10];
    /*      */ byte _gap_0x24[0x4];
    /* 0x28 */ Client::Graphics::Kernel::ShaderNode::ShaderPass* Passes;
    /* 0x30 */ unsigned __int32* ShaderKeys;
};

__unaligned struct Client::Graphics::Kernel::ShaderNode::ShaderPass /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 VertexShader;
    /* 0x4 */ unsigned __int32 PixelShader;
};

__unaligned struct Client::Graphics::Kernel::VertexShader /* Size=0x78 */
{
    /* 0x00 */ Client::Graphics::Kernel::PVShader Shader;
    /* 0x60 */ Client::Graphics::Kernel::VertexShader::Input DeclaredInputs;
    /* 0x64 */ Client::Graphics::Kernel::VertexShader::Input UsedInputs;
    /* 0x68 */ byte* DxbcBlob;
    /* 0x70 */ void* DirectXObject;
};

__unaligned struct StdVectorClientGraphicsKernelVertexShaderPtr /* Size=0x18 */
{
    /* 0x00 */ Client::Graphics::Kernel::VertexShader** First;
    /* 0x08 */ Client::Graphics::Kernel::VertexShader** Last;
    /* 0x10 */ Client::Graphics::Kernel::VertexShader** End;
};

__unaligned struct Client::Graphics::Kernel::CVectorClientGraphicsKernelVertexShaderPtr /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVectorClientGraphicsKernelVertexShaderPtr Vector;
};

__unaligned struct StdVectorClientGraphicsKernelPixelShaderPtr /* Size=0x18 */
{
    /* 0x00 */ Client::Graphics::Kernel::PixelShader** First;
    /* 0x08 */ Client::Graphics::Kernel::PixelShader** Last;
    /* 0x10 */ Client::Graphics::Kernel::PixelShader** End;
};

__unaligned struct Client::Graphics::Kernel::CVectorClientGraphicsKernelPixelShaderPtr /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVectorClientGraphicsKernelPixelShaderPtr Vector;
};

__unaligned struct StdVectorClientGraphicsKernelShaderNodePtr /* Size=0x18 */
{
    /* 0x00 */ Client::Graphics::Kernel::ShaderNode** First;
    /* 0x08 */ Client::Graphics::Kernel::ShaderNode** Last;
    /* 0x10 */ Client::Graphics::Kernel::ShaderNode** End;
};

__unaligned struct Client::Graphics::Kernel::CVectorClientGraphicsKernelShaderNodePtr /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ StdVectorClientGraphicsKernelShaderNodePtr Vector;
};

__unaligned struct Client::Graphics::Kernel::ShaderPackage /* Size=0x418 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x010 */ Client::Graphics::Kernel::CVectorClientGraphicsKernelVertexShaderPtr VertexShaders;
    /* 0x030 */ Client::Graphics::Kernel::CVectorClientGraphicsKernelPixelShaderPtr PixelShaders;
    /* 0x050 */ Client::Graphics::Kernel::CVectorClientGraphicsKernelShaderNodePtr ShaderNodes;
    /* 0x070 */ unsigned __int16 MaterialConstantBufferSize;
    /*       */ byte _gap_0x72[0x2];
    /* 0x074 */ unsigned __int16 MaterialElementCount;
    /*       */ byte _gap_0x76[0x2];
    /* 0x078 */ unsigned __int16 ConstantCount;
    /*       */ byte _gap_0x7A[0x2];
    /* 0x07C */ unsigned __int16 SamplerCount;
    /*       */ byte _gap_0x7E[0x2];
    /* 0x080 */ unsigned __int16 UnkCount;
    /*       */ byte _gap_0x82[0x2];
    /* 0x084 */ unsigned __int16 Unk2Count;
    /*       */ byte _gap_0x86[0x2];
    /* 0x088 */ unsigned __int16 SystemKeyCount;
    /*       */ byte _gap_0x8A[0x2];
    /* 0x08C */ unsigned __int16 SceneKeyCount;
    /*       */ byte _gap_0x8E[0x2];
    /* 0x090 */ unsigned __int16 MaterialKeyCount;
    /*       */ byte _gap_0x92[0x2];
    /*       */ byte _gap_0x94[0x4];
    /* 0x098 */ Client::Graphics::Kernel::ShaderPackage::MaterialElement* MaterialElements;
    /* 0x0A0 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Constants;
    /* 0x0A8 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Samplers;
    /* 0x0B0 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Unknowns;
    /* 0x0B8 */ Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown* Unknowns2;
    /* 0x0C0 */ unsigned __int32* SystemKeys;
    /* 0x0C8 */ unsigned __int32* SceneKeys;
    /* 0x0D0 */ unsigned __int32* MaterialKeys;
    /* 0x0D8 */ unsigned __int32* SystemValues;
    /* 0x0E0 */ unsigned __int32* SceneValues;
    /* 0x0E8 */ unsigned __int32* MaterialValues;
    /* 0x0F0 */ unsigned __int32 SubviewValue1;
    /* 0x0F4 */ unsigned __int32 SubviewValue2;
    /* 0x0F8 */ void* ShaderNodeTreeVtbl;
    /*       */ byte _gap_0x100[0x318];
};

__unaligned struct Client::Graphics::Kernel::ShaderPackage::ConstantSamplerUnknown /* Size=0xC */
{
    /* 0x0 */ unsigned __int32 CRC;
    /* 0x4 */ unsigned __int32 Id;
    /* 0x8 */ unsigned __int16 Size;
    /* 0xA */ unsigned __int16 Slot;
};

__unaligned struct Client::Graphics::Kernel::ShaderPackage::MaterialElement /* Size=0x8 */
{
    /* 0x0 */ unsigned __int32 CRC;
    /* 0x4 */ unsigned __int16 Offset;
    /* 0x6 */ unsigned __int16 Size;
};

__unaligned struct Client::Graphics::Kernel::SwapChain /* Size=0x70 */
{
    /*      */ byte _gap_0x0[0x38];
    /* 0x38 */ unsigned __int32 Width;
    /* 0x3C */ unsigned __int32 Height;
    /*      */ byte _gap_0x40[0x18];
    /* 0x58 */ Client::Graphics::Kernel::Texture* BackBuffer;
    /* 0x60 */ Client::Graphics::Kernel::Texture* DepthStencil;
    /* 0x68 */ void* DXGISwapChain;
};

__unaligned struct Client::Graphics::Kernel::Texture /* Size=0xC0 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ Client::Graphics::Kernel::Texture::TextureVTable* VTable;
    } _union_0x0;
    /*      */ byte _gap_0x8[0x18];
    /* 0x20 */ Client::Graphics::Kernel::Notifier Notifier;
    /* 0x38 */ unsigned __int32 Width;
    /* 0x3C */ unsigned __int32 Height;
    /* 0x40 */ unsigned __int32 Width2;
    /* 0x44 */ unsigned __int32 Height2;
    /* 0x48 */ unsigned __int32 Width3;
    /* 0x4C */ unsigned __int32 Height3;
    /* 0x50 */ unsigned __int32 Depth;
    /* 0x54 */ byte MipLevel;
    /* 0x55 */ byte Unk_55;
    /* 0x56 */ byte Unk_56;
    /* 0x57 */ byte Unk_57;
    /* 0x58 */ Client::Graphics::Kernel::TextureFormat TextureFormat;
    /* 0x5C */ unsigned __int32 Flags;
    /* 0x60 */ byte ArraySize;
    /*      */ byte _gap_0x61;
    /*      */ byte _gap_0x62[0x2];
    /*      */ byte _gap_0x64[0x4];
    /* 0x68 */ void* D3D11Texture2D;
    /* 0x70 */ void* D3D11ShaderResourceView;
    /*      */ byte _gap_0x78[0x48];
};

__unaligned struct Client::Graphics::Kernel::Texture::TextureVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /* 0x10 */ void (__fastcall *IncRef)(Client::Graphics::Kernel::Texture* a1);
    /* 0x18 */ void (__fastcall *DecRef)(Client::Graphics::Kernel::Texture* a1);
};

__unaligned struct Client::Graphics::Physics::BoneSimulator /* Size=0x100 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ unsigned __int32 PhysicsGroup;
    /*       */ byte _gap_0x14[0x4];
    /* 0x018 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x020 */ Common::Math::Vector3 CharacterPosition;
    /* 0x030 */ Common::Math::Vector3 Gravity;
    /* 0x040 */ Common::Math::Vector3 Wind;
    /*       */ byte _gap_0x50[0xB0];
};

__unaligned struct StdVectorClientGraphicsPhysicsBoneSimulatorPtr /* Size=0x18 */
{
    /* 0x00 */ Client::Graphics::Physics::BoneSimulator** First;
    /* 0x08 */ Client::Graphics::Physics::BoneSimulator** Last;
    /* 0x10 */ Client::Graphics::Physics::BoneSimulator** End;
};

__unaligned struct Client::Graphics::Physics::BoneSimulators /* Size=0x78 */
{
    /* 0x00 */ StdVectorClientGraphicsPhysicsBoneSimulatorPtr BoneSimulator_1;
    /* 0x18 */ StdVectorClientGraphicsPhysicsBoneSimulatorPtr BoneSimulator_2;
    /* 0x30 */ StdVectorClientGraphicsPhysicsBoneSimulatorPtr BoneSimulator_3;
    /* 0x48 */ StdVectorClientGraphicsPhysicsBoneSimulatorPtr BoneSimulator_4;
    /* 0x60 */ StdVectorClientGraphicsPhysicsBoneSimulatorPtr BoneSimulator_5;
};

__unaligned struct Client::Graphics::Physics::BonePhysicsModule /* Size=0x1C0 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x8];
    /* 0x010 */ Common::Math::Matrix4x4 SkeletonWorldMatrix;
    /* 0x050 */ Common::Math::Matrix4x4 SkeletonInvWorldMatrix;
    /* 0x090 */ float WindScale;
    /* 0x094 */ float WindVariation;
    /* 0x098 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x0A0 */ Client::Graphics::Physics::BoneSimulators BoneSimulators;
    /*       */ byte _gap_0x118[0xA8];
};

__unaligned struct Client::Graphics::Ray /* Size=0x20 */
{
    /* 0x00 */ Common::Math::Vector3 Origin;
    /* 0x10 */ Common::Math::Vector3 Direction;
};

__unaligned struct Common::Math::Rectangle /* Size=0x10 */
{
    /* 0x00 */ float Left;
    /* 0x04 */ float Top;
    /* 0x08 */ float Right;
    /* 0x0C */ float Bottom;
};

__unaligned struct Client::Graphics::Render::SubView /* Size=0x58 */
{
    /* 0x00 */ void* Vtbl;
    /* 0x08 */ unsigned __int32 Flags;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ Common::Math::Rectangle ViewportRegion;
    /* 0x20 */ void* Camera;
    /* 0x28 */ Client::Graphics::Kernel::Texture* RenderTarget_1;
    /* 0x30 */ Client::Graphics::Kernel::Texture* RenderTarget_2;
    /* 0x38 */ Client::Graphics::Kernel::Texture* RenderTarget_3;
    /* 0x40 */ Client::Graphics::Kernel::Texture* RenderTarget_4;
    /* 0x48 */ unsigned __int32 RenderTargetUsedCount;
    /*      */ byte _gap_0x4C[0x4];
    /* 0x50 */ Client::Graphics::Kernel::Texture* DepthStencil;
};

__unaligned struct Client::Graphics::Render::View /* Size=0x5A0 */
{
    /* 0x000 */ void* Vtbl;
    /* 0x008 */ unsigned __int32 Flags;
    /*       */ byte _gap_0xC[0x4];
    /* 0x010 */ Common::Math::Rectangle CanvasRegion;
    /* 0x020 */ Client::Graphics::Render::SubView SubViewArray[0x10];
};

__unaligned struct Client::Graphics::Render::Manager /* Size=0x2D750 */
{
    /* 0x00000 */ void* Vtbl;
    /* 0x00008 */ Client::Graphics::Render::View ViewArray[0x20];
    /*         */ byte _gap_0xB408[0x22348];
};

__unaligned struct Client::Graphics::Render::Material /* Size=0x40 */
{
    /* 0x00 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x10 */ Client::System::Resource::Handle::MaterialResourceHandle* MaterialResourceHandle;
    /* 0x18 */ unsigned __int32 ShaderFlags;
    /*      */ byte _gap_0x1C[0x4];
    /* 0x20 */ unsigned __int32* ShaderKeyValues;
    /* 0x28 */ Client::Graphics::Kernel::ConstantBuffer* MaterialParameterCBuffer;
    /* 0x30 */ Client::Graphics::Render::Material::TextureEntry* Textures;
    /* 0x38 */ unsigned __int16 TextureCount;
    /*      */ byte _gap_0x3A[0x2];
    /*      */ byte _gap_0x3C[0x4];
};

__unaligned struct Client::Graphics::Render::Material::TextureEntry /* Size=0x18 */
{
    /* 0x00 */ unsigned __int32 Id;
    /*      */ byte _gap_0x4[0x4];
    /* 0x08 */ Client::System::Resource::Handle::TextureResourceHandle* Texture;
    /* 0x10 */ unsigned __int32 SamplerFlags;
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::Graphics::Render::Model /* Size=0xF0 */
{
    /* 0x00 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /*      */ byte _gap_0x10[0x8];
    /* 0x18 */ Client::Graphics::Render::Model* Previous;
    /* 0x20 */ Client::Graphics::Render::Model* Next;
    /*      */ byte _gap_0x28[0x8];
    /* 0x30 */ Client::System::Resource::Handle::ModelResourceHandle* ModelResourceHandle;
    /*      */ byte _gap_0x38[0x8];
    /* 0x40 */ Client::Graphics::Render::Skeleton* Skeleton;
    /*      */ byte _gap_0x48[0x10];
    /* 0x58 */ void** BoneList;
    /* 0x60 */ __int32 BoneCount;
    /*      */ byte _gap_0x64[0x4];
    /*      */ byte _gap_0x68[0x30];
    /* 0x98 */ Client::Graphics::Render::Material** Materials;
    /* 0xA0 */ __int32 MaterialCount;
    /*      */ byte _gap_0xA4[0x4];
    /*      */ byte _gap_0xA8[0x40];
    /* 0xE8 */ unsigned __int32 SlotIndex;
    /*      */ byte _gap_0xEC[0x4];
};

__unaligned struct Client::Graphics::Render::OffscreenRenderingManager /* Size=0x190 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ void* JobSystem_vtbl;
    /*       */ byte _gap_0x10[0xB8];
    /* 0x0C8 */ void* Camera_1;
    /* 0x0D0 */ void* Camera_2;
    /* 0x0D8 */ void* Camera_3;
    /* 0x0E0 */ void* Camera_4;
    /*       */ byte _gap_0xE8[0xA8];
};

__unaligned struct FFXIVClientStructs::Havok::hkaSampleBlendJob /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /* 0x10 */ float* ReferenceFloats;
    /*     */ byte _gap_0x18[0x8];
    /* 0x20 */ __int16* ParentIndices;
    /*     */ byte _gap_0x28[0x10];
    /* 0x38 */ float* FloatsOut;
    /* 0x40 */ __int16 NumBones;
    /* 0x42 */ __int16 NumSkeletonBones;
    /* 0x44 */ __int32 NumFloats;
    /* 0x48 */ __int32 ChunkBufferSize;
    /* 0x4C */ float ReferencePoseWeightThreshold;
    /* 0x50 */ unsigned __int16 NumAnimationsAllocated;
    /* 0x52 */ unsigned __int16 NumAnims;
    /* 0x54 */ byte ConvertToModel;
    /* 0x55 */ byte SampleOnly;
    /* 0x56 */ byte UseSlerpForQuantized;
};

__unaligned struct Client::Graphics::Render::PartialSkeleton /* Size=0x1C0 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8[0x18];
    /* 0x020 */ FFXIVClientStructs::Havok::hkaSampleBlendJob Jobs[0x2];
    /*       */ byte _gap_0x20[0x100];
    /* 0x120 */ __int16 ConnectedParentBoneIndex;
    /* 0x122 */ __int16 ConnectedBoneIndex;
    /*       */ byte _gap_0x124[0x4];
    /*       */ byte _gap_0x128[0x8];
    /* 0x130 */ unsigned __int64 HavokAnimatedSkeleton[0x2];
    /* 0x140 */ unsigned __int64 HavokPoses[0x4];
    /* 0x160 */ Client::Graphics::Render::Skeleton* Skeleton;
    /*       */ byte _gap_0x168[0x18];
    /* 0x180 */ void* SkeletonParameterResourceHandle;
    /* 0x188 */ Client::System::Resource::Handle::SkeletonResourceHandle* SkeletonResourceHandle;
    /*       */ byte _gap_0x190[0x30];
};

__unaligned struct Client::Graphics::Render::RenderTargetManager /* Size=0x4A0 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ Client::Graphics::Kernel::Notifier Notifier;
    /* 0x020 */ Client::Graphics::Kernel::Texture* RenderTargetArray[0x41];
    /*       */ byte _gap_0x228[0x20];
    /* 0x248 */ unsigned __int32 Resolution_Width;
    /* 0x24C */ unsigned __int32 Resolution_Height;
    /* 0x250 */ unsigned __int32 ShadowMap_Width;
    /* 0x254 */ unsigned __int32 ShadowMap_Height;
    /* 0x258 */ unsigned __int32 NearShadowMap_Width;
    /* 0x25C */ unsigned __int32 NearShadowMap_Height;
    /* 0x260 */ unsigned __int32 FarShadowMap_Width;
    /* 0x264 */ unsigned __int32 FarShadowMap_Height;
    /* 0x268 */ bool UnkBool_1;
    /*       */ byte _gap_0x269;
    /*       */ byte _gap_0x26A[0x2];
    /*       */ byte _gap_0x26C[0x4];
    /* 0x270 */ Client::Graphics::Kernel::Texture* RenderTargetArray2[0x31];
    /*       */ byte _gap_0x3F8[0xA8];
};

__unaligned struct Client::Graphics::Transform /* Size=0x30 */
{
    /* 0x00 */ Common::Math::Vector3 Position;
    /* 0x10 */ Common::Math::Quaternion Rotation;
    /* 0x20 */ Common::Math::Vector3 Scale;
};

__unaligned struct Client::Graphics::Render::Skeleton /* Size=0x100 */
{
    /* 0x000 */ Client::Graphics::ReferencedClassBase ReferencedClassBase;
    /* 0x010 */ Client::Graphics::Render::Skeleton* LinkedListPrevious;
    /* 0x018 */ Client::Graphics::Render::Skeleton* LinkedListNext;
    /* 0x020 */ Client::Graphics::Transform Transform;
    /* 0x050 */ unsigned __int16 PartialSkeletonCount;
    /*       */ byte _gap_0x52[0x2];
    /*       */ byte _gap_0x54[0x4];
    /* 0x058 */ Client::System::Resource::Handle::SkeletonResourceHandle** SkeletonResourceHandles;
    /* 0x060 */ Client::Graphics::Animation::AnimationResourceHandle** AnimationResourceHandles;
    /* 0x068 */ Client::Graphics::Render::PartialSkeleton* PartialSkeletons;
    /*       */ byte _gap_0x70[0x48];
    /* 0x0B8 */ Client::Graphics::Scene::CharacterBase* Owner;
    /*       */ byte _gap_0xC0[0x40];
};

__unaligned struct Client::Graphics::Scene::CameraManager /* Size=0x120 */
{
    /*       */ byte _gap_0x0[0x50];
    /* 0x050 */ __int32 CameraIndex;
    /*       */ byte _gap_0x54[0x4];
    /* 0x058 */ Client::Graphics::Scene::Camera* CameraArray[0xE];
    /*       */ byte _gap_0xC8[0x58];
};

__unaligned struct Client::Graphics::Scene::CharacterBase /* Size=0x8F0 */
{
    union {
    /* 0x000 */ Client::Graphics::Scene::DrawObject DrawObject;
    /* 0x000 */ Client::Graphics::Scene::CharacterBase::CharacterBaseVTable* VTable;
    } _union_0x0;
    /* 0x090 */ byte UnkFlags_01;
    /* 0x091 */ byte UnkFlags_02;
    /* 0x092 */ byte UnkFlags_03;
    /*       */ byte _gap_0x93;
    /*       */ byte _gap_0x94[0x4];
    /* 0x098 */ __int32 SlotCount;
    /*       */ byte _gap_0x9C[0x4];
    /* 0x0A0 */ Client::Graphics::Render::Skeleton* Skeleton;
    /* 0x0A8 */ Client::Graphics::Render::Model** Models;
    /*       */ byte _gap_0xB0[0x98];
    /* 0x148 */ void* PostBoneDeformer;
    /* 0x150 */ Client::Graphics::Physics::BonePhysicsModule* BonePhysicsModule;
    /*       */ byte _gap_0x158[0xC8];
    /*       */ byte _gap_0x220[0x4];
    /* 0x224 */ float VfxScale;
    /*       */ byte _gap_0x228[0x18];
    /* 0x240 */ Client::Graphics::Kernel::ConstantBuffer* CharacterDataCBuffer;
    /*       */ byte _gap_0x248[0x10];
    /* 0x258 */ Client::Graphics::Kernel::Texture** ColorTableTextures;
    /* 0x260 */ Common::Math::Vector3 Tint;
    /*       */ byte _gap_0x270[0x40];
    /* 0x2B0 */ float WeatherWetness;
    /* 0x2B4 */ float SwimmingWetness;
    /* 0x2B8 */ float WetnessDepth;
    /* 0x2BC */ float ForcedWetness;
    /*       */ byte _gap_0x2C0[0x8];
    /* 0x2C8 */ unsigned __int32 HasModelInSlotLoaded;
    /* 0x2CC */ unsigned __int32 HasModelFilesInSlotLoaded;
    /* 0x2D0 */ void* TempData;
    /* 0x2D8 */ void* TempSlotData;
    /*       */ byte _gap_0x2E0[0x8];
    /* 0x2E8 */ Client::Graphics::Render::Material** Materials;
    /* 0x2F0 */ void* EID;
    /* 0x2F8 */ void** IMCArray;
    /*       */ byte _gap_0x300[0x5E8];
    /* 0x8E8 */ byte AnimationVariant;
    /*       */ byte _gap_0x8E9;
    /*       */ byte _gap_0x8EA[0x2];
    /*       */ byte _gap_0x8EC[0x4];
};

__unaligned struct Client::Graphics::Scene::CharacterBase::CharacterBaseVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /*     */ __int64 _vf38;
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /*     */ __int64 _vf47;
    /*     */ __int64 _vf48;
    /*     */ __int64 _vf49;
    /* 0x190 */ Client::Graphics::Scene::CharacterBase::ModelType (__fastcall *GetModelType)(Client::Graphics::Scene::CharacterBase* a1);
    /*     */ __int64 _vf51;
    /*     */ __int64 _vf52;
    /*     */ __int64 _vf53;
    /*     */ __int64 _vf54;
    /*     */ __int64 _vf55;
    /*     */ __int64 _vf56;
    /*     */ __int64 _vf57;
    /*     */ __int64 _vf58;
    /*     */ __int64 _vf59;
    /*     */ __int64 _vf60;
    /*     */ __int64 _vf61;
    /*     */ __int64 _vf62;
    /*     */ __int64 _vf63;
    /*     */ __int64 _vf64;
    /*     */ __int64 _vf65;
    /*     */ __int64 _vf66;
    /* 0x218 */ unsigned __int64 (__fastcall *FlagSlotForUpdate)(Client::Graphics::Scene::CharacterBase* a1, unsigned __int32 a2, Client::Game::Character::EquipmentModelId* a3);
    /*     */ __int64 _vf68;
    /*     */ __int64 _vf69;
    /*     */ __int64 _vf70;
    /* 0x238 */ byte* (__fastcall *ResolveRootPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3);
    /* 0x240 */ byte* (__fastcall *ResolveSklbPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x248 */ byte* (__fastcall *ResolveMdlPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x250 */ byte* (__fastcall *ResolveSkpPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x258 */ byte* (__fastcall *ResolvePhybPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x260 */ byte* (__fastcall *ResolvePapPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4, byte* a5);
    /* 0x268 */ byte* (__fastcall *ResolveTmbPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, byte* a4);
    /*     */ __int64 _vf78;
    /* 0x278 */ byte* (__fastcall *ResolveMaterialPapPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4, unsigned __int32 a5);
    /*     */ __int64 _vf80;
    /* 0x288 */ byte* (__fastcall *ResolveImcPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x290 */ byte* (__fastcall *ResolveMtrlPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4, byte* a5);
    /* 0x298 */ byte* (__fastcall *ResolveDecalPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4);
    /* 0x2A0 */ byte* (__fastcall *ResolveVfxPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3, unsigned __int32 a4, unsigned __int32* a5);
    /* 0x2A8 */ byte* (__fastcall *ResolveEidPath)(Client::Graphics::Scene::CharacterBase* a1, byte* a2, unsigned __int64 a3);
    /*     */ __int64 _vf86;
    /*     */ __int64 _vf87;
    /*     */ __int64 _vf88;
    /*     */ __int64 _vf89;
    /*     */ __int64 _vf90;
    /*     */ __int64 _vf91;
    /*     */ __int64 _vf92;
    /*     */ __int64 _vf93;
    /*     */ __int64 _vf94;
    /* 0x2F8 */ byte (__fastcall *IsFreeCompanyCrestVisibleOnSlot)(Client::Graphics::Scene::CharacterBase* a1, byte a2);
    /* 0x300 */ void (__fastcall *SetFreeCompanyCrestVisibleOnSlot)(Client::Graphics::Scene::CharacterBase* a1, byte a2, byte a3);
    /* 0x308 */ void (__fastcall *SetFreeCompanyCrest)(Client::Graphics::Scene::CharacterBase* a1, Client::Graphics::Kernel::Texture* a2);
};

__unaligned struct Client::System::Resource::Handle::ResourceHandleType /* Size=0x4 */
{
    union {
    /* 0x0 */ unsigned __int32 Value;
    struct {
    /* 0x0 */ Client::System::Resource::Handle::ResourceHandleType::HandleCategory Category;
    /* 0x2 */ byte Unknown0A;
    /* 0x3 */ byte Expansion;
    } _union_struct_0x0;
    } _union_0x0;
};

__unaligned struct StdString /* Size=0x20 */
{
    union {
    /* 0x00 */ byte* BufferPtr;
    /* 0x00 */ byte Buffer[0x10];
    } _union_0x0;
    /* 0x10 */ unsigned __int64 Length;
    /* 0x18 */ unsigned __int64 Capacity;
};

__unaligned struct Client::System::Resource::Handle::ResourceHandle /* Size=0xB0 */
{
    /* 0x00 */ Client::System::Resource::Handle::ResourceHandle::ResourceHandleVTable* VTable;
    /* 0x08 */ Client::System::Resource::Handle::ResourceHandleType Type;
    /* 0x0C */ unsigned __int32 FileType;
    /* 0x10 */ unsigned __int32 Id;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x10];
    /* 0x28 */ unsigned __int32 FileSize;
    /* 0x2C */ unsigned __int32 FileSize2;
    /*      */ byte _gap_0x30[0x4];
    /* 0x34 */ unsigned __int32 FileSize3;
    /*      */ byte _gap_0x38[0x10];
    /* 0x48 */ StdString FileName;
    /*      */ byte _gap_0x68[0x4];
    /* 0x6C */ byte UserData;
    /*      */ byte _gap_0x6D;
    /*      */ byte _gap_0x6E[0x2];
    /*      */ byte _gap_0x70[0x38];
    /*      */ byte _gap_0xA8;
    /* 0xA9 */ byte LoadState;
    /*      */ byte _gap_0xAA[0x2];
    /* 0xAC */ unsigned __int32 RefCount;
};

__unaligned struct Client::Graphics::Scene::CharacterUtility /* Size=0x410 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ Client::System::Resource::Handle::ResourceHandle* ResourceHandles[0x57];
    /*       */ byte _gap_0x2C0[0x38];
    /* 0x2F8 */ Client::Graphics::Kernel::ConstantBuffer* LegacyBodyDecalColorCBuffer;
    /* 0x300 */ Client::Graphics::Kernel::ConstantBuffer* FreeCompanyCrestColorCBuffer;
    /*       */ byte _gap_0x308[0x108];
};

__unaligned struct Client::Graphics::Scene::Demihuman /* Size=0x978 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /*       */ byte _gap_0x8F0[0x38];
    union {
    /* 0x928 */ __int64 _slotDecalBase;
    /* 0x928 */ Client::System::Resource::Handle::TextureResourceHandle* HeadDecal;
    } _union_0x928;
    /* 0x930 */ Client::System::Resource::Handle::TextureResourceHandle* TopDecal;
    /* 0x938 */ Client::System::Resource::Handle::TextureResourceHandle* ArmsDecal;
    /* 0x940 */ Client::System::Resource::Handle::TextureResourceHandle* LegsDecal;
    /* 0x948 */ Client::System::Resource::Handle::TextureResourceHandle* FeetDecal;
    /*       */ byte _gap_0x950[0x8];
    /* 0x958 */ Client::Graphics::Kernel::Texture* FreeCompanyCrest;
    /* 0x960 */ unsigned __int32 SlotFreeCompanyCrestBitfield;
    /*       */ byte _gap_0x964[0x4];
    /*       */ byte _gap_0x968[0x10];
};

__unaligned struct Client::Graphics::Scene::EnvLocation /* Size=0xC0 */
{
    /* 0x00 */ Client::Graphics::Scene::DrawObject DrawObject;
    /*      */ byte _gap_0x90[0x30];
};

__unaligned struct Client::Graphics::Scene::EnvSpace /* Size=0xD0 */
{
    /* 0x00 */ Client::Graphics::Scene::DrawObject DrawObject;
    /*      */ byte _gap_0x90[0x20];
    /* 0xB0 */ Client::Graphics::Scene::EnvLocation* EnvLocation;
    /*      */ byte _gap_0xB8[0x18];
};

__unaligned struct Client::Graphics::Scene::EnvScene /* Size=0x790 */
{
    /*       */ byte _gap_0x0[0x28];
    /*       */ byte _gap_0x28[0x4];
    /* 0x02C */ byte WeatherIds[0x20];
    /*       */ byte _gap_0x4C[0x4];
    /*       */ byte _gap_0x50[0x60];
    /* 0x0B0 */ Client::Graphics::Scene::EnvSpace EnvSpaces[0x8];
    /*       */ byte _gap_0x730[0x60];
};

__unaligned struct Client::Graphics::Scene::Human /* Size=0xA80 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /* 0x8F0 */ Client::Game::Character::CustomizeData Customize;
    /*       */ byte _gap_0x90A[0x2];
    /* 0x90C */ unsigned __int32 SlotNeedsUpdateBitfield;
    /* 0x910 */ Client::Game::Character::EquipmentModelId Head;
    /* 0x914 */ Client::Game::Character::EquipmentModelId Top;
    /* 0x918 */ Client::Game::Character::EquipmentModelId Arms;
    /* 0x91C */ Client::Game::Character::EquipmentModelId Legs;
    /* 0x920 */ Client::Game::Character::EquipmentModelId Feet;
    /* 0x924 */ Client::Game::Character::EquipmentModelId Ear;
    /* 0x928 */ Client::Game::Character::EquipmentModelId Neck;
    /* 0x92C */ Client::Game::Character::EquipmentModelId Wrist;
    /* 0x930 */ Client::Game::Character::EquipmentModelId RFinger;
    /* 0x934 */ Client::Game::Character::EquipmentModelId LFinger;
    /* 0x938 */ unsigned __int16 RaceSexId;
    /* 0x93A */ unsigned __int16 HairId;
    /* 0x93C */ unsigned __int16 FaceId;
    /* 0x93E */ unsigned __int16 TailEarId;
    /* 0x940 */ unsigned __int16 FurId;
    /*       */ byte _gap_0x942[0x2];
    /*       */ byte _gap_0x944[0x4];
    /*       */ byte _gap_0x948[0x38];
    union {
    /* 0x980 */ __int64 _slotDecalBase;
    /* 0x980 */ Client::System::Resource::Handle::TextureResourceHandle* HeadDecal;
    } _union_0x980;
    /* 0x988 */ Client::System::Resource::Handle::TextureResourceHandle* TopDecal;
    /* 0x990 */ Client::System::Resource::Handle::TextureResourceHandle* ArmsDecal;
    /* 0x998 */ Client::System::Resource::Handle::TextureResourceHandle* LegsDecal;
    /* 0x9A0 */ Client::System::Resource::Handle::TextureResourceHandle* FeetDecal;
    /* 0x9A8 */ Client::System::Resource::Handle::TextureResourceHandle* EarDecal;
    /* 0x9B0 */ Client::System::Resource::Handle::TextureResourceHandle* NeckDecal;
    /* 0x9B8 */ Client::System::Resource::Handle::TextureResourceHandle* WristDecal;
    /* 0x9C0 */ Client::System::Resource::Handle::TextureResourceHandle* RFingerDecal;
    /* 0x9C8 */ Client::System::Resource::Handle::TextureResourceHandle* LFingerDecal;
    /*       */ byte _gap_0x9D0[0x8];
    /* 0x9D8 */ Client::Graphics::Kernel::ConstantBuffer* CustomizeParameterCBuffer;
    /* 0x9E0 */ Client::Graphics::Kernel::ConstantBuffer* DecalColorCBuffer;
    /* 0x9E8 */ Client::System::Resource::Handle::TextureResourceHandle* Decal;
    /* 0x9F0 */ Client::System::Resource::Handle::TextureResourceHandle* LegacyBodyDecal;
    /* 0x9F8 */ Client::Graphics::Kernel::Texture* FreeCompanyCrest;
    /* 0xA00 */ unsigned __int32 SlotFreeCompanyCrestBitfield;
    /*       */ byte _gap_0xA04[0x4];
    /*       */ byte _gap_0xA08[0x30];
    /* 0xA38 */ byte* ChangedEquipData;
    /*       */ byte _gap_0xA40[0x40];
};

__unaligned struct Client::Graphics::Scene::Monster /* Size=0x920 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /* 0x8F0 */ unsigned __int16 ModelSetId;
    /* 0x8F2 */ unsigned __int16 SecondaryId;
    /* 0x8F4 */ unsigned __int16 Variant;
    /*       */ byte _gap_0x8F6[0x2];
    /*       */ byte _gap_0x8F8[0x8];
    /* 0x900 */ Client::System::Resource::Handle::TextureResourceHandle* Decal;
    /*       */ byte _gap_0x908[0x18];
};

__unaligned struct Client::Graphics::Scene::Object::ObjectVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /* 0x10 */ Client::Graphics::Scene::ObjectType (__fastcall *GetObjectType)(Client::Graphics::Scene::Object* a1);
};

__unaligned struct Client::Graphics::Scene::Object::SiblingEnumerator /* Size=0x0 */
{
    /* 0x0 */ Client::Graphics::Scene::Object* _first;
    /* 0x8 */ Client::Graphics::Scene::Object* _current;
};

__unaligned struct Client::Graphics::Scene::ResidentResourceManager /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x10];
    /*     */ byte _gap_0x10[0x4];
    /* 0x14 */ unsigned __int32 ResourceCount;
    /* 0x18 */ Client::System::Resource::Handle::ResourceHandle** ResourceList;
};

__unaligned struct Client::Graphics::Scene::Weapon /* Size=0x920 */
{
    /* 0x000 */ Client::Graphics::Scene::CharacterBase CharacterBase;
    /* 0x8F0 */ unsigned __int16 ModelSetId;
    /* 0x8F2 */ unsigned __int16 SecondaryId;
    /* 0x8F4 */ unsigned __int16 Variant;
    /* 0x8F6 */ unsigned __int16 ModelUnknown;
    /*       */ byte _gap_0x8F8[0x2];
    /* 0x8FA */ byte MaterialId;
    /* 0x8FB */ byte DecalId;
    /*       */ byte _gap_0x8FC[0x2];
    /* 0x8FE */ byte VfxId;
    /*       */ byte _gap_0x8FF;
    /* 0x900 */ Client::System::Resource::Handle::TextureResourceHandle* Decal;
    /* 0x908 */ Client::Graphics::Kernel::Texture* FreeCompanyCrest;
    /* 0x910 */ unsigned __int32 SlotFreeCompanyCrestBitfield;
    /*       */ byte _gap_0x914[0x4];
    /*       */ byte _gap_0x918[0x8];
};

__unaligned struct Client::Graphics::Scene::World /* Size=0x160 */
{
    /* 0x000 */ Client::Graphics::Scene::Object Object;
    /*       */ byte _gap_0x80[0xE0];
};

__unaligned struct Client::Graphics::Vfx::VfxData /* Size=0x1D0 */
{
    /*       */ byte _gap_0x0[0x1D0];
};

__unaligned struct Client::LayoutEngine::IndoorFloorLayoutData /* Size=0x0 */
{
    /* 0x0 */ __int32 Part0;
    /* 0x4 */ __int32 Part1;
    /* 0x8 */ __int32 Part2;
    /* 0xC */ __int32 Part3;
    /* 0x10 */ __int32 Part4;
};

__unaligned struct Client::LayoutEngine::IndoorAreaLayoutData /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x28];
    /* 0x28 */ Client::LayoutEngine::IndoorFloorLayoutData Floor0;
    /*     */ byte _gap_0x28[0x10];
    /*     */ byte _gap_0x38[0x4];
    /* 0x3C */ Client::LayoutEngine::IndoorFloorLayoutData Floor1;
    /*     */ byte _gap_0x3C[0x4];
    /*     */ byte _gap_0x40[0x10];
    /* 0x50 */ Client::LayoutEngine::IndoorFloorLayoutData Floor2;
    /*     */ byte _gap_0x50[0x30];
    /* 0x80 */ float LightLevel;
};

__unaligned struct Client::LayoutEngine::LayoutManager /* Size=0x98 */
{
    /*      */ byte _gap_0x0[0x20];
    /* 0x20 */ unsigned __int32 TerritoryTypeId;
    /*      */ byte _gap_0x24[0x4];
    /*      */ byte _gap_0x28[0x10];
    /* 0x38 */ unsigned __int32 FestivalStatus;
    /*      */ byte _gap_0x3C[0x4];
    /* 0x40 */ unsigned __int32 ActiveFestivals[0x4];
    /*      */ byte _gap_0x50[0x30];
    union {
    /* 0x80 */ void* HousingController;
    /* 0x80 */ Client::LayoutEngine::OutdoorAreaLayoutData* OutdoorAreaData;
    } _union_0x80;
    /*      */ byte _gap_0x88[0x8];
    /* 0x90 */ Client::LayoutEngine::IndoorAreaLayoutData* IndoorAreaData;
};

__unaligned struct StdPairClientSystemStringUtf8StringBytePtr /* Size=0x70 */
{
    /* 0x00 */ Client::System::String::Utf8String Item1;
    /* 0x68 */ byte* Item2;
};

__unaligned struct StdMap::NodeClientSystemStringUtf8StringBytePtr /* Size=0x98 */
{
    /* 0x00 */ StdMap::NodeClientSystemStringUtf8StringBytePtr* Left;
    /* 0x08 */ StdMap::NodeClientSystemStringUtf8StringBytePtr* Parent;
    /* 0x10 */ StdMap::NodeClientSystemStringUtf8StringBytePtr* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairClientSystemStringUtf8StringBytePtr KeyValuePair;
    /*      */ byte _gap_0x8C[0x4];
    /*      */ byte _gap_0x90[0x8];
};

__unaligned struct StdMapClientSystemStringUtf8StringBytePtr /* Size=0x10 */
{
    /* 0x00 */ StdMap::NodeClientSystemStringUtf8StringBytePtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::LayoutEngine::LayoutWorld /* Size=0x228 */
{
    /*       */ byte _gap_0x0[0x20];
    /* 0x020 */ Client::LayoutEngine::LayoutManager* ActiveLayout;
    /*       */ byte _gap_0x28[0x1F0];
    /* 0x218 */ StdMapClientSystemStringUtf8StringBytePtr* RsvMap;
    /*       */ byte _gap_0x220[0x8];
};

__unaligned struct Client::LayoutEngine::OutdoorPlotFixtureData /* Size=0x28 */
{
    /* 0x00 */ unsigned __int16 FixtureId;
    /* 0x02 */ byte StainId;
    /*      */ byte _gap_0x3;
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x20];
};

__unaligned struct Client::LayoutEngine::OutdoorPlotLayoutData /* Size=0x1D0 */
{
    /*       */ byte _gap_0x0[0x28];
    /* 0x028 */ Client::LayoutEngine::OutdoorPlotFixtureData Fixture[0x8];
    /*       */ byte _gap_0x168[0x68];
};

__unaligned struct Client::LayoutEngine::OutdoorAreaLayoutData /* Size=0x0 */
{
    /*     */ byte _gap_0x0[0x1F0];
    /* 0x1F0 */ Client::LayoutEngine::OutdoorPlotLayoutData Plot[0x3C];
};

__unaligned struct Client::Network::NetworkModule /* Size=0xB60 */
{
    /*       */ byte _gap_0x0[0x28];
    /* 0x028 */ byte LobbyCount;
    /*       */ byte _gap_0x29;
    /*       */ byte _gap_0x2A[0x2];
    /* 0x02C */ unsigned __int32 LobbyPorts[0xC];
    /*       */ byte _gap_0x5C[0x4];
    /* 0x060 */ Client::System::String::Utf8String LobbyHosts[0xC];
    /*       */ byte _gap_0x540[0x68];
    /*       */ byte _gap_0x5A8[0x4];
    /* 0x5AC */ __int32 OperatingSystemTypeAndVersion;
    /* 0x5B0 */ unsigned __int32 SaveDataBankPort;
    /*       */ byte _gap_0x5B4[0x4];
    /* 0x5B8 */ Client::System::String::Utf8String SaveDataBankHost;
    /* 0x620 */ unsigned __int32 SaveDataBankMode;
    /* 0x624 */ unsigned __int32 DktWebPort;
    /* 0x628 */ Client::System::String::Utf8String DktWebHost;
    /* 0x690 */ unsigned __int32 ActiveLobbyPort;
    /*       */ byte _gap_0x694[0x4];
    /* 0x698 */ Client::System::String::Utf8String ActiveLobbyHost;
    /* 0x700 */ unsigned __int32 AlternateLobbyPort;
    /*       */ byte _gap_0x704[0x4];
    /* 0x708 */ Client::System::String::Utf8String AlternateLobbyHost;
    /* 0x770 */ unsigned __int32 LobbyRetryCount;
    /* 0x774 */ unsigned __int32 LobbyRetryInterval;
    /* 0x778 */ unsigned __int32 LobbyPing;
    /* 0x77C */ unsigned __int32 FrontPort;
    /* 0x780 */ Client::System::String::Utf8String FrontHost;
    /* 0x7E8 */ Client::System::String::Utf8String FrontProtocol;
    /* 0x850 */ bool UseCfgFrontend;
    /*       */ byte _gap_0x851;
    /*       */ byte _gap_0x852[0x2];
    /*       */ byte _gap_0x854[0x4];
    /* 0x858 */ Client::System::String::Utf8String Ticket;
    /* 0x8C0 */ Client::System::String::Utf8String World;
    /* 0x928 */ Client::System::String::Utf8String ZoneName;
    /*       */ byte _gap_0x990[0x38];
    /*       */ byte _gap_0x9C8;
    /* 0x9C9 */ bool WinSockInitialized;
    /*       */ byte _gap_0x9CA[0x2];
    /*       */ byte _gap_0x9CC[0x4];
    /* 0x9D0 */ Client::Network::NetworkModulePacketReceiverCallback* PacketReceiverCallback;
    /*       */ byte _gap_0x9D8[0x98];
    /*       */ byte _gap_0xA70[0x4];
    /* 0xA74 */ __int32 CurrentDeviceTime;
    /* 0xA78 */ __int32 CurrentDeviceTimeMillis;
    /*       */ byte _gap_0xA7C[0x4];
    /*       */ byte _gap_0xA80[0xA0];
    /*       */ byte _gap_0xB20[0x4];
    /*       */ byte _gap_0xB24[0x2];
    /* 0xB26 */ __int16 CurrentInstance;
    /*       */ byte _gap_0xB28[0x8];
    /* 0xB30 */ __int32 KeepAliveZone;
    /* 0xB34 */ __int32 KeepAliveIntervalZone;
    /* 0xB38 */ __int32 KeepAliveChat;
    /* 0xB3C */ __int32 KeepAliveIntervalChat;
    /*       */ byte _gap_0xB40[0x18];
    /* 0xB58 */ bool IsInCrossWorldDuty;
    /*       */ byte _gap_0xB59;
    /*       */ byte _gap_0xB5A[0x2];
    /*       */ byte _gap_0xB5C[0x4];
};

__unaligned struct Client::Network::PacketDispatcher /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::Network::NetworkModulePacketReceiverCallback /* Size=0x20 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::Network::PacketDispatcher PacketDispatcher;
    /*      */ byte _gap_0x9;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
    /*      */ byte _gap_0x10[0x8];
    /* 0x18 */ Client::Network::NetworkModuleProxy* NetworkModuleProxy;
};

__unaligned struct Client::Network::NetworkModuleProxy /* Size=0x20 */
{
    /* 0x00 */ void* Vtbl;
    /* 0x08 */ Client::Network::NetworkModule* NetworkModule;
    /* 0x10 */ Client::Network::NetworkModulePacketReceiverCallback PacketReceiverCallback;
};

__unaligned struct Client::System::Threading::Thread /* Size=0x28 */
{
    /* 0x00 */ byte** args;
    /* 0x08 */ __int64 EventHandle;
    /* 0x10 */ __int64 ThreadHandle;
    /* 0x18 */ __int32 ThreadId;
    /* 0x1C */ __int32 AffinityMask;
    /*      */ byte _gap_0x20[0x8];
};

__unaligned struct Client::Sound::SoundManager /* Size=0x1C88 */
{
    /* 0x0000 */ __int64 ResourceEventListener;
    /* 0x0008 */ Client::System::Threading::Thread Thread;
    /*        */ byte _gap_0x30;
    /* 0x0031 */ bool Disabled;
    /*        */ byte _gap_0x32[0x2];
    /* 0x0034 */ float MasterVolume;
    /* 0x0038 */ float ActiveVolume;
    /* 0x003C */ float Volume[0x13];
    /* 0x0088 */ float UnkVolume2[0x13];
    /* 0x00D4 */ float UnkVolume3[0x13];
    /* 0x0120 */ float UnkVolume4[0x13];
    /* 0x016C */ bool ChannelMutedArray[0x13];
    /* 0x017F */ bool ChannelAlwayOn[0x13];
    /*        */ byte _gap_0x192[0x2];
    /*        */ byte _gap_0x194[0x4];
    /*        */ byte _gap_0x198[0x30];
    /*        */ byte _gap_0x1C8;
    /* 0x01C9 */ bool MasterEnabled;
    /* 0x01CA */ bool IsSoundAlways;
    /* 0x01CB */ bool SoundEnabled;
    /* 0x01CC */ bool WindowInactive;
    /*        */ byte _gap_0x1CD;
    /*        */ byte _gap_0x1CE[0x2];
    /*        */ byte _gap_0x1D0[0xD0];
    /* 0x02A0 */ __int64 CriticalSection;
    /*        */ byte _gap_0x2A8[0x20];
    /* 0x02C8 */ __int64 EventHandle;
    /*        */ byte _gap_0x2D0[0x19B8];
};

__unaligned struct Common::Configuration::ConfigBase /* Size=0x110 */
{
    /* 0x000 */ void* vtbl;
    /* 0x008 */ Common::Configuration::ChangeEventInterface* Listener;
    /*       */ byte _gap_0x10[0x4];
    /* 0x014 */ unsigned __int32 ConfigCount;
    /* 0x018 */ Common::Configuration::ConfigEntry* ConfigEntry;
    /*       */ byte _gap_0x20[0x30];
    /* 0x050 */ Client::System::String::Utf8String UnkString;
    /*       */ byte _gap_0xB8[0x58];
};

__unaligned struct Common::Configuration::DevConfig /* Size=0x110 */
{
    /* 0x000 */ Common::Configuration::ConfigBase ConfigBase;
};

__unaligned struct Client::System::Configuration::DevConfig /* Size=0x110 */
{
    /* 0x000 */ Common::Configuration::DevConfig CommonDevConfig;
};

__unaligned struct Common::Configuration::SystemConfig /* Size=0x450 */
{
    /* 0x000 */ Common::Configuration::ConfigBase ConfigBase;
    /*       */ byte _gap_0x110[0x8];
    /* 0x118 */ Common::Configuration::ConfigBase UiConfig;
    /* 0x228 */ Common::Configuration::ConfigBase UiControlConfig;
    /* 0x338 */ Common::Configuration::ConfigBase UiControlGamepadConfig;
    /*       */ byte _gap_0x448[0x8];
};

__unaligned struct Client::System::Configuration::SystemConfig /* Size=0x450 */
{
    /* 0x000 */ Common::Configuration::SystemConfig CommonSystemConfig;
};

__unaligned struct Client::System::File::FileAccessPath /* Size=0x210 */
{
    /* 0x000 */ wchar_t Buffer[0x104];
    /* 0x208 */ wchar_t* LongStringPtr;
};

__unaligned struct Client::System::File::FileDescriptor /* Size=0x278 */
{
    /* 0x000 */ Client::System::File::FileMode FileMode;
    /*       */ byte _gap_0x4[0x4];
    /* 0x008 */ byte* FileBuffer;
    /* 0x010 */ unsigned __int64 FileLength;
    /* 0x018 */ unsigned __int64 CurrentFileOffset;
    /*       */ byte _gap_0x20[0x10];
    /* 0x030 */ void* FileInterface;
    /*       */ byte _gap_0x38[0x28];
    /* 0x060 */ Client::System::File::FileDescriptor* Previous;
    /* 0x068 */ Client::System::File::FileDescriptor* Next;
    /* 0x070 */ byte Utf16FilePath[0x208];
};

__unaligned struct Client::System::File::FileManager /* Size=0x141A8 */
{
    /*         */ byte _gap_0x0[0x38];
    /* 0x00038 */ Client::System::File::FileThread* FileThread;
    /*         */ byte _gap_0x40[0x14168];
};

__unaligned struct Client::System::File::FileThread /* Size=0x2518 */
{
    /*        */ byte _gap_0x0[0x8];
    /* 0x0008 */ void* SecurityAttributes;
    /*        */ byte _gap_0x10[0x2508];
};

__unaligned struct Client::System::Framework::Task /* Size=0x38 */
{
    union {
    /* 0x00 */ void* vtbl;
    /* 0x00 */ Client::System::Framework::Task::TaskVTable* VTable;
    } _union_0x0;
    /* 0x08 */ void* Runner;
    /* 0x10 */ Client::System::Framework::Framework* Framework;
    /* 0x18 */ void* Func;
    /*      */ byte _gap_0x20[0x8];
    /* 0x28 */ Client::System::Framework::Task* Previous;
    /* 0x30 */ Client::System::Framework::Task* Next;
};

__unaligned struct Common::Configuration::ChangeEventInterface /* Size=0x18 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Common::Configuration::ChangeEventInterface* Next;
    /* 0x10 */ Common::Configuration::ConfigBase* Owner;
};

__unaligned struct Client::System::Framework::EnvironmentManager /* Size=0x698 */
{
    /* 0x000 */ Client::System::Framework::Task Task;
    /* 0x038 */ Common::Configuration::ChangeEventInterface ChangeEventInterface;
    /*       */ byte _gap_0x50[0x648];
};

__unaligned struct Client::System::Framework::TaskManagerOsData /* Size=0x4C */
{
    /*      */ byte _gap_0x0[0x40];
    /* 0x40 */ __int64 Handle;
    /*      */ byte _gap_0x48[0x4];
};

__unaligned struct Client::System::Framework::TaskManager /* Size=0x70 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::System::Framework::TaskManagerOsData OsData;
    /*      */ byte _gap_0x54[0x4];
    /* 0x58 */ Client::System::Framework::RootTask* TaskList;
    /* 0x60 */ unsigned __int32 TaskCount;
    /*      */ byte _gap_0x64[0x4];
    /* 0x68 */ void* UserData;
};

__unaligned struct Client::System::Timer::ClientTime /* Size=0x40 */
{
    /*      */ byte _gap_0x0[0x8];
    /* 0x08 */ __int64 EorzeaTime;
    /* 0x10 */ float EorzeaTimeMilliseconds;
    /*      */ byte _gap_0x14[0x4];
    /*      */ byte _gap_0x18[0x18];
    /* 0x30 */ __int64 EorzeaTimeOverride;
    /* 0x38 */ bool IsEorzeaTimeOverridden;
    /*      */ byte _gap_0x39;
    /*      */ byte _gap_0x3A[0x2];
    /*      */ byte _gap_0x3C[0x4];
};

__unaligned struct Client::System::Framework::GameVersion /* Size=0x900 */
{
    /* 0x000 */ byte baseVersion[0x20];
    /*       */ byte _gap_0x20[0xC0];
    /* 0x0E0 */ byte expansionVersion[0x140];
    /*       */ byte _gap_0x220[0x6E0];
};

__unaligned struct Client::System::Framework::Framework /* Size=0x35C8 */
{
    /*        */ byte _gap_0x0[0x10];
    /* 0x0010 */ Client::System::Configuration::SystemConfig SystemConfig;
    /* 0x0460 */ Client::System::Configuration::DevConfig DevConfig;
    /* 0x0570 */ Client::Game::SavedAppearanceManager* SavedAppearanceData;
    /*        */ byte _gap_0x578[0x8];
    /* 0x0580 */ byte ClientLanguage;
    /*        */ byte _gap_0x581;
    /*        */ byte _gap_0x582[0x2];
    /*        */ byte _gap_0x584[0x4];
    /* 0x0588 */ Client::System::Input::Cursor* Cursor;
    /*        */ byte _gap_0x590[0x8];
    /* 0x0598 */ Client::System::File::FileAccessPath ConfigPath;
    /* 0x07A8 */ Client::System::Framework::GameWindow* GameWindow;
    /*        */ byte _gap_0x7B0[0x248];
    /* 0x09F8 */ __int32 CursorPosX;
    /* 0x09FC */ __int32 CursorPosY;
    /*        */ byte _gap_0xA00[0x700];
    /*        */ byte _gap_0x1100[0x4];
    /* 0x1104 */ __int32 CursorPosX2;
    /* 0x1108 */ __int32 CursorPosY2;
    /*        */ byte _gap_0x110C[0x4];
    /*        */ byte _gap_0x1110[0x560];
    /* 0x1670 */ Client::Network::NetworkModuleProxy* NetworkModuleProxy;
    /* 0x1678 */ bool IsNetworkModuleInitialized;
    /* 0x1679 */ bool EnableNetworking;
    /*        */ byte _gap_0x167A[0x2];
    /*        */ byte _gap_0x167C[0x4];
    /* 0x1680 */ __int64 ServerTime;
    union {
    /* 0x1688 */ __int64 PerformanceCounterInMilliSeconds;
    /* 0x1688 */ __int64 PerformanceCounterInMicroSeconds;
    } _union_0x1688;
    /*        */ byte _gap_0x1690[0x8];
    /* 0x1698 */ unsigned __int32 TimerResolutionMillis;
    /*        */ byte _gap_0x169C[0x4];
    /* 0x16A0 */ __int64 PerformanceCounterFrequency;
    /* 0x16A8 */ __int64 PerformanceCounterValue;
    /*        */ byte _gap_0x16B0[0x8];
    /* 0x16B8 */ float FrameDeltaTime;
    /*        */ byte _gap_0x16BC[0x4];
    /*        */ byte _gap_0x16C0[0x8];
    /* 0x16C8 */ unsigned __int32 FrameCounter;
    /*        */ byte _gap_0x16CC[0x4];
    /*        */ byte _gap_0x16D0[0x28];
    /* 0x16F8 */ Client::System::Framework::TaskManager TaskManager;
    /* 0x1768 */ Client::System::Timer::ClientTime ClientTime;
    /*        */ byte _gap_0x17A8[0x18];
    /*        */ byte _gap_0x17C0[0x4];
    /* 0x17C4 */ float FrameRate;
    /*        */ byte _gap_0x17C8[0x8];
    /* 0x17D0 */ bool WindowInactive;
    /*        */ byte _gap_0x17D1;
    /*        */ byte _gap_0x17D2[0x2];
    /*        */ byte _gap_0x17D4[0x4];
    /*        */ byte _gap_0x17D8[0x210];
    /*        */ byte _gap_0x19E8[0x4];
    /* 0x19EC */ wchar_t gamePath[0x104];
    /*        */ byte _gap_0x1BF4[0x4];
    /*        */ byte _gap_0x1BF8[0x200];
    /*        */ byte _gap_0x1DF8[0x4];
    /* 0x1DFC */ wchar_t sqPackPath[0x104];
    /*        */ byte _gap_0x2004[0x4];
    /*        */ byte _gap_0x2008[0x200];
    /*        */ byte _gap_0x2208[0x4];
    /* 0x220C */ wchar_t userPath[0x104];
    /*        */ byte _gap_0x2414[0x4];
    /*        */ byte _gap_0x2418[0x718];
    /* 0x2B30 */ Component::Excel::ExcelModuleInterface* ExcelModuleInterface;
    /* 0x2B38 */ Component::Exd::ExdModule* ExdModule;
    /*        */ byte _gap_0x2B40[0x10];
    /* 0x2B50 */ Common::Component::BGCollision::BGCollisionModule* BGCollisionModule;
    /*        */ byte _gap_0x2B58[0x8];
    /* 0x2B60 */ Client::UI::UIModule* UIModule;
    /* 0x2B68 */ Client::UI::UIClipboard* UIClipboard;
    /*        */ byte _gap_0x2B70[0x8];
    /* 0x2B78 */ Client::System::Framework::EnvironmentManager* EnvironmentManager;
    /* 0x2B80 */ Client::Sound::SoundManager* SoundManager;
    /*        */ byte _gap_0x2B88[0x40];
    /* 0x2BC8 */ Common::Lua::LuaState LuaState;
    /* 0x2BF0 */ Client::System::Framework::GameVersion GameVersion;
    /*        */ byte _gap_0x34F0[0xC0];
    /*        */ byte _gap_0x35B0[0x4];
    /* 0x35B4 */ bool IsSteamGame;
    /*        */ byte _gap_0x35B5;
    /*        */ byte _gap_0x35B6[0x2];
    /* 0x35B8 */ Component::SteamApi::SteamApi* SteamApi;
    /* 0x35C0 */ __int64 SteamApiLibraryHandle;
};

__unaligned struct Client::System::Framework::GameWindow /* Size=0x0 */
{
    /* 0x0 */ unsigned __int64 ArgumentCount;
    /* 0x8 */ byte** Arguments;
    /* 0x10 */ float FrameDeltaTime;
    /*     */ byte _gap_0x14[0x4];
    /* 0x18 */ __int64 WindowHandle;
    /* 0x20 */ __int32 WindowWidth;
    /* 0x24 */ __int32 WindowHeight;
    /* 0x28 */ __int32 LastWindowPosX;
    /* 0x2C */ __int32 LastWindowPosY;
    /*     */ byte _gap_0x30[0x28];
    /* 0x58 */ __int32 MinWidth;
    /* 0x5C */ __int32 MinHeight;
    /*     */ byte _gap_0x60[0x20];
    /* 0x80 */ wchar_t Username[0x101];
};

__unaligned struct Client::System::Framework::RootTask /* Size=0x78 */
{
    /* 0x00 */ Client::System::Framework::Task Task;
    /* 0x38 */ Client::System::Framework::Task UnkTask;
    /*      */ byte _gap_0x70[0x8];
};

__unaligned struct Client::System::Framework::Task::TaskVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /* 0x8 */ void (__fastcall *Execute)(Client::System::Framework::Task* a1, void* a2);
};

__unaligned struct Client::System::Input::ClipBoard /* Size=0xD8 */
{
    /* 0x00 */ Client::System::Input::ClipBoard::ClipBoardVTable* VTable;
    /* 0x08 */ Client::System::String::Utf8String SystemClipboardText;
    /* 0x70 */ Client::System::String::Utf8String CopyStagingText;
};

__unaligned struct Client::System::Input::ClipBoard::ClipBoardVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /* 0x8 */ void (__fastcall *WriteToSystemClipboard)(Client::System::Input::ClipBoard* a1, Client::System::String::Utf8String* a2, Client::System::String::Utf8String* a3);
    /* 0x10 */ Client::System::String::Utf8String* (__fastcall *GetSystemClipboardText)(Client::System::Input::ClipBoard* a1);
    /* 0x18 */ void (__fastcall *SetCopyStagingText)(Client::System::Input::ClipBoard* a1, Client::System::String::Utf8String* a2);
    /* 0x20 */ void (__fastcall *ApplyCopyStagingText)(Client::System::Input::ClipBoard* a1);
};

__unaligned struct Client::System::Input::Cursor /* Size=0x378 */
{
    /* 0x000 */ void* vtbl;
    /*       */ byte _gap_0x8;
    /* 0x009 */ bool UseSoftwareCursor;
    /*       */ byte _gap_0xA;
    /* 0x00B */ bool IsCursorVisible;
    /* 0x00C */ bool MouseNotCpatured;
    /* 0x00D */ bool IsCursorOutsideViewPort;
    /*       */ byte _gap_0xE[0x2];
    /* 0x010 */ unsigned __int32 ActiveCursorType;
    /*       */ byte _gap_0x14[0x4];
    /*       */ byte _gap_0x18[0x198];
    /* 0x1B0 */ unsigned __int64 CursorHandles[0x10];
    /*       */ byte _gap_0x230[0x8];
    /* 0x238 */ byte* CursorNames[0x10];
    /*       */ byte _gap_0x2B8[0x10];
    /* 0x2C8 */ Client::System::Resource::Handle::TextureResourceHandle* SoftwareCursorTexture;
    /*       */ byte _gap_0x2D0[0xA8];
};

__unaligned struct Client::System::Memory::IMemorySpace /* Size=0x0 */
{
    /* 0x0 */ Client::System::Memory::IMemorySpace::IMemorySpaceVTable* VTable;
};

__unaligned struct Client::System::Memory::IMemorySpace::IMemorySpaceVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /* 0x18 */ void* (__fastcall *Malloc)(Client::System::Memory::IMemorySpace* a1, unsigned __int64 a2, unsigned __int64 a3);
};

__unaligned struct Client::System::Resource::Handle::MaterialResourceHandle /* Size=0x108 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x8];
    /* 0x0B8 */ unsigned __int64 Length;
    /* 0x0C0 */ Client::Graphics::Render::Material* Material;
    /* 0x0C8 */ Client::System::Resource::Handle::ShaderPackageResourceHandle* ShaderPackageResourceHandle;
    /* 0x0D0 */ Client::System::Resource::Handle::MaterialResourceHandle::TextureEntry* Textures;
    /* 0x0D8 */ Client::System::Resource::Handle::MaterialResourceHandle::AttributeSetEntry* AttributeSets;
    /* 0x0E0 */ byte* Strings;
    /* 0x0E8 */ byte* AdditionalData;
    /* 0x0F0 */ byte* DataSet;
    /* 0x0F8 */ unsigned __int16 ShpkNameOffset;
    /* 0x0FA */ byte TextureCount;
    /* 0x0FB */ byte UvSetCount;
    /* 0x0FC */ byte ColorSetCount;
    /* 0x0FD */ byte AdditionalDataSize;
    /* 0x0FE */ unsigned __int16 DataSetSize;
    /* 0x100 */ unsigned __int16 TotalDataSize;
    /*       */ byte _gap_0x102[0x2];
    /*       */ byte _gap_0x104[0x4];
};

__unaligned struct Client::System::Resource::Handle::MaterialResourceHandle::AttributeSetEntry /* Size=0x4 */
{
    /* 0x0 */ unsigned __int16 NameOffset;
    /* 0x2 */ unsigned __int16 Index;
};

__unaligned struct Client::System::Resource::Handle::MaterialResourceHandle::ColorTableRow /* Size=0x20 */
{
    /* 0x00 */ __int16 DiffuseRed;
    /* 0x02 */ __int16 DiffuseGreen;
    /* 0x04 */ __int16 DiffuseBlue;
    /* 0x06 */ __int16 SpecularStrength;
    /* 0x08 */ __int16 SpecularRed;
    /* 0x0A */ __int16 SpecularGreen;
    /* 0x0C */ __int16 SpecularBlue;
    /* 0x0E */ __int16 GlossStrength;
    /* 0x10 */ __int16 EmissiveRed;
    /* 0x12 */ __int16 EmissiveGreen;
    /* 0x14 */ __int16 EmissiveBlue;
    /* 0x16 */ __int16 TileIndexW;
    /* 0x18 */ __int16 TileScaleUU;
    /* 0x1A */ __int16 TileScaleUV;
    /* 0x1C */ __int16 TileScaleVU;
    /* 0x1E */ __int16 TileScaleVV;
};

__unaligned struct Client::System::Resource::Handle::MaterialResourceHandle::StainTableRow /* Size=0x2 */
{
    /* 0x0 */ unsigned __int16 RawData;
};

__unaligned struct Client::System::Resource::Handle::MaterialResourceHandle::TextureEntry /* Size=0x10 */
{
    /* 0x00 */ Client::System::Resource::Handle::TextureResourceHandle* TextureResourceHandle;
    /* 0x08 */ unsigned __int16 PathOffset;
    /* 0x0A */ unsigned __int16 Flags;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdPairBytePtrint16 /* Size=0x10 */
{
    /* 0x00 */ byte* Item1;
    /* 0x08 */ __int16 Item2;
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdMap::NodeBytePtrint16 /* Size=0x38 */
{
    /* 0x00 */ StdMap::NodeBytePtrint16* Left;
    /* 0x08 */ StdMap::NodeBytePtrint16* Parent;
    /* 0x10 */ StdMap::NodeBytePtrint16* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairBytePtrint16 KeyValuePair;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x8];
};

__unaligned struct StdMapBytePtrint16 /* Size=0x10 */
{
    /* 0x00 */ StdMap::NodeBytePtrint16* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::System::Resource::Handle::ModelResourceHandle /* Size=0x260 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x158];
    /* 0x208 */ StdMapBytePtrint16 Attributes;
    /*       */ byte _gap_0x218[0x10];
    /* 0x228 */ StdMapBytePtrint16 Shapes;
    /*       */ byte _gap_0x238[0x28];
};

__unaligned struct Client::System::Resource::Handle::ResourceHandle::ResourceHandleVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /* 0x30 */ byte (__fastcall *GetUserData)(Client::System::Resource::Handle::ResourceHandle* a1);
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /* 0x88 */ unsigned __int64 (__fastcall *GetLength)(Client::System::Resource::Handle::ResourceHandle* a1);
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /* 0xB8 */ byte* (__fastcall *GetData)(Client::System::Resource::Handle::ResourceHandle* a1);
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /* 0xF8 */ bool (__fastcall *LoadIntoKernel)(Client::System::Resource::Handle::ResourceHandle* a1);
    /*     */ __int64 _vf32;
    /* 0x108 */ bool (__fastcall *Load)(Client::System::Resource::Handle::ResourceHandle* a1, void* a2, bool a3);
};

__unaligned struct Client::System::Resource::Handle::ShaderPackageResourceHandle /* Size=0x0 */
{
    /* 0x0 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /* 0xB0 */ Client::Graphics::Kernel::ShaderPackage* ShaderPackage;
};

__unaligned struct Client::System::Resource::Handle::SkeletonResourceHandle::SkeletonHeader /* Size=0x30 */
{
    /* 0x00 */ unsigned __int32 SklbMagic;
    /* 0x04 */ unsigned __int32 SklbVersion;
    /* 0x08 */ unsigned __int32 LayerOffset;
    /* 0x0C */ unsigned __int32 SklbOffset;
    /* 0x10 */ unsigned __int16 ConnectBoneIndex;
    /* 0x12 */ unsigned __int16 pad;
    /* 0x14 */ unsigned __int32 CharacterId;
    /* 0x18 */ unsigned __int32 SkeletonMappers[0x4];
    /* 0x28 */ unsigned __int16 ConnectBoneIds[0x4];
};

__unaligned struct Client::System::Resource::Handle::SkeletonResourceHandle /* Size=0x0 */
{
    /* 0x0 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*     */ byte _gap_0xB0[0x18];
    /* 0xC8 */ unsigned __int32 BoneCount;
    /*     */ byte _gap_0xCC[0x4];
    /*     */ byte _gap_0xD0[0x28];
    /* 0xF8 */ Common::Math::Matrix4x4* InverseBoneMatrix;
    /*     */ byte _gap_0x100[0x8];
    /* 0x108 */ Client::System::Resource::Handle::SkeletonResourceHandle::SkeletonHeader SkeletonData;
};

__unaligned struct Client::System::Resource::Handle::TextureResourceHandle /* Size=0x140 */
{
    /* 0x000 */ Client::System::Resource::Handle::ResourceHandle ResourceHandle;
    /*       */ byte _gap_0xB0[0x68];
    /* 0x118 */ Client::Graphics::Kernel::Texture* Texture;
    /*       */ byte _gap_0x120[0x20];
};

__unaligned struct StdPairunsignedint32ClientSystemResourceHandleResourceHandlePtr /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ Client::System::Resource::Handle::ResourceHandle* Item2;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdMap::Nodeunsignedint32ClientSystemResourceHandleResourceHandlePtr /* Size=0x38 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientSystemResourceHandleResourceHandlePtr* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32ClientSystemResourceHandleResourceHandlePtr* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32ClientSystemResourceHandleResourceHandlePtr* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32ClientSystemResourceHandleResourceHandlePtr KeyValuePair;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x8];
};

__unaligned struct StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtr /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32ClientSystemResourceHandleResourceHandlePtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct StdPairunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr /* Size=0x10 */
{
    /* 0x00 */ unsigned __int32 Item1;
    /* 0x04 */ StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtr* Item2;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdMap::Nodeunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr /* Size=0x38 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* Left;
    /* 0x08 */ StdMap::Nodeunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* Parent;
    /* 0x10 */ StdMap::Nodeunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* Right;
    /* 0x18 */ byte Color;
    /* 0x19 */ bool IsNil;
    /* 0x1A */ byte _18;
    /* 0x1B */ byte _19;
    /* 0x1C */ StdPairunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr KeyValuePair;
    /*      */ byte _gap_0x2C[0x4];
    /*      */ byte _gap_0x30[0x8];
};

__unaligned struct StdMapunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr /* Size=0x10 */
{
    /* 0x00 */ StdMap::Nodeunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* Head;
    /* 0x08 */ unsigned __int64 Count;
};

__unaligned struct Client::System::Resource::ResourceGraph::CategoryContainer /* Size=0xA0 */
{
    union {
    /* 0x00 */ StdMapunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* CategoryMaps[0x14];
    /* 0x00 */ StdMapunsignedint32StdMapunsignedint32ClientSystemResourceHandleResourceHandlePtrPtr* MainMap;
    } _union_0x0;
};

__unaligned struct Client::System::Resource::ResourceGraph /* Size=0xC80 */
{
    union {
    /* 0x000 */ Client::System::Resource::ResourceGraph::CategoryContainer ContainerArray[0x14];
    struct {
    /* 0x000 */ Client::System::Resource::ResourceGraph::CategoryContainer CommonContainer;
    /* 0x0A0 */ Client::System::Resource::ResourceGraph::CategoryContainer BgCommonContainer;
    /* 0x140 */ Client::System::Resource::ResourceGraph::CategoryContainer BgContainer;
    /* 0x1E0 */ Client::System::Resource::ResourceGraph::CategoryContainer CutContainer;
    /* 0x280 */ Client::System::Resource::ResourceGraph::CategoryContainer CharaContainer;
    /* 0x320 */ Client::System::Resource::ResourceGraph::CategoryContainer ShaderContainer;
    /* 0x3C0 */ Client::System::Resource::ResourceGraph::CategoryContainer UiContainer;
    /* 0x460 */ Client::System::Resource::ResourceGraph::CategoryContainer SoundContainer;
    /* 0x500 */ Client::System::Resource::ResourceGraph::CategoryContainer VfxContainer;
    /* 0x5A0 */ Client::System::Resource::ResourceGraph::CategoryContainer UiScriptContainer;
    /* 0x640 */ Client::System::Resource::ResourceGraph::CategoryContainer ExdContainer;
    /* 0x6E0 */ Client::System::Resource::ResourceGraph::CategoryContainer GameScriptContainer;
    /* 0x780 */ Client::System::Resource::ResourceGraph::CategoryContainer MusicContainer;
    /* 0xB40 */ Client::System::Resource::ResourceGraph::CategoryContainer SqpackTestContainer;
    /* 0xBE0 */ Client::System::Resource::ResourceGraph::CategoryContainer DebugContainer;
    } _union_struct_0x0;
    } _union_0x0;
};

__unaligned struct Client::System::Resource::ResourceManager /* Size=0x1728 */
{
    /*        */ byte _gap_0x0[0x8];
    /* 0x0008 */ Client::System::Resource::ResourceGraph* ResourceGraph;
    /*        */ byte _gap_0x10[0x1718];
};

__unaligned struct Client::System::Scheduler::Base::SchedulerTimeline::SchedulerTimelineVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /* 0xE0 */ __int32 (__fastcall *GetOwningGameObjectIndex)(Client::System::Scheduler::Base::SchedulerTimeline* a1);
};

__unaligned struct Client::System::Scheduler::Resource::SchedulerResource::ResourceName /* Size=0x40 */
{
    /* 0x00 */ void** vtbl;
    /* 0x08 */ byte* DataPointer;
    /* 0x10 */ unsigned __int16 Unk1;
    /* 0x12 */ byte Buffer[0x2E];
};

__unaligned struct Client::System::Scheduler::Resource::SchedulerResource /* Size=0x88 */
{
    /* 0x00 */ void** vtbl;
    /* 0x08 */ Client::System::Scheduler::Resource::SchedulerResource* Next;
    /* 0x10 */ Client::System::Scheduler::Resource::SchedulerResource* Previous;
    /*      */ byte _gap_0x18[0x8];
    /* 0x20 */ Client::System::Resource::Handle::ResourceHandle* Resource;
    /*      */ byte _gap_0x28[0x10];
    /* 0x38 */ Client::System::Scheduler::Resource::SchedulerResource::ResourceName Name;
    /* 0x78 */ unsigned __int32 Unk1;
    /* 0x7C */ unsigned __int32 Consumers;
    /*      */ byte _gap_0x80[0x8];
};

__unaligned struct Client::System::Scheduler::Resource::SchedulerResourceManagement /* Size=0x58 */
{
    /* 0x00 */ void** vtbl;
    /* 0x08 */ Client::System::Scheduler::Resource::SchedulerResource* Begin;
    /* 0x10 */ void* Unknown;
    /* 0x18 */ unsigned __int64 NumResources;
    /*      */ byte _gap_0x20[0x38];
};

__unaligned struct Client::System::Threading::ThreadManager /* Size=0x1048 */
{
    /*        */ byte _gap_0x0[0x8];
    /* 0x0008 */ __int64 FrameworkThread;
    /* 0x0010 */ void* CriticalSection;
    /*        */ byte _gap_0x18[0x20];
    /* 0x0038 */ Client::System::Threading::Thread* Threads[0x200];
    /*        */ byte _gap_0x1038[0x8];
    /* 0x1040 */ __int32 ThreadCount;
    /*        */ byte _gap_0x1044[0x4];
};

__unaligned struct Client::UI::ActionBarSlot /* Size=0xC8 */
{
    /* 0x00 */ __int32 HotbarId;
    /* 0x04 */ __int32 ActionId;
    /*      */ byte _gap_0x8[0x80];
    /* 0x88 */ Component::GUI::AtkComponentDragDrop* ComponentDragDrop;
    /* 0x90 */ Component::GUI::AtkComponentNode* Icon;
    /* 0x98 */ Component::GUI::AtkTextNode* ControlHintTextNode;
    /* 0xA0 */ Component::GUI::AtkResNode* IconFrame;
    /* 0xA8 */ Component::GUI::AtkImageNode* ChargeIcon;
    /* 0xB0 */ Component::GUI::AtkResNode* RecastOverlayContainer;
    /* 0xB8 */ byte* PopUpHelpTextPtr;
    /*      */ byte _gap_0xC0[0x8];
};

__unaligned struct Client::UI::ActionInfo /* Size=0x38 */
{
    /* 0x00 */ byte* ActionText;
    /* 0x08 */ byte* TooltipText;
    /*      */ byte _gap_0x10[0x4];
    /* 0x14 */ unsigned __int32 ActionId;
    /* 0x18 */ unsigned __int32 IconId;
    /*      */ byte _gap_0x1C[0x4];
    /*      */ byte _gap_0x20[0x4];
    /* 0x24 */ unsigned __int32 ActionCategory;
    /*      */ byte _gap_0x28[0x10];
};

__unaligned struct Component::GUI::AtkEventListener /* Size=0x8 */
{
    union {
    /* 0x0 */ void* vtbl;
    /* 0x0 */ void** vfunc;
    } _union_0x0;
};

__unaligned struct Component::GUI::AtkUldManager::DuplicateObjectList /* Size=0x10 */
{
    /* 0x00 */ Component::GUI::AtkComponentNode* NodeList;
    /* 0x08 */ unsigned __int32 NodeCount;
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct StdLinkedList::NodeComponentGUIAtkUldManagerDuplicateObjectListPtr /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkUldManager::DuplicateObjectList* Value;
    /* 0x08 */ StdLinkedList::NodeComponentGUIAtkUldManagerDuplicateObjectListPtr* Next;
    /* 0x10 */ StdLinkedList::NodeComponentGUIAtkUldManagerDuplicateObjectListPtr* Previous;
};

__unaligned struct StdLinkedListComponentGUIAtkUldManagerDuplicateObjectListPtr /* Size=0x18 */
{
    /* 0x00 */ StdLinkedList::NodeComponentGUIAtkUldManagerDuplicateObjectListPtr* End;
    /* 0x08 */ StdLinkedList::NodeComponentGUIAtkUldManagerDuplicateObjectListPtr* Start;
    /* 0x10 */ unsigned __int32 Count;
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Component::GUI::AtkUldManager /* Size=0x90 */
{
    /* 0x00 */ Component::GUI::AtkUldAsset* Assets;
    /* 0x08 */ Component::GUI::AtkUldPartsList* PartsList;
    /* 0x10 */ Component::GUI::AtkUldObjectInfo* Objects;
    /* 0x18 */ Component::GUI::AtkUldComponentDataBase* ComponentData;
    /* 0x20 */ unsigned __int16 AssetCount;
    /* 0x22 */ unsigned __int16 PartsListCount;
    /* 0x24 */ unsigned __int16 ObjectCount;
    /* 0x26 */ unsigned __int16 DuplicateObjectCount;
    /* 0x28 */ Client::System::Resource::Handle::ResourceHandle* UldResourceHandle;
    /* 0x30 */ Component::GUI::AtkUldManager::DuplicateNodeInfo* DuplicateNodeInfoList;
    /* 0x38 */ Component::GUI::AtkTimelineManager* TimelineManager;
    /* 0x40 */ unsigned __int16 DrawOrderIndex;
    /* 0x42 */ unsigned __int16 NodeListCount;
    /*      */ byte _gap_0x44[0x4];
    /* 0x48 */ void* AtkResourceRendererManager;
    /* 0x50 */ Component::GUI::AtkResNode** NodeList;
    /* 0x58 */ StdLinkedListComponentGUIAtkUldManagerDuplicateObjectListPtr DuplicateObjectsList;
    /*      */ byte _gap_0x70[0x8];
    /* 0x78 */ Component::GUI::AtkResNode* RootNode;
    /* 0x80 */ unsigned __int16 RootNodeWidth;
    /* 0x82 */ unsigned __int16 RootNodeHeight;
    /* 0x84 */ unsigned __int16 NodeListSize;
    /* 0x86 */ byte Flags1;
    /*      */ byte _gap_0x87;
    /*      */ byte _gap_0x88;
    /* 0x89 */ Component::GUI::AtkLoadState LoadedState;
    /*      */ byte _gap_0x8A[0x2];
    /*      */ byte _gap_0x8C[0x4];
};

__unaligned struct StdVectorComponentGUISimpleTweenAnimation /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::SimpleTweenAnimation* First;
    /* 0x08 */ Component::GUI::SimpleTweenAnimation* Last;
    /* 0x10 */ Component::GUI::SimpleTweenAnimation* End;
};

__unaligned struct Component::GUI::AtkSimpleTween /* Size=0x50 */
{
    /* 0x00 */ Component::GUI::AtkSimpleTween::AtkSimpleTweenVTable* VTable;
    /* 0x08 */ Component::GUI::SimpleTweenState State;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ Component::GUI::AtkResNode* Node;
    /* 0x18 */ float CurrentTimestamp;
    /* 0x1C */ float Duration;
    /* 0x20 */ StdVectorComponentGUISimpleTweenAnimation Animations;
    /* 0x38 */ __int32 Id;
    /*      */ byte _gap_0x3C[0x4];
    /* 0x40 */ Component::GUI::AtkEvent* Event;
    /* 0x48 */ float EasingFactor;
    /*      */ byte _gap_0x4C[0x4];
};

__unaligned struct Component::GUI::AtkUnitBase /* Size=0x220 */
{
    union {
    /* 0x000 */ Component::GUI::AtkEventListener AtkEventListener;
    /* 0x000 */ Component::GUI::AtkUnitBase::AtkUnitBaseVTable* VTable;
    } _union_0x0;
    /* 0x008 */ byte Name[0x20];
    /* 0x028 */ Component::GUI::AtkUldManager UldManager;
    /*       */ byte _gap_0xB8[0x10];
    /* 0x0C8 */ Component::GUI::AtkResNode* RootNode;
    /* 0x0D0 */ Component::GUI::AtkCollisionNode* WindowCollisionNode;
    /* 0x0D8 */ Component::GUI::AtkCollisionNode* WindowHeaderCollisionNode;
    /* 0x0E0 */ Component::GUI::AtkResNode* CursorTarget;
    /*       */ byte _gap_0xE8[0x18];
    /* 0x100 */ Component::GUI::AtkComponentNode* CurrentDropDownOwnerNode;
    /* 0x108 */ Component::GUI::AtkComponentNode* WindowNode;
    /* 0x110 */ Component::GUI::AtkSimpleTween RootNodeTween;
    /* 0x160 */ Component::GUI::AtkValue* AtkValues;
    /*       */ byte _gap_0x168[0x18];
    /*       */ byte _gap_0x180[0x2];
    /* 0x182 */ byte Flags;
    /*       */ byte _gap_0x183;
    /*       */ byte _gap_0x184[0x4];
    /*       */ byte _gap_0x188[0x8];
    /*       */ byte _gap_0x190[0x4];
    /* 0x194 */ unsigned __int32 OpenTransitionDuration;
    /* 0x198 */ unsigned __int32 CloseTransitionDuration;
    /*       */ byte _gap_0x19C[0x4];
    /*       */ byte _gap_0x1A0;
    /* 0x1A1 */ byte NumOpenPopups;
    /*       */ byte _gap_0x1A2[0x2];
    /* 0x1A4 */ float OpenTransitionScale;
    /* 0x1A8 */ float CloseTransitionScale;
    /* 0x1AC */ float Scale;
    /*       */ byte _gap_0x1B0[0x4];
    /*       */ byte _gap_0x1B4[0x2];
    /* 0x1B6 */ byte VisibilityFlags;
    /*       */ byte _gap_0x1B7;
    /* 0x1B8 */ unsigned __int16 DrawOrderIndex;
    /*       */ byte _gap_0x1BA[0x2];
    /* 0x1BC */ __int16 X;
    /* 0x1BE */ __int16 Y;
    /* 0x1C0 */ __int16 OpenTransitionOffsetX;
    /* 0x1C2 */ __int16 OpenTransitionOffsetY;
    /* 0x1C4 */ __int16 CloseTransitionOffsetX;
    /* 0x1C6 */ __int16 CloseTransitionOffsetY;
    /* 0x1C8 */ __int16 OpenSoundEffectId;
    /* 0x1CA */ unsigned __int16 AtkValuesCount;
    /* 0x1CC */ unsigned __int16 ID;
    /* 0x1CE */ unsigned __int16 ParentID;
    /* 0x1D0 */ unsigned __int16 HostID;
    /* 0x1D2 */ unsigned __int16 ContextMenuParentID;
    /*       */ byte _gap_0x1D4;
    /* 0x1D5 */ byte Alpha;
    /* 0x1D6 */ byte ShowHideFlags;
    /*       */ byte _gap_0x1D7;
    /* 0x1D8 */ Component::GUI::AtkResNode** CollisionNodeList;
    /* 0x1E0 */ unsigned __int32 CollisionNodeListCount;
    /*       */ byte _gap_0x1E4[0x4];
    /*       */ byte _gap_0x1E8[0x38];
};

__unaligned struct StdVectorClientUIActionBarSlot /* Size=0x18 */
{
    /* 0x00 */ Client::UI::ActionBarSlot* First;
    /* 0x08 */ Client::UI::ActionBarSlot* Last;
    /* 0x10 */ Client::UI::ActionBarSlot* End;
};

__unaligned struct Client::UI::AddonActionBarBase /* Size=0x248 */
{
    union {
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x000 */ Client::UI::AddonActionBarBase::AddonActionBarBaseVTable* VTable;
    } _union_0x0;
    /* 0x220 */ StdVectorClientUIActionBarSlot ActionBarSlotVector;
    /* 0x238 */ __int16 CurrentPulsingSlots;
    /*       */ byte _gap_0x23A[0x2];
    /* 0x23C */ byte RaptureHotbarId;
    /*       */ byte _gap_0x23D;
    /* 0x23E */ byte SlotCount;
    /* 0x23F */ bool IsLocked;
    /* 0x240 */ bool IsSharedHotbar;
    /*       */ byte _gap_0x241;
    /* 0x242 */ bool IsCrossHotbar;
    /* 0x243 */ bool DragDropInProgress;
    /*       */ byte _gap_0x244;
    /* 0x245 */ bool DisplayPetBar;
    /*       */ byte _gap_0x246[0x2];
};

__unaligned struct Client::UI::AddonActionBarX::Dimensions /* Size=0x4 */
{
    /* 0x0 */ __int16 Width;
    /* 0x2 */ __int16 Height;
};

__unaligned struct Client::UI::AddonActionBarX /* Size=0x298 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase AddonActionBarBase;
    /* 0x248 */ Component::GUI::AtkTextNode* HotbarNumIconTextNode;
    /* 0x250 */ Component::GUI::AtkCollisionNode* HotbarNumIconCollisionNode;
    /* 0x258 */ Component::GUI::AtkResNode* ContainerNode;
    /* 0x260 */ Component::GUI::AtkResNode* HotbarNumIconNode;
    /* 0x268 */ Component::GUI::AtkResNode* PadlockNode;
    /* 0x270 */ Client::UI::ActionBarLayout ActionBarLayout;
    /*       */ byte _gap_0x271;
    /*       */ byte _gap_0x272[0x2];
    /*       */ byte _gap_0x274[0x4];
    /*       */ byte _gap_0x278[0x4];
    /* 0x27C */ Client::UI::AddonActionBarX::Dimensions LayoutDimensions[0x6];
    /*       */ byte _gap_0x294[0x4];
};

__unaligned struct Client::UI::AddonActionBar /* Size=0x2B8 */
{
    /* 0x000 */ Client::UI::AddonActionBarX AddonActionBarX;
    /*       */ byte _gap_0x298[0x8];
    /* 0x2A0 */ Component::GUI::AtkComponentBase* CycleUpArrow;
    union {
    /* 0x2A8 */ Component::GUI::AtkComponentBase* CycleDownArrow;
    /* 0x2A8 */ Component::GUI::AtkComponentCheckBox* PadlockCheckbox;
    } _union_0x2A8;
    /*       */ byte _gap_0x2B0;
    /* 0x2B1 */ byte HotbarIdPet;
    /*       */ byte _gap_0x2B2;
    /* 0x2B3 */ byte HotbarId;
    /*       */ byte _gap_0x2B4;
    /* 0x2B5 */ bool IncludePetBarWhenCycling;
    /*       */ byte _gap_0x2B6[0x2];
};

__unaligned struct Client::UI::AddonActionBarBase::AddonActionBarBaseVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /*     */ __int64 _vf38;
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /*     */ __int64 _vf47;
    /*     */ __int64 _vf48;
    /*     */ __int64 _vf49;
    /*     */ __int64 _vf50;
    /*     */ __int64 _vf51;
    /*     */ __int64 _vf52;
    /*     */ __int64 _vf53;
    /*     */ __int64 _vf54;
    /*     */ __int64 _vf55;
    /*     */ __int64 _vf56;
    /*     */ __int64 _vf57;
    /*     */ __int64 _vf58;
    /*     */ __int64 _vf59;
    /*     */ __int64 _vf60;
    /*     */ __int64 _vf61;
    /*     */ __int64 _vf62;
    /*     */ __int64 _vf63;
    /*     */ __int64 _vf64;
    /*     */ __int64 _vf65;
    /*     */ __int64 _vf66;
    /*     */ __int64 _vf67;
    /*     */ __int64 _vf68;
    /*     */ __int64 _vf69;
    /*     */ __int64 _vf70;
    /*     */ __int64 _vf71;
    /*     */ __int64 _vf72;
    /*     */ __int64 _vf73;
    /*     */ __int64 _vf74;
    /*     */ __int64 _vf75;
    /*     */ __int64 _vf76;
    /*     */ __int64 _vf77;
    /* 0x270 */ void (__fastcall *PulseActionBarSlot)(Client::UI::AddonActionBarBase* a1, __int32 a2);
};

__unaligned struct Client::UI::AddonActionCross::HelpMessage /* Size=0x10 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* HelpComponent;
    /* 0x08 */ Component::GUI::AtkTextNode* HelpText;
};

__unaligned struct Component::GUI::AtkEventTarget /* Size=0x8 */
{
    union {
    /* 0x0 */ void* vtbl;
    /* 0x0 */ void** vfunc;
    } _union_0x0;
};

__unaligned struct Component::GUI::AtkEventManager /* Size=0x8 */
{
    /* 0x0 */ Component::GUI::AtkEvent* Event;
};

__unaligned struct Common::Math::Matrix2x2 /* Size=0x10 */
{
    /* 0x00 */ float M11;
    /* 0x04 */ float M12;
    /* 0x08 */ float M21;
    /* 0x0C */ float M22;
};

__unaligned struct Component::GUI::AtkResNode /* Size=0xB0 */
{
    union {
    /* 0x00 */ Component::GUI::AtkEventTarget AtkEventTarget;
    /* 0x00 */ Component::GUI::AtkResNode::AtkResNodeVTable* VTable;
    } _union_0x0;
    /* 0x08 */ unsigned __int32 NodeID;
    /*      */ byte _gap_0xC[0x4];
    /* 0x10 */ Component::GUI::AtkTimeline* Timeline;
    /* 0x18 */ Component::GUI::AtkEventManager AtkEventManager;
    /* 0x20 */ Component::GUI::AtkResNode* ParentNode;
    /* 0x28 */ Component::GUI::AtkResNode* PrevSiblingNode;
    /* 0x30 */ Component::GUI::AtkResNode* NextSiblingNode;
    /* 0x38 */ Component::GUI::AtkResNode* ChildNode;
    /* 0x40 */ Component::GUI::NodeType Type;
    /* 0x42 */ unsigned __int16 ChildCount;
    /* 0x44 */ float X;
    /* 0x48 */ float Y;
    /* 0x4C */ float ScaleX;
    /* 0x50 */ float ScaleY;
    /* 0x54 */ float Rotation;
    /* 0x58 */ Common::Math::Matrix2x2 Transform;
    /* 0x68 */ float ScreenX;
    /* 0x6C */ float ScreenY;
    /* 0x70 */ Client::Graphics::ByteColor Color;
    /* 0x74 */ float Depth;
    /* 0x78 */ float Depth_2;
    /* 0x7C */ __int16 AddRed;
    /* 0x7E */ __int16 AddGreen;
    /* 0x80 */ __int16 AddBlue;
    /* 0x82 */ __int16 AddRed_2;
    /* 0x84 */ __int16 AddGreen_2;
    /* 0x86 */ __int16 AddBlue_2;
    /* 0x88 */ byte MultiplyRed;
    /* 0x89 */ byte MultiplyGreen;
    /* 0x8A */ byte MultiplyBlue;
    /* 0x8B */ byte MultiplyRed_2;
    /* 0x8C */ byte MultiplyGreen_2;
    /* 0x8D */ byte MultiplyBlue_2;
    /* 0x8E */ byte Alpha_2;
    /* 0x8F */ byte UnkByte_1;
    /* 0x90 */ unsigned __int16 Width;
    /* 0x92 */ unsigned __int16 Height;
    /* 0x94 */ float OriginX;
    /* 0x98 */ float OriginY;
    /* 0x9C */ unsigned __int16 Priority;
    /* 0x9E */ Component::GUI::NodeFlags NodeFlags;
    /* 0xA0 */ unsigned __int32 DrawFlags;
    /*      */ byte _gap_0xA4[0x4];
    /*      */ byte _gap_0xA8[0x8];
};

__unaligned struct Component::GUI::AtkComponentNode /* Size=0xB8 */
{
    /* 0x00 */ Component::GUI::AtkResNode AtkResNode;
    /* 0xB0 */ Component::GUI::AtkComponentBase* Component;
};

__unaligned struct Component::GUI::AtkComponentBase /* Size=0xC0 */
{
    union {
    /* 0x00 */ Component::GUI::AtkEventListener AtkEventListener;
    /* 0x00 */ Component::GUI::AtkComponentBase::AtkComponentBaseVTable* VTable;
    } _union_0x0;
    /* 0x08 */ Component::GUI::AtkUldManager UldManager;
    /*      */ byte _gap_0x98[0x8];
    /* 0xA0 */ Component::GUI::AtkResNode* AtkResNode;
    /* 0xA8 */ Component::GUI::AtkComponentNode* OwnerNode;
    /*      */ byte _gap_0xB0[0x10];
};

__unaligned struct Client::UI::AddonActionCross::ChangeSetUI /* Size=0x158 */
{
    /* 0x000 */ Client::UI::AddonActionCross::HelpMessage HelpMessages[0x8];
    /* 0x080 */ Component::GUI::AtkComponentNode* NumIcons[0x8];
    /* 0x0C0 */ Component::GUI::AtkResNode* ContainerNode;
    /*       */ byte _gap_0xC8[0x8];
    /* 0x0D0 */ Component::GUI::AtkComponentBase* DpadComponents[0x4];
    /* 0x0F0 */ Component::GUI::AtkResNode* DpadNodes[0x4];
    /*       */ byte _gap_0x110[0x8];
    /* 0x118 */ Component::GUI::AtkComponentBase* ActionButtonComponents[0x4];
    /* 0x138 */ Component::GUI::AtkResNode* ActionButtonNodes[0x4];
};

__unaligned struct Client::UI::AddonActionCross::SlotGroup /* Size=0x60 */
{
    /* 0x00 */ Client::UI::AddonActionCross::HelpMessage HotbarHelp[0x4];
    /* 0x40 */ Component::GUI::AtkComponentNode* SlotContainer;
    /* 0x48 */ Component::GUI::AtkComponentNode* HotbarHelpContainer;
    /*      */ byte _gap_0x50[0x10];
};

__unaligned struct Client::UI::AddonActionCross::ControlGuide /* Size=0x48 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* ComponentBase;
    /* 0x08 */ Component::GUI::AtkComponentBase* Components[0x4];
    /* 0x28 */ Component::GUI::AtkResNode* Nodes[0x4];
};

__unaligned struct Client::UI::AddonActionCross /* Size=0x710 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase ActionBarBase;
    /* 0x248 */ Client::UI::AddonActionCross::ChangeSetUI ChangeSet;
    /* 0x3A0 */ Component::GUI::AtkComponentNode* PadlockNode;
    /* 0x3A8 */ Component::GUI::AtkComponentCheckBox* PadlockCheckbox;
    /* 0x3B0 */ Client::UI::AddonActionCross::SlotGroup SlotGroups[0x4];
    /* 0x530 */ Client::UI::AddonActionCross::ControlGuide ControlGuideDpad;
    /* 0x578 */ Client::UI::AddonActionCross::ControlGuide ControlGuideActionButtons;
    /* 0x5C0 */ Component::GUI::AtkTextNode* SetNumIconNode;
    /* 0x5C8 */ Component::GUI::AtkComponentBase* ControlGuideEditComponent;
    /*       */ byte _gap_0x5D0[0xF8];
    /* 0x6C8 */ Component::GUI::AtkResNode* RootNode;
    /* 0x6D0 */ Component::GUI::AtkResNode* ContainerNode;
    /*       */ byte _gap_0x6D8[0x8];
    /* 0x6E0 */ byte ButtonMask;
    /*       */ byte _gap_0x6E1;
    /*       */ byte _gap_0x6E2[0x2];
    /*       */ byte _gap_0x6E4[0x4];
    /* 0x6E8 */ unsigned __int32 ExpandedHoldMapValueLR;
    /* 0x6EC */ unsigned __int32 ExpandedHoldMapValueRL;
    /* 0x6F0 */ bool SelectedDoubleCrossLeft;
    /*       */ byte _gap_0x6F1;
    /*       */ byte _gap_0x6F2[0x2];
    /* 0x6F4 */ bool SelectedDoubleCrossRight;
    /*       */ byte _gap_0x6F5;
    /*       */ byte _gap_0x6F6[0x2];
    /*       */ byte _gap_0x6F8[0x8];
    /* 0x700 */ bool InEditMode;
    /* 0x701 */ bool SelectedLeft;
    /* 0x702 */ bool SelectedRight;
    /* 0x703 */ bool DisplayChangeSet;
    /* 0x704 */ bool DisplayPetBar;
    /*       */ byte _gap_0x705;
    /* 0x706 */ bool AlternateDisplayType;
    /* 0x707 */ bool OverrideHidden;
    /* 0x708 */ byte AlphaStandard;
    /* 0x709 */ byte AlphaActive;
    /* 0x70A */ byte AlphaInactive;
    /*       */ byte _gap_0x70B;
    /*       */ byte _gap_0x70C[0x4];
};

__unaligned struct Client::UI::AddonActionCrossEditor /* Size=0x250 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* HeadingText;
    /* 0x228 */ Component::GUI::AtkTextNode* InstructionText;
    /* 0x230 */ Component::GUI::AtkTextNode* SelectedActionText;
    /* 0x238 */ Component::GUI::AtkComponentBase* ControlGuide;
    /* 0x240 */ Component::GUI::AtkComponentIcon* SelectedActionIcon;
    /*       */ byte _gap_0x248[0x8];
};

__unaligned struct Client::UI::AddonActionDoubleCrossBase /* Size=0x2F8 */
{
    /* 0x000 */ Client::UI::AddonActionBarBase ActionBarBase;
    /* 0x248 */ Component::GUI::AtkResNode* ContainerNode;
    /* 0x250 */ Component::GUI::AtkComponentNode* SlotContainerL;
    /* 0x258 */ Component::GUI::AtkComponentNode* SlotContainerR;
    /* 0x260 */ Client::UI::AddonActionCross::HelpMessage HotbarHelpL[0x4];
    /* 0x2A0 */ Client::UI::AddonActionCross::HelpMessage HotbarHelpR[0x4];
    /* 0x2E0 */ bool Selected;
    /* 0x2E1 */ byte ShowDPadSlots;
    /* 0x2E2 */ bool AlwaysDisplay;
    /* 0x2E3 */ bool OtherBarSelected;
    /* 0x2E4 */ bool DoubleTapDetected;
    /*       */ byte _gap_0x2E5;
    /*       */ byte _gap_0x2E6[0x2];
    /* 0x2E8 */ byte BarTarget;
    /*       */ byte _gap_0x2E9;
    /*       */ byte _gap_0x2EA[0x2];
    /* 0x2EC */ byte UseLeftSide;
    /* 0x2ED */ byte MergedPositioning;
    /*       */ byte _gap_0x2EE[0x2];
    /*       */ byte _gap_0x2F0[0x8];
};

__unaligned struct Client::UI::AddonActionMenu /* Size=0x1720 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x0220 */ Component::GUI::AtkComponentList* ActionList;
    /* 0x0228 */ Component::GUI::AtkComponentList* TraitList;
    /* 0x0230 */ Component::GUI::AtkComponentRadioButton* ActionsRadioButton;
    /* 0x0238 */ Component::GUI::AtkComponentRadioButton* TraitsRadioButton;
    /* 0x0240 */ Component::GUI::AtkComponentRadioButton* GathererRoleRadioButton;
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* GeneralRadioButton;
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* OrdersRadioButton;
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* MainCommandsRadioButton;
    /* 0x0260 */ Component::GUI::AtkComponentRadioButton* PerformanceRadioButton;
    /* 0x0268 */ Component::GUI::AtkComponentRadioButton* ExtrasRadioButton;
    /* 0x0270 */ Component::GUI::AtkComponentRadioButton* RoleRadioButton;
    /*        */ byte _gap_0x278[0xA0];
    /* 0x0318 */ Client::UI::ActionInfo ActionArray[0x50];
    /*        */ byte _gap_0x1498[0x10];
    /* 0x14A8 */ Component::GUI::AtkResNode* SidebarContainer;
    /* 0x14B0 */ Component::GUI::AtkResNode* ContentsContainer;
    /* 0x14B8 */ Component::GUI::AtkResNode* ActionsFooterContainer;
    /* 0x14C0 */ Component::GUI::AtkComponentButton* HelpButton;
    /* 0x14C8 */ Component::GUI::AtkComponentButton* CompactModeToggleButton;
    /* 0x14D0 */ Component::GUI::AtkResNode* LevelTextContainer;
    /* 0x14D8 */ Component::GUI::AtkImageNode* JobIcon;
    /* 0x14E0 */ Component::GUI::AtkTextNode* JobText;
    /*        */ byte _gap_0x14E8[0x28];
    /* 0x1510 */ Component::GUI::AtkComponentScrollBar* Scrollbar;
    /* 0x1518 */ Component::GUI::AtkResNode* ActionContentsContainer;
    /* 0x1520 */ Component::GUI::AtkCollisionNode* ActionCollision;
    /*        */ byte _gap_0x1528[0x1F8];
};

__unaligned struct Client::UI::AddonAOZNotebook::SpellbookBlock /* Size=0x48 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* AtkComponentBase;
    /* 0x08 */ Component::GUI::AtkCollisionNode* AtkCollisionNode;
    /* 0x10 */ Component::GUI::AtkComponentCheckBox* AtkComponentCheckBox;
    /* 0x18 */ Component::GUI::AtkComponentIcon* AtkComponentIcon;
    /* 0x20 */ Component::GUI::AtkTextNode* AtkTextNode;
    /* 0x28 */ Component::GUI::AtkResNode* AtkResNode1;
    /* 0x30 */ Component::GUI::AtkResNode* AtkResNode2;
    /* 0x38 */ wchar_t* Name;
    /* 0x40 */ unsigned __int32 ActionID;
    /*      */ byte _gap_0x44[0x4];
};

__unaligned struct Client::UI::AddonAOZNotebook::ActiveActions /* Size=0x20 */
{
    /* 0x00 */ Component::GUI::AtkComponentDragDrop* AtkComponentDragDrop;
    /* 0x08 */ Component::GUI::AtkTextNode* AtkTextNode;
    /* 0x10 */ wchar_t* Name;
    /* 0x18 */ __int32 ActionID;
    /*      */ byte _gap_0x1C[0x4];
};

__unaligned struct Client::UI::AddonAOZNotebook /* Size=0xCC8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xE8];
    /* 0x308 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock01;
    /* 0x350 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock02;
    /* 0x398 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock03;
    /* 0x3E0 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock04;
    /* 0x428 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock05;
    /* 0x470 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock06;
    /* 0x4B8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock07;
    /* 0x500 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock08;
    /* 0x548 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock09;
    /* 0x590 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock10;
    /* 0x5D8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock11;
    /* 0x620 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock12;
    /* 0x668 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock13;
    /* 0x6B0 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock14;
    /* 0x6F8 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock15;
    /* 0x740 */ Client::UI::AddonAOZNotebook::SpellbookBlock SpellbookBlock16;
    /*       */ byte _gap_0x788[0x98];
    /* 0x820 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions01;
    /* 0x840 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions02;
    /* 0x860 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions03;
    /* 0x880 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions04;
    /* 0x8A0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions05;
    /* 0x8C0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions06;
    /* 0x8E0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions07;
    /* 0x900 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions08;
    /* 0x920 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions09;
    /* 0x940 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions10;
    /* 0x960 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions11;
    /* 0x980 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions12;
    /* 0x9A0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions13;
    /* 0x9C0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions14;
    /* 0x9E0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions15;
    /* 0xA00 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions16;
    /* 0xA20 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions17;
    /* 0xA40 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions18;
    /* 0xA60 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions19;
    /* 0xA80 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions20;
    /* 0xAA0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions21;
    /* 0xAC0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions22;
    /* 0xAE0 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions23;
    /* 0xB00 */ Client::UI::AddonAOZNotebook::ActiveActions ActiveActions24;
    /*       */ byte _gap_0xB20[0x1A8];
};

__unaligned struct Client::UI::AddonBank /* Size=0x298 */
{
    union {
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x000 */ Client::UI::AddonBank::AddonBankVTable* VTable;
    } _union_0x0;
    /*       */ byte _gap_0x220[0x78];
};

__unaligned struct StdVectorComponentGUIAtkValue /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkValue* First;
    /* 0x08 */ Component::GUI::AtkValue* Last;
    /* 0x10 */ Component::GUI::AtkValue* End;
};

__unaligned struct Component::GUI::AtkValue /* Size=0x10 */
{
    /* 0x00 */ Component::GUI::ValueType Type;
    /*      */ byte _gap_0x4[0x4];
    union {
    /* 0x08 */ __int32 Int;
    /* 0x08 */ unsigned __int32 UInt;
    /* 0x08 */ byte* String;
    /* 0x08 */ float Float;
    /* 0x08 */ byte Byte;
    /* 0x08 */ StdVectorComponentGUIAtkValue* Vector;
    /* 0x08 */ Client::Graphics::Kernel::Texture* Texture;
    /* 0x08 */ Component::GUI::AtkValue* AtkValues;
    } _union_0x8;
};

__unaligned struct Client::UI::AddonBank::AddonBankVTable /* Size=0x0 */
{
    /*     */ __int64 _vf0;
    /*     */ __int64 _vf1;
    /*     */ __int64 _vf2;
    /*     */ __int64 _vf3;
    /*     */ __int64 _vf4;
    /*     */ __int64 _vf5;
    /*     */ __int64 _vf6;
    /*     */ __int64 _vf7;
    /*     */ __int64 _vf8;
    /*     */ __int64 _vf9;
    /*     */ __int64 _vf10;
    /*     */ __int64 _vf11;
    /*     */ __int64 _vf12;
    /*     */ __int64 _vf13;
    /*     */ __int64 _vf14;
    /*     */ __int64 _vf15;
    /*     */ __int64 _vf16;
    /*     */ __int64 _vf17;
    /*     */ __int64 _vf18;
    /*     */ __int64 _vf19;
    /*     */ __int64 _vf20;
    /*     */ __int64 _vf21;
    /*     */ __int64 _vf22;
    /*     */ __int64 _vf23;
    /*     */ __int64 _vf24;
    /*     */ __int64 _vf25;
    /*     */ __int64 _vf26;
    /*     */ __int64 _vf27;
    /*     */ __int64 _vf28;
    /*     */ __int64 _vf29;
    /*     */ __int64 _vf30;
    /*     */ __int64 _vf31;
    /*     */ __int64 _vf32;
    /*     */ __int64 _vf33;
    /*     */ __int64 _vf34;
    /*     */ __int64 _vf35;
    /*     */ __int64 _vf36;
    /*     */ __int64 _vf37;
    /*     */ __int64 _vf38;
    /*     */ __int64 _vf39;
    /*     */ __int64 _vf40;
    /*     */ __int64 _vf41;
    /*     */ __int64 _vf42;
    /*     */ __int64 _vf43;
    /*     */ __int64 _vf44;
    /*     */ __int64 _vf45;
    /*     */ __int64 _vf46;
    /* 0x178 */ void (__fastcall *OnSetup)(Client::UI::AddonBank* a1, unsigned __int32 a2, Component::GUI::AtkValue* a3);
};

__unaligned struct Client::UI::AddonBannerEditor /* Size=0x4E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xB8];
    /* 0x2D8 */ Component::GUI::AtkComponentDropDownList* PresetDropdown;
    /*       */ byte _gap_0x2E0[0x18];
    /* 0x2F8 */ Component::GUI::AtkComponentDropDownList* BackgroundDropdown;
    /*       */ byte _gap_0x300[0x18];
    /* 0x318 */ Component::GUI::AtkComponentDropDownList* FrameDropdown;
    /*       */ byte _gap_0x320[0x18];
    /* 0x338 */ Component::GUI::AtkComponentDropDownList* AccentDropdown;
    /*       */ byte _gap_0x340[0x18];
    /* 0x358 */ Component::GUI::AtkComponentDropDownList* PoseDropdown;
    /*       */ byte _gap_0x360[0x18];
    /* 0x378 */ Component::GUI::AtkComponentDropDownList* ExpressionDropdown;
    /*       */ byte _gap_0x380[0x38];
    /* 0x3B8 */ Component::GUI::AtkComponentCheckBox* PlayAnimationCheckbox;
    /* 0x3C0 */ Component::GUI::AtkComponentCheckBox* HeadFacingCameraCheckbox;
    /* 0x3C8 */ Component::GUI::AtkComponentCheckBox* EyesFacingCameraCheckbox;
    /*       */ byte _gap_0x3D0[0x28];
    /* 0x3F8 */ Component::GUI::AtkComponentButton* ApplyEquipmentButton;
    /* 0x400 */ Component::GUI::AtkComponentButton* SaveButton;
    /* 0x408 */ Component::GUI::AtkComponentButton* CloseButton;
    /* 0x410 */ Component::GUI::AtkComponentSlider* AmbientLightingColorRedSlider;
    /* 0x418 */ Component::GUI::AtkComponentSlider* AmbientLightingColorGreenSlider;
    /* 0x420 */ Component::GUI::AtkComponentSlider* AmbientLightingColorBlueSlider;
    /* 0x428 */ Component::GUI::AtkComponentSlider* AmbientLightingBrightnessSlider;
    /* 0x430 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorRedSlider;
    /* 0x438 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorGreenSlider;
    /* 0x440 */ Component::GUI::AtkComponentSlider* DirectionalLightingColorBlueSlider;
    /* 0x448 */ Component::GUI::AtkComponentSlider* DirectionalLightingBrightnessSlider;
    /* 0x450 */ Component::GUI::AtkComponentSlider* DirectionalLightingVerticalAngleSlider;
    /* 0x458 */ Component::GUI::AtkComponentSlider* DirectionalLightingHorizontalAngleSlider;
    /* 0x460 */ Component::GUI::AtkComponentSlider* CameraZoomSlider;
    /* 0x468 */ Component::GUI::AtkComponentSlider* ImageRotation;
    /*       */ byte _gap_0x470[0x50];
    /* 0x4C0 */ Component::GUI::AtkResNode* WarningSymbol;
    /*       */ byte _gap_0x4C8[0x4];
    /* 0x4CC */ __int16 NumPresets;
    /*       */ byte _gap_0x4CE[0x2];
    /*       */ byte _gap_0x4D0[0x10];
    /*       */ byte _gap_0x4E0[0x2];
    /*       */ byte _gap_0x4E2;
    /* 0x4E3 */ bool IsWarningSymbolShown;
    /*       */ byte _gap_0x4E4[0x4];
};

__unaligned struct Client::UI::AddonCastBar /* Size=0x500 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::System::String::Utf8String CastName;
    /*       */ byte _gap_0x288[0x30];
    /*       */ byte _gap_0x2B8[0x4];
    /* 0x2BC */ unsigned __int16 CastTime;
    /*       */ byte _gap_0x2BE[0x2];
    /* 0x2C0 */ float CastPercent;
    /*       */ byte _gap_0x2C4[0x4];
    /*       */ byte _gap_0x2C8[0x238];
};

__unaligned struct Client::UI::AddonCharacterInspect /* Size=0x500 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x210];
    /* 0x430 */ Component::GUI::AtkComponentBase* PreviewComponent;
    /*       */ byte _gap_0x438[0xC8];
};

__unaligned struct Client::UI::AddonChatLogPanel /* Size=0x3D0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x60];
    /* 0x280 */ Component::GUI::AtkTextNode* ChatText;
    /*       */ byte _gap_0x288[0x28];
    /* 0x2B0 */ byte FontSize;
    /*       */ byte _gap_0x2B1;
    /*       */ byte _gap_0x2B2[0x2];
    /* 0x2B4 */ unsigned __int32 FirstLineVisible;
    /* 0x2B8 */ unsigned __int32 LastLineVisible;
    /*       */ byte _gap_0x2BC[0x4];
    /* 0x2C0 */ unsigned __int32 Unknown2C0;
    /* 0x2C4 */ unsigned __int32 TotalLineCount;
    /*       */ byte _gap_0x2C8[0x30];
    /* 0x2F8 */ unsigned __int32 MessagesAboveCurrent;
    /*       */ byte _gap_0x2FC[0x4];
    /*       */ byte _gap_0x300[0x40];
    /*       */ byte _gap_0x340;
    /* 0x341 */ byte IsScrolledBottom;
    /*       */ byte _gap_0x342[0x2];
    /*       */ byte _gap_0x344[0x4];
    /*       */ byte _gap_0x348[0x88];
};

__unaligned struct Client::UI::AddonChocoboBreedTraining /* Size=0x230 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* CommenceButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* CancelButton;
};

__unaligned struct Component::GUI::AtkTextNode /* Size=0x160 */
{
    /* 0x000 */ Component::GUI::AtkResNode AtkResNode;
    /* 0x0B0 */ unsigned __int32 TextId;
    /* 0x0B4 */ Client::Graphics::ByteColor TextColor;
    /* 0x0B8 */ Client::Graphics::ByteColor EdgeColor;
    /* 0x0BC */ Client::Graphics::ByteColor BackgroundColor;
    /* 0x0C0 */ Client::System::String::Utf8String NodeText;
    /*       */ byte _gap_0x128[0x8];
    /* 0x130 */ void* UnkPtr_1;
    /*       */ byte _gap_0x138[0x8];
    /* 0x140 */ unsigned __int32 SelectStart;
    /* 0x144 */ unsigned __int32 SelectEnd;
    /*       */ byte _gap_0x148[0x8];
    /*       */ byte _gap_0x150[0x2];
    /* 0x152 */ byte LineSpacing;
    /* 0x153 */ byte CharSpacing;
    /* 0x154 */ byte AlignmentFontType;
    /* 0x155 */ byte FontSize;
    /* 0x156 */ byte SheetType;
    /*       */ byte _gap_0x157;
    /* 0x158 */ unsigned __int16 FontCacheHandle;
    /* 0x15A */ byte TextFlags;
    /* 0x15B */ byte TextFlags2;
    /*       */ byte _gap_0x15C[0x4];
};

__unaligned struct Component::GUI::AtkComponentButton /* Size=0xF0 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase AtkComponentBase;
    /* 0xC0 */ __int16 Left;
    /* 0xC2 */ __int16 Top;
    /* 0xC4 */ __int16 Right;
    /* 0xC6 */ __int16 Bottom;
    /* 0xC8 */ Component::GUI::AtkTextNode* ButtonTextNode;
    /* 0xD0 */ Component::GUI::AtkResNode* ButtonBGNode;
    /*      */ byte _gap_0xD8[0x10];
    /* 0xE8 */ unsigned __int32 Flags;
    /*      */ byte _gap_0xEC[0x4];
};

__unaligned struct Client::UI::AddonContentsFinder /* Size=0x16C8 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x98];
    /* 0x02B8 */ Component::GUI::AtkComponentButton* JoinButton;
    /* 0x02C0 */ Component::GUI::AtkComponentButton* ClearSelectionButton;
    /* 0x02C8 */ Component::GUI::AtkComponentRadioButton* DutyRouletteRadioButton;
    /* 0x02D0 */ Component::GUI::AtkComponentRadioButton* Dungeons1RadioButton;
    /* 0x02D8 */ Component::GUI::AtkComponentRadioButton* Dungeons2RadioButton;
    /* 0x02E0 */ Component::GUI::AtkComponentRadioButton* GuildHeistsRadioButton;
    /* 0x02E8 */ Component::GUI::AtkComponentRadioButton* Trials1RadioButton;
    /* 0x02F0 */ Component::GUI::AtkComponentRadioButton* Trials2RadioButton;
    /* 0x02F8 */ Component::GUI::AtkComponentRadioButton* Raids1RadioButton;
    /* 0x0300 */ Component::GUI::AtkComponentRadioButton* Raids2RadioButton;
    /* 0x0308 */ Component::GUI::AtkComponentRadioButton* PvpRadioButton;
    /* 0x0310 */ Component::GUI::AtkComponentRadioButton* GoldSaucerRadioButton;
    /* 0x0318 */ Component::GUI::AtkTextNode* SelectedDutyTextNode[0x5];
    /* 0x0340 */ Component::GUI::AtkComponentTreeList* DutyList;
    /* 0x0348 */ Component::GUI::AtkComponentDropDownList* OrderByButton;
    /* 0x0350 */ Component::GUI::AtkComponentButton* RefreshButton;
    /* 0x0358 */ Component::GUI::AtkComponentButton* DutyTypeButton;
    /* 0x0360 */ Component::GUI::AtkTextNode* JobNameTextNode;
    /* 0x0368 */ Component::GUI::AtkTextNode* UnkTextNode;
    /* 0x0370 */ Component::GUI::AtkTextNode* LevelTextNode;
    /* 0x0378 */ Component::GUI::AtkTextNode* ItemLevelTextNode;
    /* 0x0380 */ Component::GUI::AtkTextNode* RoleTextNode;
    /* 0x0388 */ Component::GUI::AtkTextNode* NumberSelectedTextNode;
    /* 0x0390 */ Component::GUI::AtkTextNode* ObtainingDataTextNode;
    /* 0x0398 */ Component::GUI::AtkTextNode* NumOtherPartiesRecruitingTextNode;
    /*        */ byte _gap_0x3A0[0x8];
    /* 0x03A8 */ Component::GUI::AtkImageNode* StarImageNode;
    /* 0x03B0 */ Component::GUI::AtkResNode* RoleIconResNode;
    /* 0x03B8 */ Component::GUI::AtkImageNode* RoleIconImageNode;
    /* 0x03C0 */ Component::GUI::AtkResNode* NumOtherPartiesRecruitingResNode;
    /* 0x03C8 */ Component::GUI::AtkComponentButton* SettingsButton[0x8];
    /*        */ byte _gap_0x408[0x12A0];
    /* 0x16A8 */ unsigned __int32 SelectedRadioButton;
    /*        */ byte _gap_0x16AC[0x4];
    /*        */ byte _gap_0x16B0[0x4];
    /* 0x16B4 */ unsigned __int32 SelectedRow;
    /* 0x16B8 */ unsigned __int32 NumEntries;
    /*        */ byte _gap_0x16BC[0x4];
    /*        */ byte _gap_0x16C0[0x8];
};

__unaligned struct Client::UI::AddonContentsFinder::AddonContentsFinderVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::UI::AddonContentsFinderConfirm /* Size=0x2A0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x8];
    /* 0x228 */ Component::GUI::AtkTextNode* AtkTextNode228;
    /* 0x230 */ Component::GUI::AtkTextNode* AtkTextNode230;
    /* 0x238 */ Component::GUI::AtkTextNode* AtkTextNode238;
    /* 0x240 */ Component::GUI::AtkTextNode* AtkTextNode240;
    /* 0x248 */ Component::GUI::AtkTextNode* AtkTextNode248;
    /*       */ byte _gap_0x250[0x38];
    /* 0x288 */ Component::GUI::AtkComponentButton* CommenceButton;
    /* 0x290 */ Component::GUI::AtkComponentButton* WithdrawButton;
    /* 0x298 */ Component::GUI::AtkComponentButton* WaitButton;
};

__unaligned struct Client::UI::AddonContentsFinderConfirm::AddonContentsFinderConfirmVTable /* Size=0x1 */
{
    /*     */ byte _gap_0x0;
};

__unaligned struct Client::UI::AddonContextIconMenu /* Size=0x2B0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ __int32 EntryCount;
    /*       */ byte _gap_0x224[0x4];
    /*       */ byte _gap_0x228[0x18];
    /* 0x240 */ Component::GUI::AtkComponentList* AtkComponentList240;
    /* 0x248 */ void* unk248;
    /* 0x250 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton250;
    /* 0x258 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton258;
    /* 0x260 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton260;
    /* 0x268 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton268;
    /* 0x270 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton270;
    /* 0x278 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton278;
    /* 0x280 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton280;
    /* 0x288 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton288;
    /* 0x290 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton290;
    /* 0x298 */ Component::GUI::AtkComponentRadioButton* AtkComponentRadioButton298;
    /*       */ byte _gap_0x2A0[0x10];
};

__unaligned struct Client::UI::AddonContextMenu /* Size=0x2A0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x80];
};

__unaligned struct Client::UI::AddonCutSceneSelectString /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x10];
    /* 0x230 */ Component::GUI::AtkComponentList* OptionList;
    /* 0x238 */ Component::GUI::AtkComponentTextNineGrid* TextLabel;
    /*       */ byte _gap_0x240[0x8];
};

__unaligned struct Client::UI::AddonDeliveryItemInfo /* Size=0x68 */
{
    /* 0x00 */ unsigned __int32 ItemId;
    /*      */ byte _gap_0x4[0x4];
    /*      */ byte _gap_0x8[0x60];
};

__unaligned struct Client::UI::AddonDtr /* Size=0x368 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Client::System::String::Utf8String TimeModeTooltip;
    /* 0x288 */ Client::System::String::Utf8String NetworkInfoTooltip;
    /*       */ byte _gap_0x2F0[0x8];
    /* 0x2F8 */ Component::GUI::AtkTextNode* TimeText;
    /* 0x300 */ Component::GUI::AtkResNode* NetworkStrengthContainer;
    /* 0x308 */ Component::GUI::AtkImageNode* NetworkStrengthImage;
    /* 0x310 */ Component::GUI::AtkResNode* MailContainer;
    /* 0x318 */ Component::GUI::AtkImageNode* MailImage;
    /* 0x320 */ Component::GUI::AtkTextNode* MailText;
    /* 0x328 */ Component::GUI::AtkResNode* DutyRecorderContainer;
    /* 0x330 */ Component::GUI::AtkResNode* AlarmsContainer;
    /* 0x338 */ Component::GUI::AtkResNode* WalkModeContainer;
    /* 0x340 */ Component::GUI::AtkResNode* WorldInfoContainer;
    /* 0x348 */ Component::GUI::AtkTextNode* WorldText;
    /* 0x350 */ Component::GUI::AtkImageNode* WorldVisitImage;
    /* 0x358 */ Component::GUI::AtkCollisionNode* CollisionNode;
    /*       */ byte _gap_0x360[0x8];
};

__unaligned struct Client::UI::AddonEnemyList /* Size=0x278 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton** EnemyOneComponent;
    /*       */ byte _gap_0x228[0x48];
    /*       */ byte _gap_0x270[0x2];
    /* 0x272 */ byte EnemyCount;
    /* 0x273 */ byte HoveredIndex;
    /* 0x274 */ byte SelectedIndex;
    /*       */ byte _gap_0x275;
    /*       */ byte _gap_0x276[0x2];
};

__unaligned struct Client::UI::AddonExp /* Size=0x290 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x50];
    /* 0x270 */ byte ClassJob;
    /*       */ byte _gap_0x271;
    /*       */ byte _gap_0x272[0x2];
    /*       */ byte _gap_0x274[0x4];
    /* 0x278 */ unsigned __int32 CurrentExp;
    /* 0x27C */ unsigned __int32 RequiredExp;
    /* 0x280 */ unsigned __int32 RestedExp;
    /*       */ byte _gap_0x284[0x4];
    /*       */ byte _gap_0x288[0x8];
};

__unaligned struct Client::UI::AddonFateReward /* Size=0x570 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkResNode* AtkResNode220;
    /* 0x228 */ Component::GUI::AtkImageNode* AtkImageNode228;
    /* 0x230 */ Component::GUI::AtkImageNode* AtkImageNode230;
    /* 0x238 */ Component::GUI::AtkResNode* AtkResNode238;
    /* 0x240 */ Component::GUI::AtkTextNode* AtkTextNode240;
    /* 0x248 */ Component::GUI::AtkTextNode* AtkTextNode248;
    /* 0x250 */ Component::GUI::AtkTextNode* AtkTextNode250;
    /* 0x258 */ Component::GUI::AtkImageNode* AtkImageNode258;
    /*       */ byte _gap_0x260[0x68];
    /* 0x2C8 */ Component::GUI::AtkComponentTextNineGrid* AtkComponentTextNineGrid2C8;
    /* 0x2D0 */ Component::GUI::AtkImageNode* AtkImageNode2D0;
    /* 0x2D8 */ Component::GUI::AtkResNode* AtkResNode2D8;
    /*       */ byte _gap_0x2E0[0x68];
    /* 0x348 */ Component::GUI::AtkComponentTextNineGrid* AtkComponentTextNineGrid348;
    /* 0x350 */ Component::GUI::AtkImageNode* AtkImageNode350;
    /* 0x358 */ Component::GUI::AtkResNode* AtkResNode358;
    /*       */ byte _gap_0x360[0x200];
    /* 0x560 */ Component::GUI::AtkResNode* AtkResNode560;
    /* 0x568 */ float ElapsedSeconds;
    /*       */ byte _gap_0x56C[0x4];
};

__unaligned struct Client::UI::AddonFieldMarkerInfo /* Size=0x18 */
{
    /* 0x00 */ __int32 IconId;
    /* 0x04 */ __int32 Active;
    /* 0x08 */ byte* TooltipString;
    /* 0x10 */ __int32 Slot;
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::UI::AddonFieldMarker /* Size=0x598 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x10];
    /* 0x230 */ __int32 HoveredButtonIndex;
    /*       */ byte _gap_0x234[0x4];
    /* 0x238 */ Client::UI::AddonFieldMarkerInfo FieldMarkerInfo[0x8];
    /*       */ byte _gap_0x2F8[0x280];
    /*       */ byte _gap_0x578[0x4];
    /* 0x57C */ __int32 HoveredPresetIndex;
    /* 0x580 */ byte SelectedPage;
    /*       */ byte _gap_0x581;
    /*       */ byte _gap_0x582[0x2];
    /*       */ byte _gap_0x584[0x4];
    /*       */ byte _gap_0x588[0x10];
};

__unaligned struct Client::UI::AddonFriendList /* Size=0x380 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xD0];
    /* 0x2F0 */ Component::GUI::AtkComponentList* FriendList;
    /* 0x2F8 */ Component::GUI::AtkComponentButton* AddButton;
    /* 0x300 */ Component::GUI::AtkComponentCheckBox* MoveOnlineToTopCheckBox;
    /* 0x308 */ Component::GUI::AtkTextNode* CurrentFriendCountTextNode;
    /* 0x310 */ Component::GUI::AtkTextNode* ListIsEmptyTextNode;
    /*       */ byte _gap_0x318[0x8];
    /* 0x320 */ Component::GUI::AtkComponentDropDownList* FilterDropDownList;
    /* 0x328 */ Component::GUI::AtkComponentDropDownList* SortDropDownList;
    /*       */ byte _gap_0x330[0x50];
};

__unaligned struct Client::UI::AddonGathering /* Size=0x300 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkResNode* UnkResNode220;
    /* 0x228 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox1;
    /* 0x230 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox2;
    /* 0x238 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox3;
    /* 0x240 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox4;
    /* 0x248 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox5;
    /* 0x250 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox6;
    /* 0x258 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox7;
    /* 0x260 */ Component::GUI::AtkComponentCheckBox* GatheredItemComponentCheckBox8;
    /* 0x268 */ Component::GUI::AtkTextNode* InventoryQuantityTextNode;
    /* 0x270 */ Component::GUI::AtkResNode* UnkResNode270;
    /* 0x278 */ Component::GUI::AtkComponentCheckBox* QuickGatheringComponentCheckBox;
    /* 0x280 */ Component::GUI::AtkResNode* UnkResNode;
    /* 0x288 */ unsigned __int64 unk288;
    /* 0x290 */ unsigned __int64 unk290;
    /* 0x298 */ unsigned __int64 unk298;
    /* 0x2A0 */ unsigned __int64 unk2A0;
    /* 0x2A8 */ unsigned __int64 unk2A8;
    /* 0x2B0 */ unsigned __int64 unk2B0;
    /* 0x2B8 */ unsigned __int64 unk2B8;
    /* 0x2C0 */ unsigned __int64 unk2C0;
    /* 0x2C8 */ unsigned __int32 GatheredItemId1;
    /* 0x2CC */ unsigned __int32 GatheredItemId2;
    /* 0x2D0 */ unsigned __int32 GatheredItemId3;
    /* 0x2D4 */ unsigned __int32 GatheredItemId4;
    /* 0x2D8 */ unsigned __int32 GatheredItemId5;
    /* 0x2DC */ unsigned __int32 GatheredItemId6;
    /* 0x2E0 */ unsigned __int32 GatheredItemId7;
    /* 0x2E4 */ unsigned __int32 GatheredItemId8;
    /* 0x2E8 */ unsigned __int64 unk2E8;
    /* 0x2F0 */ unsigned __int64 unk2F0;
    /* 0x2F8 */ __int32 unk2F8;
    /* 0x2FC */ __int16 unk2FC;
    /*       */ byte _gap_0x2FE[0x2];
};

__unaligned struct Client::UI::AddonGatheringMasterpiece /* Size=0x7F8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x168];
    /* 0x388 */ Component::GUI::AtkComponentDragDrop* CollectDragDrop;
    /*       */ byte _gap_0x390[0x468];
};

__unaligned struct Client::UI::AddonGcArmyCapture /* Size=0x268 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeployButton;
    /* 0x228 */ Component::GUI::AtkComponentList* MissionList;
    /* 0x230 */ Component::GUI::AtkComponentList* ChosenRecruitList;
    /* 0x238 */ Component::GUI::AtkTextNode* ScriptsTextNode;
    /* 0x240 */ Component::GUI::AtkTextNode* ExpRewardTextNode;
    /* 0x248 */ Component::GUI::AtkComponentBase* ExpRewardComponent;
    /* 0x250 */ Component::GUI::AtkTextNode* ExpendituresTextNode;
    /* 0x258 */ Component::GUI::AtkTextNode* MissionLevelTextNode;
    /* 0x260 */ Component::GUI::AtkTextNode* MissionRequirementsTextNode;
};

__unaligned struct Client::UI::AddonGcArmyExpedition /* Size=0x2E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeployButton;
    /* 0x228 */ Component::GUI::AtkComponentList* MissionList;
    /*       */ byte _gap_0x230[0x8];
    /* 0x238 */ Component::GUI::AtkTextNode* ListHeaderTextNode;
    /* 0x240 */ Component::GUI::AtkTextNode* ScriptsTextNode;
    /* 0x248 */ Component::GUI::AtkTextNode* MissionDescriptionTextNode;
    /*       */ byte _gap_0x250[0x8];
    /* 0x258 */ Component::GUI::AtkComponentBase* SquadronExpRewardComponentNode;
    /* 0x260 */ Component::GUI::AtkComponentBase* ItemRewardComponentNode;
    /* 0x268 */ Component::GUI::AtkTextNode* MissionSealCostTextNode;
    /* 0x270 */ Component::GUI::AtkResNode* MissionLevelResNode;
    /* 0x278 */ Component::GUI::AtkTextNode* MissionLevelTextNode;
    /*       */ byte _gap_0x280[0x18];
    /* 0x298 */ Component::GUI::AtkComponentBase* RequiredAttributesComponentNode;
    /* 0x2A0 */ Component::GUI::AtkComponentBase* CurrentAttributesComponentNode;
    /*       */ byte _gap_0x2A8[0x18];
    /* 0x2C0 */ Component::GUI::AtkResNode* SquadronSergeantImageResNode;
    /* 0x2C8 */ Component::GUI::AtkResNode* SquadronSergeantChatMessageResNode;
    /* 0x2D0 */ Component::GUI::AtkTextNode* SquadronSergeantChatMessageTextNode;
    /* 0x2D8 */ __int32 SelectedTab;
    /*       */ byte _gap_0x2DC[0x4];
    /*       */ byte _gap_0x2E0[0x8];
};

__unaligned struct Client::UI::AddonGcArmyExpeditionResult /* Size=0x228 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* CompleteButton;
};

__unaligned struct Component::GUI::AtkComponentRadioButton /* Size=0xF8 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase AtkComponentBase;
    /*      */ byte _gap_0xC0[0x38];
};

__unaligned struct Client::UI::AddonGoldSaucerInfo /* Size=0x310 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ __int32 SelectedCategory;
    /* 0x224 */ __int32 SelectedSubCategory;
    /*       */ byte _gap_0x228[0x78];
    /* 0x2A0 */ Component::GUI::AtkComponentRadioButton* CategoryRadioButtons[0x6];
    /* 0x2D0 */ Component::GUI::AtkComponentRadioButton* ChocoboRadioButtons[0x3];
    /* 0x2E8 */ Component::GUI::AtkCollisionNode* ContentsSection;
    /*       */ byte _gap_0x2F0[0x8];
    /* 0x2F8 */ Component::GUI::AtkResNode* ChocoboPetInfo;
    /* 0x300 */ Component::GUI::AtkNineGridNode* ChocoboPetExpBar;
    /* 0x308 */ __int32 ChocoboPetExpBarWidth;
    /*       */ byte _gap_0x30C[0x4];
};

__unaligned struct Client::UI::AddonGrandCompanySupplyList /* Size=0x760 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x60];
    /* 0x280 */ Component::GUI::AtkComponentList* SupplyProvisioningList;
    /* 0x288 */ Component::GUI::AtkComponentList* ExpertDeliveryList;
    /* 0x290 */ Component::GUI::AtkComponentDropDownList* SortByDropdown;
    /* 0x298 */ Component::GUI::AtkComponentDropDownList* FilterDropdown;
    /* 0x2A0 */ Component::GUI::AtkComponentRadioButton* SupplyRadioButton;
    /* 0x2A8 */ Component::GUI::AtkComponentRadioButton* ProvisioningRadioButton;
    /* 0x2B0 */ Component::GUI::AtkComponentRadioButton* ExpertDeliveryRadioButton;
    /*       */ byte _gap_0x2B8[0x8];
    /* 0x2C0 */ Component::GUI::AtkTextNode* NextMissionAllowanceTextNode;
    /* 0x2C8 */ Component::GUI::AtkTextNode* ListEmptyTextNode;
    /* 0x2D0 */ Component::GUI::AtkTextNode* SealCountTextNode;
    /* 0x2D8 */ Component::GUI::AtkImageNode* SealIconNode;
    /*       */ byte _gap_0x2E0[0x8];
    /* 0x2E8 */ __int32 SelectedTab;
    /* 0x2EC */ __int32 SelectedSortBy;
    /* 0x2F0 */ __int32 SelectedFilter;
    /*       */ byte _gap_0x2F4[0x4];
    /*       */ byte _gap_0x2F8[0x468];
};

__unaligned struct Client::UI::AddonGrandCompanySupplyReward /* Size=0x230 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentButton* DeliverButton;
    /* 0x228 */ Component::GUI::AtkComponentButton* CancelButton;
};

__unaligned struct Client::UI::AddonGSInfoCardDeck /* Size=0x228 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentList* DeckList;
};

__unaligned struct Client::UI::AddonGSInfoCardList /* Size=0x540 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x128];
    /* 0x348 */ Component::GUI::AtkResNode* PageSelection;
    /* 0x350 */ Component::GUI::AtkComponentButton* PageButtons[0x9];
    /* 0x398 */ Component::GUI::AtkComponentButton* GotoFirstPageButton;
    /* 0x3A0 */ Component::GUI::AtkComponentButton* GotoLastPageButton;
    /*       */ byte _gap_0x3A8[0x10];
    /* 0x3B8 */ Component::GUI::AtkComponentButton* CardButtons[0x1E];
    /* 0x4A8 */ Component::GUI::AtkTextNode* TotalTextNode;
    /* 0x4B0 */ Component::GUI::AtkImageNode* SelectedButtonBorderImage;
    /* 0x4B8 */ Component::GUI::AtkComponentDropDownList* CardDisplayFilter;
    /*       */ byte _gap_0x4C0[0x10];
    /* 0x4D0 */ Component::GUI::AtkTextNode* SelectedCardName;
    /* 0x4D8 */ Component::GUI::AtkTextNode* SelectedCardTribeName;
    /* 0x4E0 */ Component::GUI::AtkTextNode* SelectedCardDescription;
    /* 0x4E8 */ Component::GUI::AtkTextNode* PreviewedCardNumber;
    /* 0x4F0 */ Component::GUI::AtkTextNode* SelectedCardNumber;
    /* 0x4F8 */ Component::GUI::AtkTextNode* SelectedCardAcquisitionName;
    /* 0x500 */ Component::GUI::AtkImageNode* SelectedCardAcquisitionIcon;
    /* 0x508 */ Client::UI::GSInfoCardListFilterMode FilterMode;
    /*       */ byte _gap_0x50C[0x4];
    /* 0x510 */ __int32 SelectedPage;
    /* 0x514 */ __int32 SelectedCardIndex;
    /*       */ byte _gap_0x518[0x28];
};

__unaligned struct Client::UI::AddonGSInfoChocoboParam /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Component::GUI::AtkComponentBase* RaceAbility1;
    /* 0x240 */ Component::GUI::AtkComponentBase* RaceAbility2;
};

__unaligned struct Client::UI::AddonGSInfoEmj /* Size=0x258 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkTextNode* MatchesPlayed;
    /* 0x228 */ Component::GUI::AtkTextNode* CurrentRating;
    /* 0x230 */ Component::GUI::AtkTextNode* HighestRating;
    /* 0x238 */ Component::GUI::AtkTextNode* Rank;
    /* 0x240 */ Component::GUI::AtkTextNode* NextRankPoints;
    /* 0x248 */ Component::GUI::AtkTextNode* Points;
    /* 0x250 */ Component::GUI::AtkComponentButton* ResetRankButton;
};

__unaligned struct Client::UI::AddonGSInfoGeneral /* Size=0x250 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentBase* MGPAmountDisplay;
    /* 0x228 */ Component::GUI::AtkComponentBase* TournamentMatches;
    /* 0x230 */ Component::GUI::AtkComponentBase* TournamentWins;
    /* 0x238 */ Component::GUI::AtkComponentBase* TournamentPoints;
    /* 0x240 */ Component::GUI::AtkComponentBase* TournamentInfo;
    /* 0x248 */ Component::GUI::AtkResNode* TournamentResults;
};

__unaligned struct Client::UI::AddonGSInfoMinionBattle /* Size=0x248 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentBase* TournamentMatches;
    /* 0x228 */ Component::GUI::AtkComponentBase* TournamentWins;
    /* 0x230 */ Component::GUI::AtkComponentBase* TournamentPoints;
    /* 0x238 */ Component::GUI::AtkComponentBase* TournamentInfo;
    /* 0x240 */ Component::GUI::AtkResNode* TournamentResults;
};

__unaligned struct Client::UI::AddonGuildLeve /* Size=0x18F0 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x8];
    /* 0x0228 */ Component::GUI::AtkComponentTreeList* AtkComponentTreeList228;
    /* 0x0230 */ Component::GUI::AtkComponentRadioButton* FieldcraftButton;
    /* 0x0238 */ Component::GUI::AtkComponentRadioButton* TradecraftButton;
    /*        */ byte _gap_0x240[0x8];
    union {
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* CarpenterButton;
    /* 0x0248 */ Component::GUI::AtkComponentRadioButton* MinerButton;
    } _union_0x248;
    union {
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* BlacksmithButton;
    /* 0x0250 */ Component::GUI::AtkComponentRadioButton* BotanistButton;
    } _union_0x250;
    union {
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* ArmorerButton;
    /* 0x0258 */ Component::GUI::AtkComponentRadioButton* FisherButton;
    } _union_0x258;
    /* 0x0260 */ Component::GUI::AtkComponentRadioButton* GoldsmithButton;
    /* 0x0268 */ Component::GUI::AtkComponentRadioButton* LeatherworkerButton;
    /* 0x0270 */ Component::GUI::AtkComponentRadioButton* WeaverButton;
    /* 0x0278 */ Component::GUI::AtkComponentRadioButton* AlchemistButton;
    /* 0x0280 */ Component::GUI::AtkComponentRadioButton* CulinarianButton;
    /* 0x0288 */ Component::GUI::AtkResNode* AtkResNode288;
    union {
    /* 0x0290 */ Client::System::String::Utf8String CarpenterString;
    /* 0x0290 */ Client::System::String::Utf8String MinerString;
    } _union_0x290;
    union {
    /* 0x02F8 */ Client::System::String::Utf8String BlacksmithString;
    /* 0x02F8 */ Client::System::String::Utf8String BotanistString;
    } _union_0x2F8;
    union {
    /* 0x0360 */ Client::System::String::Utf8String ArmorerString;
    /* 0x0360 */ Client::System::String::Utf8String FisherString;
    } _union_0x360;
    /* 0x03C8 */ Client::System::String::Utf8String GoldsmithString;
    /* 0x0430 */ Client::System::String::Utf8String LeatherworkerString;
    /* 0x0498 */ Client::System::String::Utf8String WeaverString;
    /* 0x0500 */ Client::System::String::Utf8String AlchemistString;
    /* 0x0568 */ Client::System::String::Utf8String CulinarianString;
    /* 0x05D0 */ Component::GUI::AtkComponentButton* JournalButton;
    /* 0x05D8 */ Component::GUI::AtkTextNode* AtkTextNode298;
    /* 0x05E0 */ Component::GUI::AtkComponentBase* AtkComponentBase290;
    /* 0x05E8 */ Component::GUI::AtkComponentBase* AtkComponentBase298;
    /*        */ byte _gap_0x5F0[0x1300];
};

__unaligned struct Client::UI::AddonHudLayoutScreen /* Size=0x8E8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xA8];
    /* 0x2C8 */ Client::UI::AddonHudLayoutWindow* HudLayoutWindow;
    /*       */ byte _gap_0x2D0[0x270];
    /* 0x540 */ Component::GUI::AtkComponentNode* SelectedOverlayNode;
    /*       */ byte _gap_0x548[0x268];
    /* 0x7B0 */ Client::UI::MoveableAddonInfoStruct* SelectedAddon;
    /*       */ byte _gap_0x7B8[0x130];
};

__unaligned struct Client::UI::AddonHudLayoutWindow /* Size=0x268 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x18];
    /* 0x238 */ Component::GUI::AtkComponentButton* SaveButton;
    /*       */ byte _gap_0x240[0x28];
};

__unaligned struct Client::UI::AddonImage /* Size=0x290 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0x40];
    /* 0x260 */ Component::GUI::AtkResNode* ResNode1;
    /* 0x268 */ Component::GUI::AtkResNode* ResNode2;
    /* 0x270 */ Component::GUI::AtkImageNode* ImageNode;
    /*       */ byte _gap_0x278[0x4];
    /* 0x27C */ unsigned __int16 Width;
    /*       */ byte _gap_0x27E[0x2];
    /* 0x280 */ unsigned __int16 Height;
    /*       */ byte _gap_0x282[0x2];
    /*       */ byte _gap_0x284[0x4];
    /*       */ byte _gap_0x288[0x8];
};

__unaligned struct Client::UI::AddonItemDonationInfo /* Size=0x30 */
{
    /* 0x00 */ void* UnkPtr1;
    /* 0x08 */ void* UnkPtr2;
    /* 0x10 */ void* UnkPtr3;
    /* 0x18 */ void* UnkPtr4;
    /* 0x20 */ void* UnkPtr5;
    /*      */ byte _gap_0x28[0x4];
    /* 0x2C */ __int32 UnkValue1;
};

__unaligned struct Client::UI::AddonItemInspectionList /* Size=0x1230 */
{
    /* 0x0000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*        */ byte _gap_0x220[0x1010];
};

__unaligned struct Client::UI::AddonItemInspectionResult /* Size=0x2F8 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /*       */ byte _gap_0x220[0xD8];
};

__unaligned struct Client::UI::AddonItemSearchResult /* Size=0x3D0 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ Component::GUI::AtkComponentIcon* ItemIcon;
    /* 0x228 */ Component::GUI::AtkTextNode* ItemName;
    /*       */ byte _gap_0x230[0x18];
    /* 0x248 */ Component::GUI::AtkComponentButton* History;
    /* 0x250 */ Component::GUI::AtkComponentButton* AdvancedSearch;
    /*       */ byte _gap_0x258[0x8];
    /* 0x260 */ Component::GUI::AtkComponentList* Results;
    /* 0x268 */ Component::GUI::AtkTextNode* HitsMessage;
    /* 0x270 */ Component::GUI::AtkTextNode* ErrorMessage;
    /*       */ byte _gap_0x278[0x158];
};

__unaligned struct Client::UI::AddonJobHud /* Size=0x260 */
{
    /* 0x000 */ Component::GUI::AtkUnitBase AtkUnitBase;
    /* 0x220 */ byte Unk220;
    /* 0x221 */ bool UseSimpleGauge;
    /* 0x222 */ byte Unk222;
    /*       */ byte _gap_0x223;
    /*       */ byte _gap_0x224[0x4];
    /* 0x228 */ Client::UI::AddonJobHud::AddonJobHudGauge* GaugeStandard;
    /* 0x230 */ Client::UI::AddonJobHud::AddonJobHudGauge* GaugeSimple;
    /* 0x238 */ Client::UI::AddonJobHud::AddonJobHudGaugeData* DataPrevious;
    /* 0x240 */ Client::UI::AddonJobHud::AddonJobHudGaugeData* DataCurrent;
    /* 0x248 */ Component::GUI::AtkResNode* RootNode;
    /* 0x250 */ __int32 TimelineLabelStandard;
    /* 0x254 */ __int32 TimelineLabelSimple;
    /*       */ byte _gap_0x258[0x8];
};

__unaligned struct Client::UI::AddonJobHud::AddonJobHudGauge /* Size=0x10 */
{
    /* 0x00 */ void* vtbl;
    /* 0x08 */ Client::UI::AddonJobHud* JobHud;
};

__unaligned struct Client::UI::AddonJobHud::AddonJobHudGaugeData /* Size=0x8 */
{
    /* 0x0 */ void* vtbl;
};

__unaligned struct Client::UI::AddonJobHudACN0::AetherflowACNGaugeData /* Size=0x10 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGaugeData GaugeData;
    /* 0x08 */ byte AetherflowStacks;
    /* 0x09 */ byte Prerequisites[0x1];
    /*      */ byte _gap_0xA[0x2];
    /*      */ byte _gap_0xC[0x4];
};

__unaligned struct Client::UI::AddonJobHudACN0::AetherflowACNGauge::AetherflowACNStack /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* StackContainer;
    /* 0x08 */ Component::GUI::AtkResNode* StackNode;
    /* 0x10 */ bool StackReady;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::UI::AddonJobHudACN0::AetherflowACNGauge /* Size=0x60 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGauge Gauge;
    /* 0x10 */ Client::UI::AddonJobHudACN0::AetherflowACNGauge::AetherflowACNStack AetherflowStacks[0x3];
    /* 0x58 */ __int32 TimelineFrameId;
    /*      */ byte _gap_0x5C[0x4];
};

__unaligned struct Client::UI::AddonJobHudACN0::AetherflowACNGaugeSimple::AetherflowACNStackSimple /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* StackContainer;
    /* 0x08 */ Component::GUI::AtkResNode* StackNode;
    /* 0x10 */ bool StackReady;
    /*      */ byte _gap_0x11;
    /*      */ byte _gap_0x12[0x2];
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::UI::AddonJobHudACN0::AetherflowACNGaugeSimple /* Size=0x60 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGauge Gauge;
    /* 0x10 */ Client::UI::AddonJobHudACN0::AetherflowACNGaugeSimple::AetherflowACNStackSimple AetherflowStacks[0x3];
    /* 0x58 */ __int32 TimelineFrameId;
    /*      */ byte _gap_0x5C[0x4];
};

__unaligned struct Client::UI::AddonJobHudACN0 /* Size=0x340 */
{
    /* 0x000 */ Client::UI::AddonJobHud JobHud;
    /* 0x260 */ Client::UI::AddonJobHudACN0::AetherflowACNGaugeData DataPrevious;
    /* 0x270 */ Client::UI::AddonJobHudACN0::AetherflowACNGaugeData DataCurrent;
    /* 0x280 */ Client::UI::AddonJobHudACN0::AetherflowACNGauge GaugeStandard;
    /* 0x2E0 */ Client::UI::AddonJobHudACN0::AetherflowACNGaugeSimple GaugeSimple;
};

__unaligned struct Client::UI::AddonJobHudAST0::ArcanaGaugeData /* Size=0x40 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGaugeData GaugeData;
    /* 0x08 */ byte Prerequisites[0x3];
    /*      */ byte _gap_0xB;
    /* 0x0C */ __int32 DrawnCard;
    /* 0x10 */ __int32 DrawnMinorArcanum;
    /* 0x14 */ __int32 DrawnRoleBuff;
    /* 0x18 */ __int32 DrawnAstrosign;
    /* 0x1C */ __int32 Astrosign1;
    /* 0x20 */ __int32 Astrosign2;
    /* 0x24 */ __int32 Astrosign3;
    /*      */ byte _gap_0x28[0x8];
    /* 0x30 */ byte* CardName;
    /* 0x38 */ byte* MinorArcanaName;
};

__unaligned struct Client::UI::AddonJobHudAST0::Astrosign /* Size=0x18 */
{
    /* 0x00 */ Component::GUI::AtkComponentBase* Container;
    /* 0x08 */ Component::GUI::AtkResNode* Symbol;
    /* 0x10 */ __int32 Type;
    /*      */ byte _gap_0x14[0x4];
};

__unaligned struct Client::UI::AddonJobHudAST0::ArcanaGauge /* Size=0xC8 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGauge Gauge;
    /* 0x10 */ Component::GUI::AtkResNode* Container;
    /* 0x18 */ Component::GUI::AtkComponentBase* CardContainer;
    /* 0x20 */ Component::GUI::AtkTextNode* CardName;
    /* 0x28 */ Component::GUI::AtkResNode* CardAstrosign;
    /* 0x30 */ Component::GUI::AtkResNode* CardSymbol;
    /* 0x38 */ Component::GUI::AtkResNode* CardBorder;
    /* 0x40 */ Component::GUI::AtkResNode* GaugePlate;
    /* 0x48 */ Component::GUI::AtkResNode* MinorArcanaContainer;
    /* 0x50 */ Component::GUI::AtkTextNode* MinorArcanaName;
    /* 0x58 */ Component::GUI::AtkResNode* MinorArcanaSymbol;
    /* 0x60 */ Component::GUI::AtkResNode* AstrosignContainer;
    /*      */ byte _gap_0x68[0x10];
    /* 0x78 */ Client::UI::AddonJobHudAST0::Astrosign Astrosigns[0x3];
    /*      */ byte _gap_0xC0[0x8];
};

__unaligned struct Client::UI::AddonJobHudAST0::ArcanaGaugeSimple /* Size=0xC0 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGauge Gauge;
    /* 0x10 */ Component::GUI::AtkComponentBase* CardContainer;
    /* 0x18 */ Component::GUI::AtkComponentTextNineGrid* CardName;
    /* 0x20 */ Component::GUI::AtkResNode* CardAstrosign;
    /* 0x28 */ Component::GUI::AtkResNode* CardSymbol;
    /* 0x30 */ Component::GUI::AtkResNode* CardBorder;
    /* 0x38 */ Component::GUI::AtkResNode* Container;
    /* 0x40 */ Component::GUI::AtkComponentBase* MinorArcanaContainer;
    /* 0x48 */ Component::GUI::AtkComponentTextNineGrid* MinorArcanaName;
    /* 0x50 */ Component::GUI::AtkResNode* MinorArcanaSymbol;
    /* 0x58 */ Component::GUI::AtkResNode* AstrosignContainer;
    /*      */ byte _gap_0x60[0x10];
    /* 0x70 */ Client::UI::AddonJobHudAST0::Astrosign Astrosigns[0x3];
    /*      */ byte _gap_0xB8[0x8];
};

__unaligned struct Client::UI::AddonJobHudAST0 /* Size=0x468 */
{
    /* 0x000 */ Client::UI::AddonJobHud JobHud;
    /* 0x260 */ Client::UI::AddonJobHudAST0::ArcanaGaugeData DataPrevious;
    /* 0x2A0 */ Client::UI::AddonJobHudAST0::ArcanaGaugeData DataCurrent;
    /* 0x2E0 */ Client::UI::AddonJobHudAST0::ArcanaGauge GaugeStandard;
    /* 0x3A8 */ Client::UI::AddonJobHudAST0::ArcanaGaugeSimple GaugeSimple;
};

__unaligned struct Client::UI::AddonJobHudBLM0::ElementalGaugeData /* Size=0x38 */
{
    /* 0x00 */ Client::UI::AddonJobHud::AddonJobHudGaugeData GaugeData;
    /* 0x08 */ byte Prerequisites[0x5];
    /*      */ byte _gap_0xD;
    /*      */ byte _gap_0xE[0x2];
    /* 0x10 */ __int32 ElementStacks;
    /* 0x14 */ __int32 ElementStackMax;
    /* 0x18 */ __int32 ElementTimeLeft;
    /* 0x1C */ __int32 ElementMaxTime;
    /* 0x20 */ __int32 UmbralHearts;
    /* 0x24 */ __int32 EnochianTimer;
