using FFXIVClientStructs.FFXIV.Client.UI;

namespace FFXIVClientStructs.FFXIV.Client.System.Input;

// Client::System::Input::InputData
[GenerateInterop(isInherited: true)]
[StructLayout(LayoutKind.Explicit, Size = 0x9D0)]
public unsafe partial struct InputData {
    [FieldOffset(0x8)] public GamepadInputData GamepadInputs;
    [FieldOffset(0x254)] public GamepadInputData GamepadInputs2;
    /*
     * UIFiltered means those are not set if
     * - the game window is focused and
     * - the cursor is hovering any interactable UI elements or windows
     *
     * For mouse buttons, only Left and Right buttons are filtered out, extra buttons are not
     */
    [FieldOffset(0x4A0)] public CursorInputData UIFilteredCursorInputs;
    [FieldOffset(0x4D0)] public CursorInputData CursorInputs;
    /*
     * All the following keyboard keys states are not triggered if the chat input is active
     */
    [FieldOffset(0x500)] public KeyboardInputData KeyboardInputs;
    [FieldOffset(0x994)] public GamepadModifierFlag CurrentGamepadModifier;
    [FieldOffset(0x995)] public KeyModifierFlag CurrentKeyModifier;

    [FieldOffset(0x9AE)] public bool GamepadInputs2ButtonsChanged;
    [FieldOffset(0x9AF)] public bool CursorPositionsChanged;
    [FieldOffset(0x9B0)] public bool KeyboardInputsChanged;
    [FieldOffset(0x9B1)] public bool UIFilteredCursorInputsButtonsChanged;
    [FieldOffset(0x9B2)] public bool GamepadInputsButtonsChanged;

    [FieldOffset(0x9B4)] public int NumKeybinds; // amount of InputIds
    [FieldOffset(0x9B8)] public Keybind* Keybinds; // index is InputId

    [FieldOffset(0x9C8)] public InputCodeModifiedInterface* InputCodeModifiedCallback;

    public Span<Keybind> GetKeybindSpan() => new(Keybinds, NumKeybinds);

    [VirtualFunction(2)]
    public partial void SetKeybind(InputId inputId, Keybind* keybind);

    [MemberFunction("E9 ?? ?? ?? ?? 83 7F 44 02")]
    public partial bool IsInputIdPressed(InputId inputId);

    [MemberFunction("E8 ?? ?? ?? ?? 4C 8D 76 06")]
    public partial bool IsInputIdDown(InputId inputId);

    [MemberFunction("E8 ?? ?? ?? ?? 84 C0 74 37 EB 06")]
    public partial bool IsInputIdHeld(InputId inputId);

    [MemberFunction("E8 ?? ?? ?? ?? 88 43 0F")]
    public partial bool IsInputIdReleased(InputId inputId);

    [MemberFunction("E8 ?? ?? ?? ?? 33 FF 0F B6 DB")]
    public partial Keybind* GetKeybind(InputId inputId);

    public Keybind* GetKeybind(int index) => GetKeybind((InputId)index);

    [GenerateInterop(isInherited: true)]
    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public partial struct InputCodeModifiedInterface {
        /// <remarks> Called in <see cref="SetKeybind"/>. </remarks>
        [VirtualFunction(0)]
        public partial void OnInputCodeModified(InputId inputId, Keybind* keybind);
    }
}

[StructLayout(LayoutKind.Explicit, Size = 0x24C)]
public struct GamepadInputData {
    [FieldOffset(0x0)] public int LeftStickX; // from -99 (Right) to 99 (Left)
    [FieldOffset(0x4)] public int LeftStickY; // from -99 (Down) to 99 (Up)
    [FieldOffset(0x8)] public int RightStickX; // from -99 (Right) to 99 (Left)
    [FieldOffset(0xC)] public int RightStickY; // from -99 (Down) to 99 (Up)
    [FieldOffset(0x10)] public GamepadButtonsFlags Buttons; // Not always set if UI is focused
    [FieldOffset(0x14)] public GamepadButtonsFlags ButtonsPressed;
    [FieldOffset(0x18)] public GamepadButtonsFlags ButtonsReleased;
    [FieldOffset(0x20)] public GamepadButtonsFlags ButtonsRepeat;

    // These fields are only correct for actual physical Playstation Controllers
    // Tested with Sony DualSense Controller Model: CFI-ZCT1W
    [FieldOffset(0x24)] public float Square;
    [FieldOffset(0x28)] public float Cross;
    [FieldOffset(0x2C)] public float Circle;
    [FieldOffset(0x30)] public float Triangle;
    [FieldOffset(0x34)] public float L1;
    [FieldOffset(0x38)] public float R1;
    [FieldOffset(0x3C)] public float L2;
    [FieldOffset(0x40)] public float R2;
    [FieldOffset(0x48)] public float Start;
    [FieldOffset(0x4C)] public float L3;
    [FieldOffset(0x50)] public float R3;
    [FieldOffset(0x54)] public float PSButton;
    [FieldOffset(0x58)] public float Select;
    [FieldOffset(0x5C)] public float MuteButton;

    [FieldOffset(0xA4)] public float LeftStickLeft;
    [FieldOffset(0xA8)] public float LeftStickRight;

    [FieldOffset(0xC4)] public float LeftStickUp;
    [FieldOffset(0xC8)] public float LeftStickDown;

    [FieldOffset(0xE4)] public float RightStickLeft;
    [FieldOffset(0xE8)] public float RightStickRight;

    [FieldOffset(0x144)] public float RightStickUp;
    [FieldOffset(0x148)] public float RightStickDown;

    // These values are weird... When DPadLeft is pressed it'll have value 1.0f, but DPadUp will have value 8.74278E-08
    [FieldOffset(0x184)] public float DPadLeft;
    [FieldOffset(0x188)] public float DPadRight;
    [FieldOffset(0x18C)] public float DPadUp;
    [FieldOffset(0x190)] public float DPadDown;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public struct CursorInputData {
    [FieldOffset(0x0)] public int PositionX;
    [FieldOffset(0x4)] public int PositionY;
    [FieldOffset(0x8)] public int MouseWheel; // -1 for scroll down, 1 for scroll up
    [FieldOffset(0xC)] public MouseButtonFlags MouseButtonHeldFlags;
    [FieldOffset(0x10)] public MouseButtonFlags MouseButtonPressedFlags;
    [FieldOffset(0x14)] public MouseButtonFlags MouseButtonReleasedFlags;
    [FieldOffset(0x18)] public MouseButtonFlags MouseButtonHeldThrottledFlags;

    [FieldOffset(0x20)] public int DeltaX; // Delta since last frame
    [FieldOffset(0x24)] public int DeltaY; // Delta since last frame

    // At least this is what it seems to be
    [FieldOffset(0x2C)] public bool IsGameWindowFocused;
}

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x494)]
public partial struct KeyboardInputData {
    /*
     * This one is weird. Seems to fire as long as the last key pressed is still held
     * Except modifiers (ctrl, shift, alt) where it only fires once
     * If fires less often than the "Down" flag in the array below but more often than the "Held" one
     * So Im not sure what to make of this or if this is even useful
     */
    //[FieldOffset(0x0)] public int IsLastKeyboardKeyDownThrottled;

    [FieldOffset(0x4), FixedSizeArray] internal FixedSizeArray159<KeyStateFlags> _keyState;

    //[FieldOffset(0x284)] private byte UnkFlag;
    [FieldOffset(0x285)] public byte KeyHeldKeycode;

    /*
     * Those two seem unreliable in how they're set. They work well on keypress
     * but one or the other will get nulled after a few ms when the key is held
     * or won't have their value changed on release.
     */
    [FieldOffset(0x288)] public byte LastKeyCharKeyCode; // (key code of the character just below, ie `97` for a lowercase `a`)
    [FieldOffset(0x290)] public char LastKeyChar; // (actual character made by key combination, ie `a` or `A`)
}

[GenerateInterop]
[StructLayout(LayoutKind.Explicit, Size = 0x0B)]
public partial struct Keybind {
    [FieldOffset(0x00), FixedSizeArray] internal FixedSizeArray2<KeySetting> _keySettings;
    [FieldOffset(0x04), FixedSizeArray] internal FixedSizeArray2<KeySetting> _gamepadSettings;
    [FieldOffset(0x08)] private ushort Unk8;
    [FieldOffset(0x0A)] private byte UnkA;
}

[StructLayout(LayoutKind.Explicit, Size = 0x02)]
public struct KeySetting {
    [FieldOffset(0x00)] public SeVirtualKey Key;
    [FieldOffset(0x01), CExporterUnion("Modifier")] public KeyModifierFlag KeyModifier;
    [FieldOffset(0x01), CExporterUnion("Modifier")] public GamepadModifierFlag GamepadModifier;
}

[Flags]
public enum GamepadModifierFlag : byte {
    None = 0,
    L1 = 1 << 0,
    R1 = 1 << 1,
    L2 = 1 << 2,
    R2 = 1 << 3,
    Start = 1 << 6,
    Select = 1 << 7,
}

[Flags]
public enum GamepadButtonsFlags : ushort {
    None = 0,
    DPadUp = 1 << 0,
    DPadDown = 1 << 1,
    DPadLeft = 1 << 2,
    DPadRight = 1 << 3,
    Triangle = 1 << 4,
    Cross = 1 << 5,
    Square = 1 << 6,
    Circle = 1 << 7,
    L1 = 1 << 8,
    L2 = 1 << 9,
    L3 = 1 << 10,
    R1 = 1 << 11,
    R2 = 1 << 12,
    R3 = 1 << 13,
    Select = 1 << 14,
    Start = 1 << 15,
}

[Flags]
public enum MouseButtonFlags {
    None = 0,
    LBUTTON = 1 << 0,
    MBUTTON = 1 << 1,
    RBUTTON = 1 << 2,
    XBUTTON1 = 1 << 3,
    XBUTTON2 = 1 << 4,
}

/*
 * Pressed and Held will always be accompanied by Down,
 * so actual possible values returned by GetKeyState will be 1, 3, 4 or 9
 */
[Flags]
